[
  "This topic covers questions on gradient, divergence, curl, Laplacian, and the fundamental theorems (Green's, Stokes', etc.).*",
  "\"Write Laplace's equation in parabolic cylindrical coordinates.\"* Q2 (b): ( ) ∫ + + c xy y dx x dy 2 2",
  "\"Explain the following giving examples and supported by figures: (a) Gradient (b) Divergence (c) Curl",
  "\"Verify Stoke's Theorem for the function F = x i -- xy j/2 integrated round the square in the plane z = 0 and bounded by the",
  "• Q2 (b): \"Determine the unit vectors in the spherical coordinate system.\" (10) • Q1 (a): \"Prove that",
  "\"Evaluate [a given line integral] counter clockwise around the boundary C of the region R by Green's theorem, where",
  "\"Find the equation of the integral surface of the differential equation 2y(z−3)p + (2x − z)q = y(2z − 3)",
  "This theme includes solving ODEs/PDEs by various methods, power series solutions, and Fourier integral approaches.*",
  "\"Using method of variation of parameters, find the general solution of the differential equation x e^y″ − 2y′ + y = ...\"*",
  "\"Find the recurrence formula for the power series solution around x = 0 for the differential equation",
  "(Tensor and transformation questions follow, but differential equations remain in Section A.)* Q1 (a): \"Solve by the method of variation of parameters:",
  "(∂z/∂x) + (∂z/∂y) = y + x, by elimination of arbitrary functions.\"* Q1 (a): \"Solve the differential equation:",
  "\"Use the method of Fourier integrals to find the solution of the initial value problem for ∂²u/∂t² = c² ∂²u/∂x², for −∞ < x < ∞, with u(x,0) = f(x).\"*",
  "Q3 (b): ∂²u/∂t² = c² ∂²u/∂x² with given boundary and initial conditions.\"* Q.No.1: \"Solve the following equations:",
  "\"Find the power series solution about x = 0 for the differential equation (1 − x)² y″ − x y′ + y = 0.\"*",
  "Q.No.3: \"Classify the following equations and solve: (i) [An equation involving partial derivatives in x and y]",
  "• Q7 (a): \"By using the regular Falsi method, solve Log x -- Cos x = 0.\" (10) • Q7 (b): \"Find f(7.5) using Newton--Gregory Backward Difference Interpolation",
  "• Q7 (b): \"Use Lagrange interpolation (first and second order) to evaluate f(x) at x = 15 given:",
  "(Other parts in 2017 cover mechanics and free-boundary PDEs; see Topic 3 below.) • Q4 (a): \"Solve the following Cauchy--Euler equation: x²y″ -- 4xy′ = 0.\" (10)",
  "• Q4 (b): \"Convert the following Bernoulli differential equation into standard form and solve: [Equation involving terms: (2/1)xy, etc.].\" (10)",
  "• Q5 (a): \"Convert the following ODE into standard form and solve using the method of variation of parameters:",
  "• Q6 (a): \"Find the Fourier series of f on the given interval [details as provided].\" (10) • Q6 (b):",
  "• Q8 (a): \"Approximate ∫₀¹ [1/(1+x²)] dx using the Trapezoidal and Simpson's rules with n = 4; compare with the exact value.\" (10)",
  "• Q3 (a): \"A system of forces acts on a plate in the form of an equilateral triangle (side = 2a). The moments about the three vertices are M₁, M₂,",
  "and M₃. Find the magnitude of the resultant.\" (10) • Q3 (b): \"If a particle P moves with velocity V given by V² = n²(ax² + 2bx + c), show that P executes simple harmonic motion. Find its centre, amplitude, and time period.\" (10)",
  "• Q4 (a): \"What is the difference between a linear differential equation and Bernoulli's equation? Also, find the solution of the differential",
  "... dx.\" (10) • Q6 (a): \"Determine the second degree polynomial by Newton's method; estimate f(0.1) and f(0.5) from the data:",
  "• Q7 (a): \"Define even and odd functions with examples. Verify the Fourier series representation for the given piecewise function f(x) ...\" (10)",
  "• Q7 (b): \"Solve the following PDE using separation of variables: [Equation as given].\" (10)",
  "• Q8 (a): \"The Trapezoidal rule applied to ∫₀² f(x) dx gives 4 and Simpson's rule gives 2. What is the value of f(1)?\" (10)",
  "• Q2: \"A particle P of mass m slides down a frictionless inclined plane AB (angle α with the horizontal). If it starts from rest at A, find (a)",
  "the acceleration, (b) the velocity, and (c) the distance travelled after time t.\" (20) • Q3 (a):",
  "\"Discuss the motion of a particle moving in a straight line if it starts from rest at a distance a from a fixed point O and moves with acceleration equal to k times its distance from O.\" (10) • Q3 (b): \"Find the radial and transversal components of velocity and acceleration.\" (10)",
  "• Q7 (a): \"Using the regular Falsi method, solve Log x -- Cos x = 0.\" (10) • Q7 (b): \"Find f(7.5) using Newton--Gregory Backward Difference Interpolation",
  "\"Define ordinary and singular points of the differential equation a₂(x)y″ + a₁(x)y′ + a₀(x)y = 0. When is a singular point said to be",
  "regular or irregular? Find the regular and irregular singular points of the differential equation (x² − 4)²y″ + (x − 2)y′ + y = 0.\"* (10 marks)",
  "\"Solve y″ − y′ + y = 2 cos 3x using the method of undetermined coefficients.\"* (10 marks) Q5 (b):",
  "\"Use the method of Frobenius to find two linearly independent series solutions in powers of x for the differential equation",
  "\"Solve the initial--value problem: x·y′ + y = e^x, y(1)=2. Give the largest interval over which the solution is defined.\"* (10 marks)",
  "\"Find the general solution of the higher--order differential equation: y‴² − 4 y″² − 5 y² = 0.\"* (10 marks)",
  "\"Find two power series solutions of the differential equation x²y″ − 2y′ + y = 0 about the ordinary point x = 0.\"* (10 marks)",
  "Q4 (b): \"Solve the following Bernoulli's equation: (x dy/dx + y)/y² = 1.\"* (10 marks) Q5 (a): \"Solve the differential equation:",
  "\"Solve the differential equation y″ − 4y′ + 4y = (x + 1)e^(2x) by the method of variation of parameters.\"* (10 marks)",
  "\"Find two power series solutions of the differential equation x²y″ − 2y′ + y = 0, about x = 0.\"* (10 marks)",
  "Problems here involve center of mass, projectile motion, orbital motion, SHM, angular momentum, and related force--motion analyses.*",
  "\"A light thin rod, 4 m long, can turn in a vertical plane about one of its points. If weights of 3 kg and 4 kg are suspended from",
  "its ends and it rests in a horizontal position, find the position of the pivot and its reaction on the rod.\"*",
  "\"Find the radial and transverse components of the velocity of a particle moving along the curve ax² + by² = 1 at any time t if the",
  "\"A particle is projected vertically upwards. After time t, another particle is sent up from the same point with the same velocity and",
  "meets the first at a height h during the downward flight of the first. Find the velocity of projection.\"*",
  "Q5 (a): v² = n²(ax² + bx + c), show that P executes a simple harmonic motion. Find also the centre,",
  "\"Define angular momentum and prove that the rate of change of angular momentum of a particle about a point O is equal to the",
  "\"Discuss the polar form of an orbit and prove that when a particle moves under a central force, the areal velocity is constant.\"*",
  "\"Define the terms moment of inertia and product of inertia, and find the moment of inertia of a uniform solid sphere of mass m and",
  "\"Discuss the following systems supported by figures/diagrams: (a) Equilibrium of a system of coplanar forces and centre of mass of",
  "a right circular solid cone of height h; (b) Centre of gravity of a rigid body of any shape.\"* SECTION -- B, Q5:",
  "\"(a) What is Simple Harmonic Motion? Discuss it in detail using derivatives with respect to time. (b) Describe the Simple Harmonic Motion of a pendulum and calculate",
  "\"(a) Derive expressions for: Moment of inertia and product of inertia. (b) Calculate the moment of inertia of a solid sphere of mass m = 37",
  "and radius a = 15.\" SECTION -- B, Q7: (b) What is Impulsive Motion? Derive its equation.\" SECTION -- B, Q8:",
  "(b) A cricket ball is thrown vertically upwards. It attains the maximum height h after t seconds. Calculate:",
  "\"Three forces P, Q and R act at a point parallel to the sides of a triangle ABC taken in the same order. Show that the magnitude of the",
  "\"A hemispherical shell rests on a rough inclined plane whose angle of friction is λ. Show that the inclination of the plane base to the",
  "\"A uniform square lamina of side 2a rests in a vertical plane with two of its sides in contact with two smooth pegs distant b apart.",
  "Show that if b < a/2, a non symmetric position of equilibrium is possible in which b(sinθ + cosθ) = a.\"*",
  "\"Find the centre of mass of a semi-circular lamina of radius a whose density varies as the square of the distance from the",
  "\"A particle is moving along the parabola x² = 4ay with constant speed v. Determine the tangential and normal components of its",
  "\"A battleship is steaming ahead with speed V and a gun is mounted on the battleship so as to point straight backwards and is set at an",
  "angle of elevation α. If v₀ is the speed of projection (relative to the gun), show that the range is ...\"*",
  "\"The position of a particle moving along an ellipse is given by r̂ = a cos t i + b sin t j. If a > b, find the position of the",
  "\"A particle is moving with uniform speed v along the curve y = a x + a (a constant). Show that its acceleration has the maximum value",
  "\"Find the tangential and normal components of the acceleration of a particle describing the ellipse (x²/a²) + (y²/b²) = 1 with uniform",
  "\"Find the velocity acquired by a block of wood of mass M lb., which is free to recoil when struck by a bullet of mass m lb. moving",
  "\"A particle of mass m moves under the influence of the force F = a (i sin ωt + j cos ωt). If the particle is initially at rest at the",
  "origin, prove that the work done up to time t is given by [expression] and that the instantaneous power is ...\"*",
  "\"Show that the law of force towards the pole of a particle describing the curve r cosⁿθ = a is given by [expression].\"*",
  "\"A bar 2 ft. long of mass 10 lb. lies on a smooth horizontal table. It is struck horizontally at a distance of 6 inches from one",
  "end. Show that the resulting velocities of the ends are ...\"* • Q3 (a): \"Find the centre of mass of a right circular solid cone of height h.\"",
  "(10) • Q3 (b): \"A light thin rod (4 m long) pivots in a vertical plane; with weights 3 kg and 4 kg at its ends, find the pivot's position and the reaction on the rod.\" (10) • Q4 (a): \"Find the radial and transverse components of velocity of a particle moving along the curve ax² + by² = 1 when θ = ct².\" (10) • Q4 (b): \"A particle is projected vertically; after time t another particle is sent upward from the same point with the same speed so that they meet at height h during the first's descent. Find the velocity of projection.\" (10) • Q5 (a): \"If a point P moves with velocity v given by v² = n²(ax² + bx + c), show that P executes SHM; find its centre, amplitude, and time period.\" (10) • Q6 (b): \"Discuss the motion of a particle moving in a straight line if it starts from rest at a distance a from O and moves with acceleration equal to μ times its distance from O.\" (10) • Q7 (b): \"The velocity components along and perpendicular to the radius vector are 2λr and 2μθ respectively. Find the polar equation of the path.\" (10) • Q8 (a): \"A particle is projected horizontally from the lowest point of a rough sphere of radius a. Show that the initial speed must be [2 2 (1 ) (sin )(1 2 ) ag μ/(...)]\" (10)",
  "• Q2 (a) & (b): \"(a) Draw a free body diagram for a 100 Kg wooden crate on a ramp; compute weight components and friction force. Determine the angle at",
  "which it begins to slip (μₛ = 0.28). (b) For a ladder (with given angles and friction coefficients) and a climber (mass M = 2m), determine the fraction of ladder length reached when slipping occurs.\" (10 each)",
  "• Q3 (a): \"A particle moving in a straight line starts with velocity u and has acceleration ∝ v³; find velocity and time as functions of distance.\"",
  "(10) • Q3 (b): \"A particle in SHM has velocities 5 ft/sec and 4 ft/sec when its distances from the centre are 12 ft and 13 ft respectively; find the time period.\" (10)",
  "• Q3 (b): \"Show that if a particle's velocity satisfies V² = n²(ax² + 2bx + c), then it executes SHM; find its centre, amplitude, and time period.\"",
  "(10) • Q2: \"A particle of mass m slides down a frictionless inclined plane (angle α). If it starts from rest at the top, find (a) its acceleration, (b)",
  "its velocity, and (c) the distance travelled after time t.\" (20) • Q3: \"(a) Discuss the motion of a particle moving in a straight line from rest at distance a from O with acceleration = k·(distance). (b) Find the radial and transversal components of its velocity and acceleration.\" (10 each)",
  "\"Define alternating symbol ε_ijk and Kronecker delta δ_ij. Also prove that ε_ijk ε_lmk = δ_il δ_jm − δ_im δ_jl.\"*",
  "\"Work out the Christoffel symbols for the following metric tensor: g = [matrix with components given].\"*",
  "\"Three first-order tensors A, B, and C are given. Prove that their product (with indices as given) is a tensor of order 3.\"*",
  "\"Discuss: What is the difference between a vector and a tensor? What happens if we permute the subscripts of a tensor?\"*",
  "\"Prove that if A_i (i=1,2,...,n) is a tensor of order n, then its partial derivative with respect to x_p, i.e., ∂A/∂x_p, is also a",
  "\"Prove tensor identities involving Christoffel symbols and the metric tensor: (i) m_mij m_ji = ..., (ii) [commutator identity], (iii)",
  "then their product AᵢBⱼ is a second order tensor.\" (10) • Q4 (b): \"If φ(x) is a scalar function, then show that ∂φ/∂xᵢ are the components of a first order tensor.\" (7) • Q4 (c): \"Find the invariant of the following second order tensor: [matrix given].\" (7)",
  "• Q5 (a): \"Verify that the transformation matrix T = [matrix with entries as given] is orthogonal and right handed.\" (10)",
  "*This topic comprises questions on root-finding methods, iterative techniques for linear systems, numerical integration (Simpson's,",
  "\"Solve the following system of equations using the Gauss--Seidel iteration method: 4x₁ -- x₂ + x₃ = 8,",
  "\"Find the positive solution of the equation 2 sin x = x by the Newton--Raphson method.\"* Q.6 (b):",
  "\"(i) Explain the difference between the secant and false position methods (graphically). (ii) Solve the equation f(x) = ... by the false position method.\"*",
  "\"(a) Show that if f(x) = x³, then the Lagrange interpolating polynomial f(a,b,c) = a + b + c. (b) Solve by the trapezoidal rule ∫₀^(2π) x sin x dx (with n =",
  "\"Evaluate the integral ∫₀^(10) (2x + 1) dx using (i) the Trapezoidal rule and (ii) Simpson's rule.\"*",
  "\"Use Lagrange's interpolation formula with the given table to find the value of y when x = 10.\"* Q.No.7 (a):",
  "\"Use the Trapezoidal and Simpson's rules to estimate the integral ∫₀^(10) (2x + 1) dx.\"* Q.No.8 (b):",
  "\"Determine the optimal solution graphically to the linear programming problem: Minimize z = x₁ + 2x₂",
  "\"Approximate the integral using the Trapezoidal rule: ∫₀^(π/4) 3 sin²x dx.\" (10) • Q8 (a): \"Approximate the real zero of the polynomial",
  "2016 to 2020: Similar numerical questions appear in each year: • 2016: Q7 and Q8 (see above).",
  "• 2017: Q7 (a) & (b) on bisection, false position, and interpolation. • 2018: Q7 and Q8 on Newton--Raphson, Lagrange interpolation, and Euler's method. • 2019: Q6 (b) asks about the necessity of a dominant diagonal and performs three Gauss--Seidel iterations; Q7 and Q8 cover interpolation and finite-difference approximations. • 2020: Q7 and Q8 again focus on solving non--linear equations (regular Falsi), using Newton--Gregory interpolation, Taylor series method, and the RK method for IVPs.",
  "\"Use the trapezoidal and Simpson's 1/3 rules to approximate ∫₀^(π/2) sin²(x) dx. Find a maximum bound for the error in each case and",
  "\"Use the Bisection method to determine an approximation to the root of f(x) = x + 4/x − 10 = 0, in the interval [1, 2], accurate to",
  "\"Using all applicable three--point and five--point formulas, approximate f″(2.0) for f(x) = x e^x from the data:",
  "\"Use the Modified Euler method to approximate the solution of the IVP: dy/dt = t + y, y(0) = 1, over the given interval.\"* (10 marks)",
  "\"Find the first and second derivatives of f(x) at x = 3 from the following data using Newton's forward difference interpolation",
  "\"Find the real root of the equation 2x − 3 sin x − 5 = 0 (up to 4 decimal places) by the secant method.\"* (10 marks)",
  "\"Solve the given system of equations by the Gauss--Seidel method; perform five iterations.\"* (10 marks)",
  "\"Using the Modified Euler's method, obtain the solution of the differential equation dy/dt = t + y, with y(0)=1, for 0 ≤ t ≤ 0.6 in steps of 0.2.\"* (10",
  "\"Find the real roots of the equation 4x + cos x + 2 = 0 using the Newton--Raphson method, correct to four decimal places.\"* (10 marks)",
  "\"Solve the given system of linear equations by the Gauss--Seidel iterative method (first three iterations):",
  "\"Prove that the minimum speed required to project a particle from a height h to fall a horizontal distance a is at least ...",
  "\"Find the radial and transverse components of velocity for a particle moving along the curve ax² + by² = 1, if the polar angle θ = ct².\"* (10 marks)",
  "\"Find the centroid of the surface formed by the revolution of the cardioid r = a(1 + cosθ) about the initial line.\"* (10 marks)",
  "\"Find the volume ∫∫_R xy dA where R is the region bounded by the line y = x -- 1 and the parabola y = x² + 6.\"*",
  "\"Evaluate the line integral ∫_C (2x + 2y) dx, where C is the line segment joining (--5, --3) to (0, 2) and then the arc of the",
  "\"Find the equation of the integral surface of the differential equation 2y(z − 3)p + (2x − z)q = y(2z − 3)",
  "(Appearing less frequently, these questions deal with matrix inversion and related topics.) 2010 -- SECTION B, Q.5:*",
  "\"Discuss the simplest and efficient method of finding the inverse of a square matrix aᵢⱼ of order 3×3.",
  "\"Determine the optimal solution graphically to the linear programming problem: Minimize z = x₁ + 2x₂",
  "2020: • Q6 (a):* \"Find the Fourier series of f (piecewise defined) on the given interval.\" (10)",
  "\"Classify the general second order partial differential equation into elliptic, parabolic, and hyperbolic forms. Discuss the nature of the",
  "\"Use the method of separation of variables to solve the initial/boundary value problem for the heat equation",
  "\"Find u(x, t) for a string of length L = 1 and c² = 1 when the initial velocity is zero and the initial deflection is given (with",
  "\"Find the centroid of the surface formed by the revolution of the cardioid r = a(1 + cosθ) about the initial line.\"* (10 marks)",
  "\"The greatest resultant that two forces can have is of magnitude P and the least is of magnitude Q. Show that, when they act at an angle",
  "\"A sphere of weight W and radius a is suspended by a string of length l from a point P and a weight w is also suspended from P by a string",
  "(sufficiently long for the weight to hang below the sphere). Show that the inclination of the first string to the vertical is [sin⁻¹(wa/((W + w)(a + l)))] (expression as given).\"* (10 marks)",
  "\"The maximum velocity that a particle executing simple harmonic motion (SHM) of amplitude a attains is v. If it is disturbed so that",
  "its maximum velocity becomes n·v, find the change in the amplitude and the time--period of motion.\"* (10 marks)",
  "\"Three forces P, Q, R acting at a point are in equilibrium, and the angle between P and Q is double the angle between P and R. Prove that",
  "\"Find the centre of mass of a semi--circular lamina of radius a whose density varies as the square of the distance from the centre.\"* (10",
  "\"Forces of magnitudes P, 2P, 3P, 4P act respectively along the sides AB, BC, CD, DA of a square ABCD of side a, and forces each of",
  "magnitude (8√2)P act along the diagonals BD, AC. Find the magnitude of the resultant force and the distance of its line of action from A.\"* (10 marks)",
  "\"A uniform rod AB of length a and weight W is freely hinged to a vertical wall at A and is maintained in equilibrium by a light string",
  "of length a fastened to B and to a point C at a distance b vertically above A. Prove that the reaction at the hinge A is ... and find the tension in the string.\"* (10 marks)",
  "\"Find the law of force for a particle moving in an orbit: r = l/(1 − e cosθ), where l is the semi--latus rectum and e is the eccentricity.\"* (10",
  "\"Prove that the minimum speed required to project a particle from a height h so that it falls a horizontal distance a is at least",
  "\"Find the radial and transverse components of velocity for a particle moving along the curve ax² + by² = 1 if the polar angle θ = c·t².\"*",
  "\"Find the centroid of the surface formed by the revolution of the cardioid r = a(1 + cosθ) about the initial line.\"* (10 marks)",
  "- Vector Calculus & Differential Operators and Differential Equations appear in 100% of the papers from 2009 to 2014.",
  "- Mechanics & Kinematics problems (center of mass, SHM, orbital motion) are featured in nearly every paper (≈90%).",
  "- Numerical techniques (root finding, iterative methods, quadrature, interpolation) are present in all papers starting from",
  "2009, with increasing depth and variety by 2014. Over 100% of the years include at least one numerical methods question. -- There is a notable shift toward applying iterative methods (Newton--Raphson, Gauss--Seidel/Jacobi) and interpolation methods---likely reflecting the growing importance of computational techniques in applied mathematics.",
  "- Questions on tensor calculus and transformation matrices first appear in 2009 and become more sophisticated by 2012--2014.",
  "Approximately 70--80% of the papers include tensor or coordinate transformation questions, reflecting an increased emphasis on abstract formulation in advanced applications.",
  "- Many papers blend topics. For example, vector calculus questions often require integration (line, surface, and volume integrals), and",
  "mechanics problems frequently involve differential equations. This integration suggests that examinees are expected to have a holistic understanding of mathematical methods applied to physical problems.",
  "- Early papers (2009--2010) often focus on proving standard identities and solving classical equations. Later papers",
  "(2012--2014) include multi-part problems that require not only analytical skills but also numerical approximations and graphical interpretations (e.g., linear programming in 2014).",
  "- Out of the eight topics listed, at least six (Vector Calculus, Differential Equations, Mechanics, Numerical Methods, Tensor",
  "- Linear Algebra/Matrix Methods and Optimization appear less frequently (roughly in 20--30% of the years), suggesting these are",
  "- Almost every year (2015--2020) includes questions on vector calculus, differential equations (both ODEs and PDEs), and",
  "mechanics. In nearly 100% of the papers, these \"core\" topics are featured.  Increased Integration of Numerical Methods:",
  "- Numerical methods (root-finding, iterative methods, interpolation, and quadrature) are present in every year. Over time",
  "the questions become more sophisticated---requiring not only algorithmic application (Newton--Raphson, Gauss--Seidel) but also justification (e.g., conditions for convergence).",
  "- Many questions integrate analytical derivations (e.g., proving vector identities, solving differential equations by series methods)",
  "with computational techniques (e.g., using RK methods, finite differences). This reflects a trend toward preparing candidates for real--world problem solving where both exact and approximate methods are needed.",
  "- Tensor analysis and coordinate transformations appear in several papers (notably in 2015), and although less frequent than the core",
  "topics, their presence indicates a steady demand for abstract mathematical reasoning.  Fourier and Boundary Value Problems:",
  "- Over the years, Fourier series and PDE boundary value problems (especially in the context of the heat equation) have been",
  "consistently tested, with an apparent slight increase in the complexity of the functions involved.  Mechanics & Kinematics Integration:",
  "- Problems from mechanics (including free--body diagrams, SHM, and orbital motion) are often interwoven with differential equations.",
  "- In a review of 6 years of papers: • Topics 1, 2, and 5 (Vector Calculus, Differential Equations, and Numerical Methods) appear in",
  "100% of the papers. • Mechanics (Topic 3) is featured in about 90--100% of the papers. • Tensor Analysis (Topic 4) appears in roughly 60--70% of the papers. • Fourier Series & BVP (Topic 6) occur in about 70--80% of the papers.",
  "- Vector Calculus, Differential Equations, and Numerical Methods continue to form the backbone of the exam. Nearly every",
  "year includes at least one question testing surface/line integrals, divergence/gradient identities, and the use of classical theorems (Green's, Stokes', Divergence).",
  "- Problems increasingly combine theory and computation. For instance, questions may ask for an analytical proof (e.g., the",
  "gradient identity or equilibrium conditions) alongside numerical approximations (e.g., using the Runge--Kutta or Gauss--Seidel methods).",
  "- Both the method of Frobenius (for ODEs) and Fourier series (for PDEs and boundary value problems) appear with steady frequency. In",
  "2024, there is a dedicated question to expanding a function into a Fourier series and also finding the canonical form of a PDE.",
  "- The numerical section has evolved to include a variety of methods: from basic iteration (bisection, secant, fixed--point) to",
  "higher--order solvers (Runge--Kutta, Modified Euler) and finite difference formulas. The questions now often require error estimation and comparison with exact values.",
  "- Equilibrium problems (resultant forces on polygons, rod--string systems, free--body diagrams) remain central. Their integration with",
  "vector calculus (via work done or surface integrals) is notable.  Emergence of Advanced Topics:",
  "- In 2024, topics such as integral surfaces and Legendre polynomial identities appear, indicating a slight shift toward more advanced",
  "- Across these four years, nearly 100% of the papers include questions on vector calculus, ODEs/PDEs, and numerical methods. --",
  "- Advanced topics (integral surfaces, tensor/Legendre identities) appear in about 30--40% of the papers---suggesting they are"
]