[
  "1. Literary Criticism & Analysis of Classical Poetry and Prose 2016 -- PART II, Question 2 (20 marks):*",
  "> Insight: Discuss the origin and objectives of the mu'assahah (a > type of lyrical composition).",
  "> Insight: Analyze how the novel Al-Ayyām by Lataḥ Ḥusayn presents > religious values in Egypt. 2016 -- PART II, Question 8 (20 marks):",
  "> الماء الغرابیل...\") > Insight:* Interpret the given verse by explaining its imagery, > identifying the poet, and discussing its thematic purpose.",
  "> السبب في ذلك؟\" > Insight: Write a detailed essay on the life and works of the poet > known as \"Ḥassān al-Hind,\" explaining the reasons behind his > epithet.",
  "> Insight: Discuss the purposes of pre-Islamic (jahili) poetry and its > advantages, with a special focus on the Mu'allaqāt.",
  "> فيها بسبب الإسلام\" > Insight: Explain the evolution of poetry in the early Islamic period > and highlight the changes influenced by Islam.",
  "> المعلقات.\" > Insight: Discuss the purposes and advantages of pre-Islamic poetry > with an emphasis on the Mu'allaqāt.",
  "> Insight: Write an essay about Islamic poetry during the Prophet's > era and the era of the Rightly Guided Caliphs.",
  "> بالتفصيل.\" > Insight: Discuss the features of poetry in the early Islamic period > with a detailed focus on the poetry of Ḥassān ibn Thābit.",
  "> Insight: Explain the categories of verbal and nominal sentences in > Arabic with examples. 2022 -- PART II, Question 6 (20 marks):",
  "> الحكيم.\" > Insight: Discuss the evolution of drama in modern times with a focus > on Tawfiq al-Hakim's works.",
  "> Insight: Write a detailed essay on the life and poetic contributions > of Al-Farazdaq. 2023 -- PART II, Question 4 (20 marks):",
  "> محفوظ.\" > Insight: Discuss the development of the modern Arabic novel, > emphasizing the works of Naguib Mahfouz.",
  "> Insight: Provide a concise article on Al-Shāh Walī Allah's > contributions to modern literature.",
  "> Insight: Analyze the influence of the Quran and Hadith on Arabic > literature and language. 2024 -- PART II, Question 5 (20 marks):",
  "> Insight: Write a detailed essay on the influence and status of the > Arabic language in the Indian subcontinent.",
  "Develop critical essays on major historical periods (e.g., Jahili, Abbasid, Andalusian) and the contributions of key figures (al-Mutanabbi, al-Farazdaq, etc.). Read sample critiques and model essays.",
  "and verbal sentences, and verb conjugations. Practice with examples and written exercises. Historical & Cultural Context:",
  "Familiarize yourself with the cultural and historical background of major eras (e.g., the Abbasid golden age) to support your essay responses.",
  "MCQs: Memorize key facts about Persian and Arabic literary heritage, famous works, and literary figures to answer multiple‐choice questions"
]