[
  "These questions focus on the role of language in national culture and responsibility. They ask candidates to comment on the importance of",
  "protecting and promoting the language, its cultural significance, and the duties of society in this regard.",
  "2. Digital Information, Accessibility & Human Rights* These items deal with the impact of digital information on society, its",
  "accessibility, and the rights of human beings in the modern age. Candidates are asked to discuss the influence of digital media on human rights and the emerging realities in the information era.",
  "3. Global Climate Change and Environmental Impact* These questions address global issues---specifically the impact of",
  "climate change and environmental transformation. They require candidates to comment on worldwide warming, changes in soil and climate, and the effects on nations.",
  "4. Technical & Aesthetic Aspects of Balochi Language & Literature* These items focus on discussing both technical (linguistic/structural)",
  "and aesthetic aspects of the Balochi language and its literature. This includes analysis of language style, poetic techniques, and the technical presentation of literary works.",
  "> سر انبشه به کن۔\" > (20 marks; same options provided) These questions ask candidates to analyze the trends, themes, and",
  "significance of Balochi novel writing. They require discussion on how novels reflect history, society, and the emotional makeup of the Baloch people.",
  "> دئیت۔\" > (20 marks) These items address questions on the linguistic grouping of the Balochi language and its role in the identity of the Baloch people. Candidates",
  "are asked to discuss the place of Balochi within the spectrum of languages, its classification, and cultural responsibilities.",
  "> ایت۔\" > (20 marks) These questions focus on translation between Balochi and English---often involving technical or academic texts. They test candidates' command of",
  "both languages and their ability to render literary and technical nuances. 2019 -- PART-II, Question 8 (a):",
  "> \"[A long English text about a Balochi novel and its historical > reflection is provided for translation into Balochi.]\"",
  "> (10 marks) 2020 -- PART-II, Question 8 (b): > \"[An English text is provided to be translated into",
  "> (10 each -- translation task; exact subparts include an English > paragraph to be translated into Balochi and vice versa.)",
  "8. Essays on Literary Criticism, History & Cultural Narratives* These essay-type questions call for detailed critical analysis on",
  "literary works, historical narratives, and cultural reflections in Balochi literature. Topics include the analysis of novels, poetry, and the role of literature in preserving cultural identity.",
  "(The translation of an English text discussing a Balochi novel is paired with reflective analysis.)* 2021 -- PART-II, Questions 2--7:",
  "> (20 marks, with part (الف) involving an English text translation) 2022 -- PART-II, Questions 4--8:",
  "Translation Skills: Practice translating both technical and literary texts between English and Balochi. Emphasize idiomatic expressions and cultural nuance.",
  "Critical Essay Writing: Develop structured outlines for essays on literary criticism and cultural narratives. Compare classical texts with modern trends and",
  "support your arguments with examples. Debate & Identity: Read widely on Balochi language history and cultural identity debates.",
  "Be prepared to articulate your position regarding the origins and social role of Balochi language and literature.",
  "Proverbs: Build a glossary of common Balochi proverbs and practice their translation to and from English."
]