[
  "1. Reproduction, Life Cycles, and Developmental Processes Key Themes & Trends: Algal and Lower Plant Reproduction:",
  "2005: Questions ask you to describe the life cycle of Chara and compare it with Chlorophyceae, discuss vegetative reproduction in",
  "2005: There is also a focus on reproduction in lichens---types and methods---and on the life cycle of bryophytes (e.g., Riccia,",
  "2005: Questions cover male and female cones in Pinus, drawing diagrams of leaf transverse sections, and describing pollination",
  "2006--2007: Later papers include discussion of secondary growth (e.g., in dicot stems), the evolution of gametophyte and sporophyte",
  "- Focus: Review of fungal physiology and reproduction, with emphasis on Rhizopus. <!-- --> Insights:*",
  "2005: Topics include different types of classification systems, binomial nomenclature, and rules of nomenclature with examples.",
  "2005 & 2006: Questions on the history and principles of nomenclature are common. Comparative Taxonomy:",
  "2005: Several questions require you to differentiate between paired terms such as heartwood vs. sapwood, protoxylem vs.",
  "2007: Questions include comparing classification systems (e.g., Bentham & Hooker vs. modern systems) and assigning plants to",
  "\"Who proposed binomial nomenclature? Give details. Why is Latin used in nomenclature?\"*  2013 -- MCQs:",
  "\"Describe artificial and natural systems of classification of plants by giving merits and demerits of each system.\"*",
  "- Topics such as Species Concept, Chemo Taxonomy, Significance of Numerical Taxonomy, Taxonomic key, Chromosomal aberrations.",
  "- Focus: Brief, clear definitions that support modern taxonomic methods. 2020, Q.8 (short notes option):",
  "\"Write down comprehensive notes on any TWO of the following: (a) The four components of taxonomy, (b) Distribution of gymnosperms in",
  "\"Discuss the principles and methodologies used in biosystematics for the classification and identification of plant species.\"* (20)",
  "- Focus: Cover morphological, molecular, and numerical taxonomy methods.  2024, Part-II, Q.8 (choice option):",
  "\"Briefly describe any two of the following: Role of Cytokinin in plant senescence; Parthenogenesis vs Apomixis; Hardy-Weinberg's",
  "- Focus: (If you choose Hardy-Weinberg's Theorem) Summarize its assumptions, applications, and limitations in population genetics.",
  "2005: Questions cover the structure and functions of stomata, cell wall components, and the ultrastructure of various plant tissues.",
  "2006: There are tasks to draw diagrams of transverse sections (e.g., dicot stem, cycas leaflet, Funaria capsule) and describe the",
  "2005--2007: You're asked to compare anatomical structures (e.g., differences in stele types, variations in leaf anatomy between",
  "\"Equisetum is the only living genus that belongs to: (a) Sphenopsida...\"* 2010 -- Part II, Q.7:",
  "\"Write short notes on ANY TWO of the following: (i) Rules of botanical nomenclature, (ii) Chemo--taxonomy and Numerical",
  "\"Define tissue. What are meristematic tissues and also classify them on different basis?\"* > 2016, Q.6:",
  "> \"Describe the diagnostic Characters of family Poaceae and discuss > its economic importance.\" (20) > -- Focus: Key morphological traits of grasses and their economic > roles.",
  "- Options include Species Concept, Chemo Taxonomy, Significance of Numerical Taxonomy, and Taxonomic key, Chromosomal aberrations.",
  "- Focus: Compare the location, cell type, and function of vascular cambium (producing secondary xylem and phloem) versus cork",
  "- Focus: Outline mechanisms of programmed cell death, its physiological roles, and how senescence contributes to tissue",
  "\"What is CAMBIUM? Where does it occur? Describe its histological structure and its function.\"* (20)",
  "- Focus: Study the vascular cambium (note the spelling \"CAMBIUM\" likely refers to cambium) including its structure and role in",
  "Comparing structural differences across plant groups. Key Themes & Trends: Photosynthesis, Respiration, and Energy Flow:*",
  "2006: Questions on photophosphorylation (cyclic and non-cyclic), the Z-scheme of photosynthesis, and CO₂ fixation in C₃ versus C₄",
  "2008--2009: Topics include the role of enzymes, the TCA cycle, glycolysis, and enzyme mechanisms. Plant Hormones and Growth Regulators:",
  "2006: You encounter questions on plant growth hormones (auxins, cytokinins) and their roles. Genetics and Molecular Processes:",
  "2005--2009: Several papers include questions on mutation, meiosis, crossing over, polyploidy, and the molecular basis of heredity",
  "Questions on NADH yield, mitochondrial electron transport, and pathways of CO₂ fixation (e.g., C3 vs. C4 in maize).*",
  "\"What is Oxidative phosphorylation? How does it take place on the mitochondrial membrane and how is it associated with the synthesis of",
  "\"Explain CAM Photosynthesis contrasting it to C4 Photosynthesis in terms of partitioning of a pathway.\"* (20)",
  "- Focus: Differences between CAM and C4 in carbon partitioning and water-use efficiency.  2019, Q.4:",
  "\"Write down the discovery, chemical structure, and role of gibberellins in regulating various physiological processes in",
  "\"Describe the structure, transport, biosynthesis and mode of action of Auxins.\"* 2010 -- Botany Paper-II, Q.7:",
  "\"Write short notes on ANY TWO of the following: (i) Photoperiodism, (ii) Ultra-structure of chloroplast, (iii)",
  "- Focus: Compare how cytokinins promote cell division and delay senescence, whereas abscisic acid regulates stress responses and",
  "\"What is the specificity of enzyme action? Explain it with reference to the important enzyme 'Ribulose-1, 5-Bisphosphate",
  "- Focus: Discuss the concept of enzyme specificity and substrate binding; illustrate how RuBisCO's dual activity",
  "- Focus: Present a sequential overview of hormone actions (e.g., gibberellins in germination, auxins in fruit set, cytokinins, and",
  "\"Briefly describe any two of the following: Role of Cytokinin in plant senescence; Parthenogenesis vs Apomixis; Hardy-Weinberg's",
  "- Focus: (If you choose Cytokinin) Summarize how cytokinins delay senescence and maintain chloroplast integrity.",
  "Insight:* Review the roles of auxins and other growth regulators in plant development, as well as their cellular mechanisms and transport.",
  "\"Describe nitrogen cycles between the abiotic environment and organisms. Briefly describe how human activities have changed global",
  "5. Ecology, Environmental Botany, and Plant Interactions Key Themes & Trends: Plant Ecology and Succession:",
  "2006--2007: Questions on plant succession (e.g., starting in a lake) and ecological factors affecting plant growth.",
  "2005 & 2008: Topics include methods for reclamation of waterlogged soils, causes and control of soil erosion, and environmental",
  "2005: There are discussions on the economic importance of fungi, algae, and the uses of various plant groups in industry.",
  "\"What is Ecosystem? How is its composition affected by different environmental factors?\"*  2013 -- Q.4:",
  "\"What is an Ecosystem? What are the components of an aquatic ecosystem and how is it important to life on earth?\"*",
  "- Focus: Adaptations in dry environments; anatomical changes that promote water conservation.  2020, Q.2:",
  "\"Discuss the life cycle of late blight of potato. Discuss its epidemics, disease forecast and control.\"* (20)",
  "\"What are the adverse effects and control measures of aquatic and terrestrial pollution? Explain.\"* (20)",
  "\"Describe significance of various types of abiotic environmental factors for soil formation. Give soil characteristics formed by each",
  "\"Describe various types of environmental pollutions. Give significance of biodiversity and conservation to save the living",
  "Appreciating the economic roles of various plant groups in different industries. Key Themes & Trends:*",
  "2005 & 2006: Questions on the laws of segregation and independent assortment, the nature of mutations, and genetic variation.",
  "2007: Questions ask for discussions on theories of evolution and adaptive mutation. Molecular Biology Techniques:",
  "2008--2009: Multiple-choice and short-answer questions cover DNA replication, transcription, translation, and the role of ATP in",
  "\"How did the discovery that the DNA molecule is helical with uniform 2‑mm diameter lead Watson and Crick to propose the pairing rules for",
  "- Focus: Link between DNA structure and base pairing; historical context of molecular genetics. 2018, Q.6:",
  "\"What are the evidences in support of Evolution? What contributions modern genetics has made for its support?\"* (20)",
  "- Focus: Though centered on photosynthesis, understanding these processes is essential for interpreting energy metabolism and genetic",
  "\"How Morgan and his students demonstrated that gene was linked in fruit flies? How is linkage related to some events in meiosis?\"*",
  "\"Differentiate between plasmid and vector. Briefly explain bacteriophage lambda (λ) vector. Describe its working and selection",
  "- Focus: Fundamental tools in genetic engineering and molecular biology. <!-- --> 2010 -- Botany Paper-II, Q.6:",
  "\"Write notes on the following: (i) Genetic code, (ii) Gene transformation.\"* 2010 -- Botany Paper-II, Q.7:",
  "\"What are major factors which affect the evolution of a trait? Describe Ecological Energetics.\"* 2010 -- Botany Paper-II, Q.8:",
  "\"Write short notes on ANY TWO of the following: (i) Photoperiodism, (ii) Ultra-structure of chloroplast, (iii)",
  "Several questions (e.g., reduction phase in meiosis, dihybrid cross ratios, pleiotropy) test basic genetic concepts.*",
  "Questions on differentiating between mitosis and meiosis, defining mutations and mutagens, and discussing the fine structure of the",
  "gene. Insight: Ensure clarity on cell division (mitosis vs. meiosis), genetic inheritance, mutation types, and modern concepts such as gene regulation",
  "Molecular techniques and their relevance to understanding plant development and breeding. 2010 -- Part I, Q.1 (i):",
  "\"The Green Algae belongs to: (a) Cyanochloranta (b) Chlorophycophyta (c) Charophyta (d) Cryptophycophyta (e) None of",
  "\"Chlorophyll 'd' exists in: (a) Pyrrophyta (b) Phaeophyta (c) Cryptophyta (d) Rhodophyta (e) None of these\"*",
  "\"Which type of chlorophyll is rare in Xanthophyceae and has been determined in only two of its genera:\"*",
  "\"An antibiotic called 'Chlorellin' is derived from: (a) Chara (b) Spirogyra (c) Volvox (d) Chlorella (e) None of these\"*",
  "\"In Pakistan, Volvox is found abundantly in water ponds during the months of: ...\"* 2010 -- Part I, Q.1 (viii):",
  "\"Because of extracting ______ from water and depositing it in their walls, different species of Chara are referred to as 'Stone",
  "\"Classify different groups of algae based on their habitat and pigmentation.\"* 2010 -- Part II, Q.2(b):",
  "\"Cynophyta (Blue green algae) is a main group of algae. What is the economic importance of this particular group in food and hunger?",
  "- Focus: Discuss the role of cyanobacteria in food production (e.g., as protein supplements), their use as biofertilizers, and their",
  "\"Explain different types of algae based on cell structure, nature of the pigments and the types of reserve food materials.\"* (20)",
  "- Focus: Classify algae (e.g., Chlorophyta, Rhodophyta, Phaeophyta) according to their cellular features, pigment profiles,",
  "\"Write comprehensive notes on the following: (a) Morphology of thallus in Algae; (b) Alternation of generation in Bryophytes.\"*",
  "- Focus: While part (b) deals with Bryophytes, part (a) requires you to detail algal thallus structure, highlighting diversity in form.",
  "Insight:* Focus on pigment types, structural features, and economic applications of algae. Note the diversity in classification based on habitat and",
  "\"If the gametes and gametangia in Fungi are of unequal size, they are termed as: (a) Heterothallic (b) Homothallic (c) Isogametes (d)",
  "\"Fungi have great impact on our national economy. Explain their constructive and destructive roles with a special emphasis on the",
  "\"Write short notes on ANY TWO of the following: (i) Rules of botanical nomenclature, (ii) Chemo--taxonomy and Numerical",
  "taxonomy, (iii) Concept of Speciation\" Insight: Review both the beneficial uses of fungi (e.g., in food, medicine) and",
  "\"A stable self-supporting association of a _______ is termed as lichen: (a) bryophyte & a pteridophyte (b) mycobiont & a",
  "phycobiont (c) plant & animal (d) gymnosperm & angiosperm (e) None of these\"* 2010 -- Part II, Q.4:",
  "\"What are lichens? Explain how lichens are not only beneficial for humans but also for the entire universe?\"*",
  "Insight:* Understand the symbiotic nature of lichens, the reproductive strategies they employ, and their ecological roles (e.g., soil formation,",
  "- Focus: Discuss the evolutionary transition from dominant gametophyte to the dependent sporophyte, emphasizing life cycle",
  "\"Write a note on any TWO of the following: (a) Hardy--Weinberg's Law; (b) Evidences of Evolution; (c) Theory of Natural Selection.\"*",
  "- Focus: Choose two topics to briefly summarize key principles and supporting examples from modern genetics or fossil records.",
  "\"What are the adverse effects and control measures of aquatic and terrestrial pollution? Explain.\"* (20)",
  "- Focus: Although this question centers on pollution, consider linking its impact on genetic diversity and evolution.",
  "\"What are different rules of botanical nomenclature? Compare natural and artificial system of classification.\"* (20)",
  "Insight:* Focus on the life cycle and dominant gametophyte phase, along with vegetative reproduction (e.g., gemma cups).",
  "\"The members of class Filicinae in pteridophyta date back to _______ era.\"* 2010 -- Part II, Q.6(a):",
  "Examine the evolution and anatomy of ferns and horsetails, noting their vascular structures and reproductive organs.",
  "\"In Ephedra, the oosphore undergoes repeated divisions to produce eight-celled: ______.\"* 2010 -- Part I, Q.1 (xx):",
  "\"Double fertilization is a characteristic of: (a) Gymnosperms (b) Bryophytes (c) Angiosperms (d) Pteridophytes (e) None of these\"*",
  "- Focus: Detail both biotic and abiotic pollination strategies. Insight:* Review seed production, reproductive strategies, and the structural",
  "\"Explain the mechanism of pollination, fertilization and development of seed as well as seed dispersal in Angiosperms.\"*",
  "\"Give a detailed note on the life cycle of Angiosperm up to the development of seed.\" Insight: Emphasize the processes of pollination (both biotic and abiotic), double",
  "\"Give a diagrammatic account of location of the different photosystems in granum and briefly describe their functions in",
  "- Focus: Draw a clear diagram of a granum showing PSII and PSI, and explain energy transfer. 2024, Part-II, Q.6:",
  "\"Provide a labeled diagram of the Krebs cycle in plants, highlighting key intermediates and enzymes involved. Explain the",
  "\"Analyze the role of plants in phytoremediation. Discuss how certain plant species can help mitigate soil pollution by absorbing and",
  "Across many papers (2005--2009), you're required to draw clear, labeled diagrams of plant structures (e.g., transverse sections of stems and leaves, life cycle diagrams, ultrastructure of organelles).",
  "food webs, sampling methods in vegetation, and aspects of enzyme action. Insights:* Develop your ability to:"
]