[
  "> \"What are the Lowry‐Brønsted definitions of an acid and a base? > > Why is this concept of acid‐base less restrictive than the Arrhenius",
  "> definition?\" Q1(b): > \"Which is the stronger acid in the following pairs? Give reasons. > > H₂SO₄ or HClO₄",
  "> pKa = 0.3. Which is the stronger acid?\" Q1(d): > \"Boron trichloride (BCl₃) reacts with diethyl ether ((C₂H₅)₂O) to form",
  "> an addition compound Cl₂BO(C₂H₅)₂. > > Identify the Lewis acid and Lewis base.\" Q1(e): > \"What do you understand by the following?",
  "> > Soft base > Hard base > Soft acid > Hard acid\" Q1(f): > \"What is symbiosis?\" 2002 -- Buffer & Catalysis (Second Part):*",
  "Q2(c): > \"What is a buffer action? How is a buffer solution of any desired pH > prepared?\" (Second Part) Q1(a):",
  "> \"What is meant by Acid-Base catalysis? > > Explain, giving examples and discussing the theories of Acid-Base",
  "> catalysis.\" 2003 -- Acid--Base and pH Measurement (Q2): Q2(a):* > \"Lewis Theory of Acids and Bases is a more generalized concept than",
  "> the earlier concepts. > > Give your views on this statement.\" Q2(b): > \"What is pH? > > How is it commonly measured?\"",
  "One of the MCQs asks: > \"The pH of a 0.1M solution approaches one for: > (A) HCl > (B) CH₃COOH > (C) H₂SO₄",
  "2016 -- Q. No. 4:* > \"Define and explain Langmuir adsorption isotherm. What are its > limitations?\" (8 marks)",
  "> \"What is acid-base catalysis? Discuss its significance in chemistry.\" > (6 marks) > \"What is Phase rule? Discuss its application in one component system.\"",
  "- Review phase equilibria and how the phase rule predicts degrees of freedom. • Q4(b): \"Explain various acid--base theories. What are hard and",
  "soft acids and bases?\" • Q8(a): \"Starch, glycogen and cellulose are polymers of glucose. How will you differentiate among these three both structurally and functionally?\" • Q8(b): \"Explain precisely the following terms: (i) Glycolysis, (ii) Glycogenolysis, (iii) Glycogenesis, (iv) Gluconeogenesis.\"",
  "• Q8: \"Answer the following questions: (i) Comment if glycogenesis is anabolic or catabolic. Write down all",
  "steps involved in glycogenesis. (ii) Describe endergonic and exergonic reactions. (iii) Write a note on anionic and cationic surfactants. (iv) Comment if waste glass can be used for cement production. (v) What is the chemical composition of nucleic acids and their biological significance?\"",
  "Q2(a): > \"What do you mean by thermodynamics? > > Discuss its scope and limitations.\" Q2(b):",
  "> \"What is meant by the following terms? > > Reversible and irreversible processes > Isothermal and adiabatic processes\"",
  "Q2(c): > \"State the second law of thermodynamics and explain the condition > under which heat can be converted into work.\"",
  "Q2(d): > \"What is the Clausius-Clapeyron equation? > > Discuss its applications.\" Q2(e): > \"Define and explain the terms:",
  "> > Work function > Free energy > as used in thermodynamics.\" 2002 -- Thermodynamic Calculations:*",
  "Q1(b): > \"Calculate the work done when 6 moles of hydrogen expand isothermally > and reversibly at 30°C from 1.0 atm to 0.1 atm pressure.",
  "> > Use formula: W = -2.303 nRT log (V₂/V₁)\" Q2(a): > \"Calculate the efficiency of a steam engine working between a hot",
  "> \"What do you understand by the term thermodynamics? > > Discuss its scope and limitations.\" Q5(c):",
  "> \"Explain the following terms: > > (i) Reversible and irreversible processes > (ii) Isothermal and adiabatic processes\"",
  "Q5(d): > \"What is the second law of thermodynamics? > > Discuss the conditions under which heat can be converted to work.\"",
  "Q5(e): > \"State and explain the thermodynamic terms: > > 'Work function' and 'Free energy'.\"",
  "Q5(f): > \"State Clausius and Clapeyron equation. > > Comment on its applications.\" 2007, Paper I, Q.6(b):",
  "\"How free energy and chemical equilibrium are related to each other?\" (10 marks) 2010, Part-II, Q.4:",
  "(a) \"Define the following types of processes: (i) Isothermal (ii) Adiabatic (iii) Isochoric (iv) Isobaric\" (8 marks)",
  "(b) \"How the pressure, temperature and volume of a gas are related to each other in adiabatic process\" (8 marks)",
  "(c) \"1 mole of an ideal gas at 25°C is allowed to expand reversibly at constant temperature from 15 dm³ to 30 dm³; calculate",
  "Several questions address thermodynamic concepts such as equilibrium expressions, Gibbs free energy, and the relationship between",
  "(b) \"Define 2nd law of thermodynamics. How can the entropy change become an indicator for spontaneity of a process?\" (07 marks)",
  "2012, Q.8 (Part-I): MCQs also test on thermodynamic relationships (e.g., \"At equilibrium the change in free energy (∆G) ...\")",
  "- Applications such as acid rain chemistry, gas laws, and combustion energy. Key Themes to Focus On:*",
  "- Relationships between thermodynamic parameters and equilibrium 2016 -- Q. No. 3:* > \"What is Gibbs free energy? Discuss its significance in chemistry.\" (6",
  "> marks) > \"Give a brief account of transition state theory indicating its > advantages over collision theory.\" (8 marks)",
  "> \"Explain 3rd law of thermodynamics. How this law is useful to > determine the absolute value of entropy?\" (6 marks)",
  "2017 -- Q. No. 3:* > \"Define heat capacities and molar heat capacities. Prove that Cp - Cv > = R for ideal gases.\" (10 marks)",
  "> \"What is Gibbs energy? Derive a relation between standard Gibbs energy > change and equilibrium constant.\" (6 marks)",
  "> \"Differentiate spontaneous and non spontaneous process.\" (4 marks) 2018 -- Q. No. 3:* > \"Explain the working of quinhydrone electrode.\" (5 marks)",
  "> \"Calculate the standard heat of formation of propane (C₃H₈) if its > heat of combustion is --2220.2 kJ mol--1. The heats of formation of",
  "> CO₂(g) and H₂O(l) are --393.5 and --285.8 kJ mol--1 respectively.\" (5 > marks) > \"Describe the criteria of spontaneity of a chemical process. Explain",
  "> in terms of change in entropy, enthalpy and free energy with > derivation of necessary equations.\" (10 marks)",
  "- Practice numerical problems (e.g., combustion calculations) and derivations. 2005 -- Free Energy and Equilibrium (Q3):*",
  "Q3(b): > \"For the general reaction, the standard free energy at 300°C is 11004 > J. > > Calculate the value for the equilibrium constant. (R = 8.31 J K⁻¹",
  "> mol⁻¹)\" 2005 -- Additionally, Q3(a): > \"Give various methods for the determination of entropy and free energy",
  "> of a system. > > Discuss their importance in thermodynamics.\" • 2020 • Q4(a): \"Explain the Arrhenius equation. Also highlight its applications and limitations.\"",
  "• 2021 • Q2(b)(ii): \"Explain factors affecting the rate of a chemical reactions.\" • Q5(b)(ii): \"Write a note on thermochemistry and calorimetry.\" • Q6(a): \"Derive a relation for dependence of Gibbs free energy on temperature or Gibbs Helmholtz equation.\" • Q6(b): \"What is isothermal process? Explain work done in isothermal reversible expansion of an ideal gas.\" • Q6(c): \"Explain fugacity and activity.\" • Q7(c): \"Write a note on basic concepts of chemical equilibrium.\"",
  "• 2023 • Q2(a): \"Write down the rate equation for the above reaction [two‐step mechanism].\" • Q2(b): \"Describe Arrhenius's equation.\" • Q3(a): \"Explain the phenomenon of an explosion being considered adiabatic despite rapid expansion.\" • Q3(b): \"Draw a working diagram for a reversible heat engine that operates with two isothermal steps and two constant‐pressure steps. How many heat reservoirs are needed?\"",
  "• 2024 • Q2(b): \"How do you compare Gibb's and Helmholtz free energies?\" • Q3(b): \"Justify that the half-life period of a third-order reaction is inversely proportional to the square of the initial concentration of reactants.\" • Q4(a): \"Discuss in detail Hess's Law with suitable examples.\" • Q4(c): \"Explain the phase diagram by applying Gibb's phase rule for a two-component system with the help of a suitable example.\" • Q5(a): \"Derive the equation for the rate constant of a third-order reaction with the same initial concentrations. Also, give its half-life and examples.\" • Q6(a): \"Explain the kinetics of enzyme catalysis.\" • Q7(b): \"Derive the relationship between equilibrium constant and Gibb's free energy.\"",
  "3. Coordination Chemistry, Crystal Field Theory (CFT) & Molecular Orbital (MO) Theory 2001 -- CFT and MO Theory (Q4 & later Q1):",
  "Q4(a): > \"What are the essentials of Crystal Field Theory (CFT)?\" Q4(b): > \"What is meant by:",
  "> > Crystal field splitting energy > Crystal field stabilization energy > in coordination compounds?\"",
  "Q4(c): > \"What do you understand by 10Dq? > > Write the units in which it is expressed. > What is meant by Dq and Δ?\"",
  "Q4(d): > \"How does CFT explain the violet color of [Ti(H₂O)₆]³⁺?\" Q4(e): > \"Is the d-d electronic transition in [Ti(H₂O)₆]³⁺ allowed or",
  "> forbidden? > > Give reasons.\" Q4(f): > \"What is the Jahn-Teller effect? > > Show this Jahn-Teller effect in the absorption spectra of",
  "> [Ti(H₂O)₆]³⁺.\" Later 2001 -- Q1(a) (Second Part): > \"On the basis of molecular orbital theory, explain the formation of",
  "> molecules of O₂ and HF. > > Also, provide a molecular orbital diagram and calculate the bond > order.\"",
  "Later 2001 -- Q1(b): > \"Give an example in each case and explain the phenomena of sp³, sp², > and sp hybridization.\"",
  "> \"What are general features of the metallic bond? > > Discuss general theories put forward to explain the nature of the",
  "> metallic bond.\" Q1(d): > \"How many possible orientations are there in three-dimensional space > for s, p, d, and f orbitals?\"",
  "Q7(b): (In the context of theories for complex compounds) > \"How is Valence Bond Theory applied to explain the structure of",
  "> complex compounds? > > What are its limitations?\" Q7(c): > \"How is Crystal Field Theory applied to explain the color and",
  "(c) \"Write an essay on hybridization and its significance in predicting the shape of molecules.\" (7 marks)",
  "(a) \"Give a comparison of Valence Bond (VB) and Molecular Orbital (MO) theories of bonding highlighting their important features.\" (7",
  "Items testing hybridization types (e.g., \"The geometry associated with 3 2 sp d hybridization is...\").",
  "(c) \"With suitable examples of multi-electron atoms, elaborate Aufbau principle in the light of Pauli's principle and Hund's rule.\"",
  "(b) \"Draw the molecular orbital diagram of CO molecule showing sigma, pi bonding, nonbonding and antibonding molecular orbitals.\"",
  "(c) \"Discuss the difference between the hybridization of SO₂ and SO₃.\" (04 marks) 2015, Part-II, Q.6:",
  "(b) \"How these compounds can be prepared by Grignard reagent? (i) Ethane (ii) Acetic acid (iii) 2-Butanol\" (12 marks)",
  "- Electronic configurations for transition metal ions 2016 -- Q. No. 6:* > \"Describe main features of crystal field theory, How this theory",
  "> explains colour of coordination complexes?\" (10 marks) > \"Write the electronic configuration for each of the following: Ni²⁺ ,",
  "> Cu, Mn²⁺ , Cr³⁺\" (4 marks) > \"What is John-Teller theorem? Explain its significance in coordination",
  "> chemistry.\" (6 marks) 2016 -- Q. No. 7 (a):* > \"What are lanthanides? How are these extracted from their ores?\"",
  "> (Note: Q. No. 7(b) on decay law appears incomplete but pertains to > nuclear decay.) Study Focus:*",
  "- Be sure to memorize key CFT concepts and practice writing electronic configurations for transition metals.",
  "- Understand and illustrate the Jahn--Teller distortion in octahedral complexes. Key Topics/Theme to Focus On:*",
  "- Ability to draw MO diagrams and explain bonding in simple diatomics (e.g., CO) and polyatomic species.",
  "> \"Describe the main features of Crystal Field Theory.\" Q6(b): > \"Define and explain the terms: >",
  "> Crystal Field Splitting > High Spin Complexes > Low Spin Complexes > Spectrochemical Series\" Q6(c):",
  "> \"How can Crystal Field Theory explain the spectral and magnetic > properties of coordination compounds?\"",
  "Q6(d): > \"Compounds containing the Sc³⁺ ions are colorless, whereas those > containing the Ti³⁺ ions are colored.",
  "> > Explain.\" Q6(e): > \"Determine the molecular orbital bond orders of S₂, Cl₂, NO⁺. > > Compare the values with the bond orders determined from Lewis",
  "(Although not solely CFT, this touches on energetics important for coordination compounds.)* 2010, Part-II, Q.7:",
  "\"(b) How Werner's Theory explains the structure of coordination compounds?\" (08 marks) 2011, Paper-I MCQs (selected examples):",
  "Items on coordination complexes (e.g., \"Which of the following describes how a catalyst works...\", and questions on complexes such",
  "(a) \"How CFT and MOT account for the fact that [CoF₆]³⁻ is paramagnetic but [Co(NH₃)₆]³⁺ is diamagnetic?\" (06 marks)",
  "(b) \"What is the origin of magnetic property in the complexes of transition elements? Give some factors on which magnetic property",
  "> \"What is meant by Crystal Field Stabilization Energy? > > How can it be calculated? > Give its applications.\"",
  "Q6(b): > \"Explain briefly the spectrochemical series.\" Q6(c): > \"Discuss various experimental evidences in favor of Werner's Theory.\"",
  "Q6(d): > \"What is Chelate Effect? > > Explain.\" • Q5(b): \"Explain Werner's theory of coordination complexes. Give",
  "examples from d-block transition metals.\" • Q7(a): \"Explain crystal Field Theory (CFT) for d-block elements.\"",
  "• Q3(c): \"Explain VBT (Valence Bond Theory) of coordination complexes in detail.\" • Q4(a): \"What is Valence Bond theory? How does this theory",
  "explain the structure of inorganic molecules?\" • Q4(b): \"Define and explain the phenomenon of resonance in inorganic compounds.\" • Q4(c): \"Write some general characteristics of actinides.\" • Q6(c): \"Discuss variation in oxidation states of lanthanides.\" • Q8(a): \"What is crystal field theory? How does this theory explain the geometry of complexes?\"",
  "• Q7(a): \"Compare Valence Bond Theory with Molecular Orbital Theory.\" • Q7(b): \"What is the oxidation state? Differentiate between the",
  "oxidation state and valency/covalency of an element with suitable examples.\" • Q7(c): \"Write the molecular orbital configuration of the following: O₂⁺, O₂, O₂⁻, and O₂⁻².\"",
  "• Q2(c): \"Explain the occurrence and oxidation states of Lanthanides.\" • Q6(b): \"Give the postulates of Werner's theory of coordination",
  "compounds. How does it justify the formulae of: • Q7(a): \"Discuss in detail the Soft and Hard Acid and Base (SHAB)",
  "concept with suitable examples.\" • Q8(a): \"Discuss the nomenclature and structure of coordination complexes with coordination number 2--10.\"",
  "Q2(b): > \"Derive an expression for the rate constant for a second-order > reaction, assuming the initial concentration of reactants to be",
  "> different.\" Q2(c): > \"How does an increase in temperature affect equilibrium for an > exothermic reaction?\"",
  "MCQ Examples (2001, Compulsory): For example, one MCQ asks: > \"The addition of a catalyst to a reaction:",
  "> (A) Changes the enthalpy > (B) Changes the entropy > (C) Changes the activation energy > (D) None of these\"",
  "2002 -- Kinetics (Second Part): Q2(b):* > \"Derive the kinetic expression for the rate constant for a",
  "> second-order reaction with the same initial concentrations of the > reactants.\" Q2(c): > \"In terms of Kinetics, explain why each of the following speeds up a",
  "> chemical reaction: > (i) Catalysis > (ii) Increase in temperature > (iii) Increase in concentration\"",
  "2003 -- Kinetic Analysis in Organic Reaction (Q2(b)): Q2(b):* > \"In thermal decomposition of benzene diazonium chloride:",
  "MCQ Example (2003, later part -- Q9): > \"For the reaction A + B → C, the change in [A] with time is shown in",
  "> the graph. > > What is the rate law for this reaction? > Options include expressions such as: > −d[A]/dt = K[A], K[A]², K[A]²[B], etc.\"",
  "(a) \"How can temperature affect the rate of a reaction? Also make a diagram to explain the energetics involved.\" (7 marks)",
  "(b) \"A ® product(s): is a second order reaction. Develop an integrated rate law for the reaction and suggest a method to confirm",
  "(c) \"Reaction of sodium ethoxide (Na⁺--OCH₂CH₃) with bromomethane (CH₃Br) is about 10,000 times faster as compared to that with",
  "Several items test concepts such as reaction order, half-life, and rate laws (e.g., \"Which of the following should be plotted against",
  "(a) \"How do you differentiate between inter-molecular and intra-molecular hydrogen bonding? ...\" (08 marks) *(Note: This",
  "question also touches on reaction mechanisms when hydrogen bonding affects reaction rates.)* 2013, MCQs (selected):",
  "Items that assess kinetic concepts such as rate laws and reaction coordinate diagrams. 2015, Part-II, Q.7:",
  "(a) \"Hydrolysis of Ethylacetate by sodium hydroxide is done by taking different initial concentration. What will be the rate of",
  "(b) \"A second order reaction has equal concentrations of reactants and is 25% completed in 20 minutes. How much time is required to",
  "(c) \"Express the rate of reversible decomposition of Phosphorus pentachloride into Phosphorous trichloride and chlorine in terms of",
  "- Integrated rate laws for various orders, methods to determine reaction order (e.g., half-life, plotting techniques).",
  "2001 -- Organic Synthesis and Mechanism (Later Section): Q5(a):* > \"Write down the similarities between carbon and silicon.",
  "> > Why does silicon form complexes while carbon does not?\" Q5(b): > \"What is allotropy? > > Write down the different allotropic forms of carbon.\"",
  "Q5(c): > \"What are silicones? > > Give their important applications.\" Q5(d): > \"Explain the difference in density and electrical conductivity between",
  "> diamond and graphite.\" Organic Section Q5(a): > \"Why does benzene undergo electrophilic substitution reactions,",
  "> whereas alkenes undergo addition reactions?\" Organic Section Q5(b): > \"How will you synthesize the following compounds from benzene?",
  "> > (Maleic Anhydride, Acetophenone, Chlorobenzene, Glyoxal, Benzene > Hexachloride)\" Organic Section -- Replacement Reactions Q(a):",
  "> \"Give an account of replacement reactions of diazonium compounds.\" Organic Section -- Dye Synthesis Q(b):",
  "> \"How will you prepare the following: > > Congo red (2 marks) > Bismarck Brown (3 marks) > Malachite green (3 marks)\"",
  "Organic Section Q(a) (Polymerization & Fermentation): > \"Why do some organic compounds polymerize easily, while others require",
  "> stronger conditions for polymerization, and some do not polymerize at > all?\" Organic Section Q(b):",
  "> \"What are the pre-requisites for a good fermentation process?\" Organic Section Q(c): > \"Explain the following and give two examples in each case:",
  "Compulsory MCQs (2001, later part) include further organic topics such as Grignard reagent reactivity, stereochemistry (e.g., \"A sp³d²",
  "2002 -- Organic Synthesis & Reactions (Second Part): Q4(a):* > \"What do you know about nucleophilic aromatic substitution reactions?",
  "> > Give their synthetic applications.\" Q4(b): > \"Comment on the limitations of Friedel-Crafts reaction.\"",
  "Q4(c): > \"Classify Azo dyes on the basis of their applications. > > Give at least two examples in each case.\"",
  "Q5(a): > \"What are Grignard Reagents? > > Discuss their synthetic importance.\" Q5(b): > \"What is the difference between basicity and nucleophilicity?",
  "> > Arrange H₂O, NH₃, OH⁻, R-S⁻, CN⁻, and Cl⁻ in decreasing order of > nucleophilicity.\" Q5(c): > \"Discuss four major industrial uses of alkyl halides other than as",
  "> synthetic reagents.\" Q6: > \"Write comprehensive notes on ANY TWO of the following: > > (a) Conformational Analysis",
  "> (b) Polymerization > (c) Alkaloids\" Q7: > \"(a) How many chiral carbon atoms are there in an aldotetrose?",
  "> > Give the Fischer's formula and common names for the stereoisomers of > an aldotetrose. > > Classify them as D and L sugars. > > (b) Why do aldoses react with Fehling's solution but not with sodium > bisulphite? > > (c) What is meant by lactose intolerance? > > (d) Give a simple test for starch and explain how it is affected by > temperature.\"",
  "Compulsory MCQ (2002, Second Part Q8): Several MCQs here also touch on VSEPR, hybridization, acid--base",
  "2003 -- Organic Synthesis & Mechanisms (Second Part): Q4(a):* > \"Give the synthesis of Benzene diazonium salt.\"",
  "Q4(b): > \"How will you prove that this salt is electrophilic?\" Q4(c): > \"Give the synthetic application of Diazonium salt.\"",
  "Q4(d): > \"How is Acetanilide prepared from Aniline?\" Q5(a): > \"How would you prepare the following compounds using Grignard's",
  "> reagent of your own choice? > > (i) Primary alcohol > (ii) Carboxylic acid > (iii) Phenol > (iv) Ketone > (v) Aldehyde\"",
  "Q5(b): > \"Why is a racemic mixture optically inactive? > > How can this be resolved into optically active compounds?\"",
  "Q5(c): > \"How can the knocking problem of a fuel engine be solved?\" Q6 (first part): > \"Draw the molecular orbitals of the following:",
  "> > (i) 1,3-Pentadiene > (ii) Benzene > (iii) Allylic cation\" Q6 (second part): > \"What is the hybridization of carbon and oxygen atoms in the",
  "Q6(c): > \"Write a note on the role of Vitamin-A in the chemistry of vision.\" Q6(d): > \"NaCl is soluble in water but not in pentane.\"",
  "Q7(a): > \"How is sulphonation of Benzene carried out? > > Give its mechanism.\" Q7(b): > \"Give oxidation reactions of Aldehydes and Ketones.\"",
  "Q7(c): > \"Explain why: > (i) The ionization constant of 2,6-dihydroxybenzoic acid is 10,000 > times greater than that of its isomer 3,5-dihydroxybenzoic acid.",
  "> (ii) The boiling point of Acetic acid is 118°C, whereas that of Methyl > formate is only 31°C.\" Compulsory MCQs (2003, Second Part Q8):",
  "(A long series of MCQs covering topics from stereochemistry to reactivity, with exact option sets provided.)",
  "2005 -- Organic Synthesis & Mechanism (Second Part): Q1(a):* > \"Discuss the principles involved in the Valence Bond Theory.",
  "> > How is this theory applied to explain the formation of chemical bonds > in NH₃, HCl, and N₂?\" Q1(b):",
  "Q1(c): > \"Write the structural formula of: > > (i) Blood Sugar > (ii) Table Sugar > (iii) Milk Sugar\"",
  "Q2(a): > \"Distinguish between the Molecularity and the Order of Reaction. > > Explain with examples.\"",
  "Q2(c): > \"Describe the synthesis of DDT from Trichloroacetaldehyde.\" Q3(a): > \"How are aromatic amine compounds converted to diazonium salts?\"",
  "Q3(b): > \"What happens when benzene diazonium salt is refluxed with: > > (i) H₃PO₂ > (ii) H₂O",
  "Q4(a): > \"Explain Cahn-Ingold-Prelog rules. > > Where are they applied in chemistry? Give examples.\"",
  "Q4(b): > \"Predict the product of the following reaction and explain its > formation: > > Me--H₂SO₄ →\"",
  "Q4(c): > \"Give the industrial use of whale oil and cod-liver oil.\" Q5(a): > \"How are primary, secondary, and tertiary alcohols, carboxylic acids,",
  "> and aldehydes synthesized using Grignard reagent?\" Q5(b): > \"Explain why halogens are ortho/para directors but deactivating groups",
  "> in aromatic electrophilic substitution.\" Q5(c): > \"Give the decreasing order of reactivity of alkyl halides in reactions",
  "> with metals. > > Give examples.\" Q6(a): > \"One mole of benzene is mixed with one mole of nitrobenzene and ½ mole",
  "> of acetylene. > > Some FeBr₃ is added and the mixture is heated under reflux. > > What is the name of this reaction? > > Explain your answer with a full reaction mechanism.\"",
  "Q6(b): > \"Why does diethyl amine have a higher boiling point than > triethylamine?\" Q6(c): > \"Why are carbonyl compounds more soluble in water than the",
  "> corresponding alkanes but less than the corresponding alcohols?\" Q6(d): > \"What makes azo compounds so suitable as dyes?\"",
  "Q6(e): > \"Describe the preparation of streptomycin by fermentation.\" Q7(a): > \"Prove that nucleophilicity and basicity are fundamentally different",
  "> properties. > > Prove this with special reference to aromatic amines.\" Q7(b): > \"Discuss the importance of alkylation, hydroalkylation, and cracking",
  "> in the manufacture of petrochemicals.\" Q7(c): > \"Write a note on homogeneous and heterogeneous catalysis.\"",
  "Compulsory MCQs (2005, Second Part Q8): A long series of multiple--choice questions covering topics from",
  "transition element characteristics to reaction types, quantum numbers, oxidation states, and more. 2007, Paper II, Q.4:",
  "(a) \"Suggest one convenient method each for the preparation of RCHO (an aldehyde) and R₂CO (a Ketone). How to establish that the",
  "(b) \"Give a general explanation for the electrophilic substitution of benzene. Give chemical equations showing all steps (with reaction",
  "(c) \"Write an essay on the Grignard reagents. Give one example each in which the Grignard reagent acts as base and as nucleophile.\"",
  "(a) \"Suggest a method for the synthesis of benzene-diazonium chloride (BDC) from nitrobenzene. Write down chemical equations for",
  "(b) \"Organic polymers have brought about a socio-economic revolution of present age. Justify by referring to three important",
  "(c) \"Write an essay on Vitamins. Why are the Vitamin-A and C important?\" (6 marks) 2010, Part-II, Q.3:",
  "(a) \"How do you measure the pH of a solution by potentiometric method using: (i) Hydrogen Electrode (ii) Glass Electrode\" (15 marks",
  "(b) \"Calculate the pH of a buffer solution containing 0.2M acetic acid and 0.02 M sodium acetate. pKa of acetic acid is 4.73.\" (5",
  "(c) \"What do you understand by the terms Z and E isomer? Illustrate your answer by quoting suitable examples.\" (06 marks)",
  "(a) \"Hydrolysis of Ethylacetate by sodium hydroxide ... What will be the rate of this reaction?\" (6 marks)",
  "(b) \"A second order reaction ... How much time is required to complete the reaction by 75%?\" (10 marks)",
  "(c) \"Express the rate of reversible decomposition of Phosphorus pentachloride ...\" (4 marks) 2014, Part-II, Q.7:",
  "\"How would you prepare the following compounds from benzene? Name each reaction as well. (i) Acetophenone (ii) Bromobenzene (iii)",
  "\"How would you prepare the following compounds from benzene? Name each reaction as well. (i) Acetophenone (ii) Bromobenzene (iii)",
  "- Detailed organic reaction sequences (Grignard reactions, diazotization, aldol condensation, etc.) 2016 -- Organic Section (Selected Examples):",
  "\"How would you synthesize each of the following molecule from an alkene of appropriate structure (structure of your choice).",
  "\"Write the expected major product of the reaction of propyne with each of the following reagents. (i) Cu₂Cl₂, O₂, pyridine",
  "(ii) Na, ND₃ (iii) [(CH₃)₂CHCH₂CH₂]₂BD then CH₃CO₂H (iv) H₂O, HgSO₄, H₂SO₄ (v) Di-isoamylborane, then NaOH, H₂O₂ (vi) Di-isoamylborane, then CH₃CO₂D\"",
  "\"Starting with benzene, design reasonable syntheses of each of the following compounds. (i) ... CH₂OH",
  "\"The two isomers of carvone are given below. Which is R and which is S? (+)-Carvone vs. (--)-Carvone\"",
  "(b) \"The structure of compound given below is a sugar called (--)-arabinose. Its specific rotation is --105°. (i) Draw enantiomer(s) of (--)-arabinose (ii) Draw diastereomer(s) of (--)-arabinose (iii) Does (--)-arabinose have any optically inactive diastereomers? If it does, draw one.\" (c) \"Assign E,Z designation to the following structures.\" (with diagrams provided) (d) \"Draw the structures of the product(s) described for each of the following reactions. Specify all aspects of the stereochemistry.\"",
  "Q. No. 7 (Organic Short Answers): \"Write a brief account on the following: (a) Biological importance of starch",
  "(b) Classification of Amino acids (c) Primary structure of Proteins (d) Glycogenesis\" (5 marks each)",
  "Q. No. 8 (Spectroscopy & Structural Analysis -- Organic): Parts (a)--(e) include differentiation using IR, discussion of",
  "- Practice writing synthesis routes from simple alkenes and benzene. enantiomers/diastereomers) and work with Fischer projections.",
  "Additional Organic Questions from 2017 & 2018: In 2017, similar organic synthesis and mechanism questions appear",
  "- For example, 2017 Q. No. 3 asks for synthesis from alkenes, and 2017 Q. No. 4 focuses on aromaticity and Friedel--Crafts mechanisms.",
  "- In 2018, Part-II Q. No. 2--Q. No. 8 cover resonance, organic reaction completion, and stereochemistry.",
  "• Q.No.2: \"Explain the difference between: (i) Inductive and Field effects, (ii) Inductive and Resonance effects, (iii) Localized and",
  "Delocalized bonding, (iv) Conjugation and Hyperconjugation.\" • Q.No.3(a): \"'The resonance effect has an appreciable influence on physical characteristics and the chemical reactivity of organic molecules'. Elaborate the statement with the help of examples.\" • Q.No.3(b): \"Outline the EAS mechanism (Electrophilic Aromatic Substitution) through which aromatic compounds react with electrophiles.\" • Q.No.3(c): \"Discuss factors which favour an elimination reaction occurring over a substitution reaction.\" • Q.No.4: \"How would you carry out the following conversions? Account for your answer with mechanism in each case. (i) (CH₃)₃CCH=CH₂ → (CH₃)₂C(OH)CH(CH₃)₂ ... (and other conversions)\" • Q.No.5: \"The following reactions can be used for the preparation of alkanes or cycloalkanes. Elaborate them with the help of reaction mechanisms. (i) Corey--House reaction, (ii) Wurtz reaction, (iii) Kolbe reaction, (iv) Simmons--Smith Reaction.\" • Q.No.6: \"How would you convert cyclohexanone into the following compounds? Write down the mechanisms of the reactions. (a) Caprolactone, (b) Caprolactam, (c) Cycloheptanone, ...\" • Q.No.7: (a) \"How can a racemic mixture be separated into its components? Describe different methods.\" (b) \"(-)-Lactic acid has a specific rotation of --3.8°. What will be the specific rotation of a solution containing 7.5g of (-)-lactic acid and 2.5g of (+)-lactic acid?\" • Q.No.8(a): \"Starch, glycogen and cellulose are polymers of glucose. How will you differentiate among these three both structurally and functionally?\" • Q.No.8(b): \"Explain precisely the following terms: (i) Glycolysis, (ii) Glycogenolysis, (iii) Glycogenesis, (iv) Gluconeogenesis.\"",
  "• Q.2(a): \"Describe factors that influence keto-enol tautomerization. Elaborate the statement with the help of examples.\"",
  "• Q.2(b): \"Assign 'R' or 'S' configuration on each of the chiral centers of the given compounds.\" • Q.3(a): \"Give the products expected (if any) when ethylbenzene reacts under the following conditions: ...\" • Q.3(b): \"Account for the following: (i) Intramolecular H-bonding is stronger than intermolecular H-bonding; (ii) Control of nucleophilic substitution reaction over elimination reactions.\" • Q.4: \"Write down reagents, reaction conditions and important steps for the following conversions: ...\" • Q.5: \"The following reactions can be used for the preparation of alkanes or cycloalkanes. Elaborate them with the help of reaction mechanisms.\" • Q.6: \"How would you convert cyclohexanone into the following compounds? Write down the mechanisms of the reactions.\" • Q.7: (Same as 2020 Q.No.7 on resolution and specific rotation.) • Q.8: (Same as 2020 Q.No.8 on polymers and metabolic pathways.)",
  "• Q.2(a): \"Arrange the following alkenes in order of their relative stability. How will you proceed to determine the order",
  "practically?\" • Q.2(b): \"Explain why? (i) Poly substitution is a complicating factor in aromatic alkylation but not in aromatic nitration or halogenation; (ii) A undergoes nitration predominantly at the ortho/para positions but B mainly at meta position.\" • Q.2(c): \"Compare the basicity of: (various amines/anilines)...\" • Q.2(d): \"Explain why? (i) Tertiary carbocation is more stable than primary; (ii) Ethanol has higher boiling point than diethyl ether.\" • Q.3(a): \"Write the structural formula for the more stable conformation of each of the following compounds: ...\" • Q.4: (Contains parts on NMR details that cross over with spectroscopy.) • Q.5: \"Write down the reagents, conditions and mechanisms of the following reactions: (i) Kolbe reaction, (ii) Williamson synthesis, (iii) Dow Process, (iv) Reimer--Tiemann reaction, (v) Bromination of phenol.\" • Q.5(b): \"Outline all steps involved in the synthesis of the following compounds from benzene or toluene ...\" • Q.6: \"(a) Describe with equations all possible methods that can be used for the preparation of n‑hexane. (b) Why is the Corey--House Method more suitable as compared to the Wurtz reaction for the synthesis of alkanes? Explain with examples. (c) Draw the structures of the following compounds and label them with IUPAC systematic rules: ...\" • Q.7: (Multiple parts on Grignard, Reformatsky, Wittig, and actoaacetic ester synthesis.) • Q.8: (a) \"Discuss the following topics:",
  "(b) \"Name the epimers of d‑glucose.\" (c) \"Clearly represent the most stable conformation of the -pyranose form of each of the following sugars: D-Galactose, D-Mannose, L-Mannose, L-Ribose.\"",
  "• Q.5(b): \"What is solvent extraction? Discuss its theory and uses for the extraction of metals.\"",
  "• Q.5(c): \"What is the theory of buffer solutions? Explain.\" • Q.6(a): \"Explain the kinetics of enzyme catalysis.\"",
  "2001 -- (Within Compulsory MCQs):* Examples include: > \"De Broglie's relation between momentum and wavelength for an electron",
  "Q1(b): > \"Describe the main conditions of wave equation to understand the > behavior of the hydrogen atom. (Marks: 6)\"",
  "Q1(c): > \"What is meant by eigenfunction? > > How can it be used to represent an orbital in a hydrogen atom? (Marks:",
  "- Requirements for a \"well‐behaved\" (physically acceptable) wave function 2016 -- Q. No. 2:* > \"What is Schrodinger wave equation? Discuss its importance in quantum",
  "> chemistry.\" (6 marks) > \"Solve the Schrodinger wave equation for a particle in > three-dimensional box and find the expression for the energy and wave",
  "> function.\" (8 marks) > \"What is a well-behaved function? What are the requirements of a > physically acceptable wave function?\" (6 marks)",
  "2017 -- Q. No. 2:* > \"Derive Schrodinger wave equation for motion of a particle in one > dimensional box.\" (10 marks)",
  "> \"Solve Schrodinger wave equation to find the expression for wave > function energy of a particle in one dimensional box.\" (6 marks)",
  "> \"What is Eigen function and Eigen value? Give examples.\" (4 marks) 2018 -- Q. No. 2 (a):* > \"Explain de Broglie's hypothesis and derive its equation. How Davisson",
  "Study Focus:* Be sure to master the derivation steps, understand boundary conditions in a box, and know the physical significance of",
  "• 2020 • Q2(b)(i): \"Explain Heisenberg's uncertainty principle.\" • Q2(b)(ii): \"Discuss Born's interpretation of wave function.\"",
  "• 2021 • Q4(a): \"Explain photoelectric effect and probability density.\" • Q4(b)(i): \"Explain Eigen function & Eigen value.\" • Q4(b)(ii): \"Derive Schrödinger wave equation for a particle in one dimensional box.\"",
  "• 2022 • Q2(a): \"Derive Schrödinger wave equation for particle in one dimensional box.\" • Q2(b): \"Discuss Heisenberg's Uncertainty principle.\"",
  "• 2023 • Q4(a): \"Describe Schrödinger Wave Equation for a particle in a three-dimensional box.\" • Q4(b): \"Explain photoelectric effect.\" • Q4(c): \"What is a wave function? Give Born's interpretation of wave function.\"",
  "• 2024 • Q2(a): \"What is the de Broglie hypothesis, and how was this proved experimentally?\" • Q4(b): \"Discuss the Hamiltonian operator in detail.\"",
  "2001 -- Inorganic Extraction and Environmental Issues: Q3:* > \"Aluminum is not found in native form but in combination. Why?",
  "> > What are the chief minerals of aluminum? > > Write down the impurities associated with it. > > How is aluminum extracted from its important ore by the Hall and > Heroult process? > > Why is chemical reduction not suitable for this process? > > Write down the major applications of aluminum. > > What are ultramarines?\"",
  "Q7: > \"Write short notes on the following: > > (a) Theories of metallic bonding > (b) Glass industry",
  "2004 -- Extraction, Pollution & Industrial Chemistry: Q1:* > \"How is aluminum found in nature? (Marks: 03)",
  "> > Write an account of the chemistry associated with the conversion of > bauxite to aluminum. (Marks: 08) > > What are the main impurities present in bauxite? > > How are they eliminated? (Marks: 04) > > It is now said that we are living in the aluminum age. > > Discuss the truth of this statement. (Marks: 05, Total: 20)\"",
  "Q2: > \"What is meant by air pollution? (Marks: 03) > > What are the common pollutants in our air?",
  "> > Describe their sources from which they originate. (Marks: 05) > > Discuss the effect of oxides of nitrogen and sulfur in the atmosphere > on living organisms. (Marks: 06) > > Name materials that act as sinks for gases. > > What other measures would you suggest to control these gases in the > atmosphere? (Marks: 06, Total: 20)\"",
  "Q7: > \"(a) Name the chief ores of iron. (Marks: 03) > (b) How is pig iron extracted from hematite ore?",
  "> > Is this process oxidation or reduction? > > Explain. (Marks: 05) > (c) Give the reactions that take place in the blast furnace at various > temperature zones during the production of pig iron. (Marks: 05) > (d) What are the main impurities present in cast iron? > > State their adverse effects on the properties of iron. (Marks: 04) > (e) What are carbon steels and alloy steels? > > State their applications. (Marks: 03, Total: 20)\"",
  "Q8: > \"Write notes on any four of the following: (Marks: 5 × 4 = 20) > > Debye-Hückel Theory of Activity Coefficients",
  "> Cement Industry and the Process of Setting of Cement > Glass Industry and Ceramics > Fullerenes and Their Applications > Silicates and Their Uses\"",
  "\"Discuss the measures for the control of CO (Carbon mono-oxide) pollution in air.\" (7 marks) 2010, Part-II, Q.5:",
  "\"What is acid rain? How is it produced? ...\" along with parts on effects and sources. 2012, Q.8 (Part-I):",
  "(a) \"How are the human activities in urban areas responsible for air-pollution? What measures should be taken to minimize",
  "\"Using VSEPR theory, identify the type of hybridization and draw the structure of OF₂. What are oxidation states of O and F?\" (5 marks)",
  "(b) \"A buffer of pH 9.26 is made by dissolving x moles of ammonium sulphate and 0.1 mole of ammonia into 100 mL solution. If pKb of ammonia is 4.74, calculate the value of x.\" (5 marks) (c) \"Explain soft and hard acids and bases (SHAB) concept with examples. How is it able to explain the stability of complexes and reaction rates?\" (10 marks)",
  "\"Explain crystal field theory. How it differs from valence bond theory? Also explain crystal field splitting. How crystal field",
  "stabilization energy of a complex is calculated?\" (b) \"Write systemic names of following compounds. K₄[NiF₆], K₃[Fe(CN)₆], [Co(NH₃)₄Cl₂]Cl, K₂[PtCl₆], K₂[Cu(CN)₄]\" (c) \"Write the coordination number and oxidation state of the metal ion in each of the above stated complexes.\"",
  "\"What are the principal ores of Silver? How Silver is extracted from its ores?\" (8 marks) \"Discuss the metallurgy of copper.\" (6 marks)",
  "\"Describe the contact process for the manufacture of sulphuric acid.\" (8 marks) \"What are the different types of Fertilizers? Give their chemical",
  "formula.\" (5 marks) \"Discuss the measures for the control of CO (Carbon mono-oxide) pollution in air.\" (7 marks)",
  "- In 2017 and 2018, additional Part-II questions address industrial processes, for example in 2018 Q. No. 5 (synthesis of polymers) and Q.",
  "- Understand industrial processes (e.g., blast furnace reactions, urea synthesis) and environmental impacts (acid rain, greenhouse",
  "- Be ready to draw flow diagrams where asked (e.g., extraction of aluminium or urea manufacturing). Key Topics/Theme to Focus On:*",
  "> > Discuss the importance of carbon as a reducing agent for the > production of metals. (Marks: 7)\"",
  "Q4(c): > \"Explain briefly micro and invivo nitrogen fixation. > > Discuss the importance of molybdenum compounds in the process. (Marks:",
  "> 4)\" Q4(d): > \"Starting from silica, how will you prepare any two of the following? > > (i) SiCl₄",
  "> (ii) Water glass > (iii) Hydrofluorosilicic acid (Marks: 4, Total: 20)\" Q5(a): > \"Describe the importance of Calcium Superphosphate as a fertilizer.",
  "> > How is it prepared on a commercial scale? (Marks: 6)\" Q5(b): > \"What is the function of NO in the manufacture of H₂SO₄ by the Chamber",
  "> Process? (Marks: 5)\" Q5(c): > \"Thermodynamic stability is different from kinetic stability. > > Comment on this statement. (Marks: 5, Total: 20)\"",
  "(c) \"Discuss the measures for the control of CO (Carbon mono-oxide) pollution in air.\" (7 marks) 2010, Part-II, Q.7:",
  "(c) \"5.35 gm NH4Cl is heated with excess of quick lime. ... Calculate the normality of this solution.\" (6 marks)",
  "Items on blast furnace raw materials (e.g., \"The basic raw materials used in a Blast furnace to produce Iron are Iron ore, Coke, Air and:",
  "Q.3: \"Describe the manufacture of Phosphorus on a large scale. Draw the figure of Nitrogen cycle ... Compare the physical properties of",
  "Q.4: \"How is steel manufactured? Describe various chemical reactions taking place in the blast furnace. Describe the electrolytic",
  "Q.5: \"What are fertilizers? ... Describe the processes of Urea manufacturing in Pakistan.\" Key Topics/Theme to Focus On:*",
  "Questions on metallurgy (silver, copper, iron ores) and the contact process for sulphuric acid. 2010, Part-II, Q.7:",
  "Questions on gangue, slag, aluminum extraction, and flux in iron extraction. 2015, Part-II, Q.4 & Q.5:",
  "\"What are fertilizers? ... Describe the processes of Urea manufacturing in Pakistan.\" 2007, Paper I, Q.5(c):",
  "\"Discuss the measures for the control of CO (Carbon mono-oxide) pollution in air.\" (7 marks) 2010, Part-II, Q.5:",
  "\"How are the human activities in urban areas responsible for air-pollution? What measures should be taken to minimize",
  "\"What is Greenhouse Effect? How does it cause global warming of Earth?\" and \"What is meant by water pollution? Discuss various",
  "- (iii) \"Determine the structure for a compound with formula C₆H₄N₂O₄ with the following ¹H-NMR data: δ 8.76 t (1H), 8.38 dd (2H),",
  "- (iv) \"Assign chemical shifts of each proton in the above structure.\" • (a) \"In benzaldehyde, two of the ring protons have resonance at 7.87",
  "ppm, and the other three have resonance in the range from 7.5 to 7.6 ppm. Explain.\" • (b) \"Arrange the following protons in the decreasing order of their δ values in ¹H-NMR and account for your order: Methyl, ethylenic, acetylenic, aryl, and aldehydic.\" • (c) \"List the solvents most commonly used in IR spectroscopy. Why are water and ethanol not suitable solvents?\" • (d) \"The UV spectrum of acetone shows absorption maxima at 166, 189, and 279 nm. What type of transition is responsible for each of these bands?\" • (e) \"What types of electronic transitions are possible for each of the following compounds? (i) Cyclopentene, (ii) Acetaldehyde, (iii) Dimethyl ether, (iv) Methyl vinyl ether.\"",
  "• Several MCQs test concepts related to spectroscopy (e.g. questions on quantum numbers, chemical shifts, and energy levels in a",
  "one-dimensional box), reinforcing the understanding of IR, NMR, and UV--Vis principles. • Q3(a): \"Explain the Kohlrausch law. Why do the real solution",
  "should deviate from the law?\" • Q3(b): \"Compare Langmuir's and Freundlich's adsorption isotherms.\" • Q5(a): \"Make a comparison of column chromatography and thin layer chromatography (TLC) by highlighting merits and demerits of the both.\"",
  "• Q8: \"Write notes on the following: (i) Debye--Huckel theory, (ii) Nernst's equation, (iii) Electrochemical series.\"",
  "• Q7(a): \"What is Nernst equation? Explain it.\" • Q7(b): \"Define and explain Kohlrausch's law.\"",
  "• Q8(b): \"How do you calculate the degree of dissociation (α) of a weak electrolyte using Kohlrausch's law?\"",
  "• Q8(c): \"The hydrolysis of CH₃COOCH₃ with NaOH is a second-order reaction. How do you follow the progress of this reaction in the laboratory?\" • (Plus, several MCQs in Part--1 of 2024 test related concepts such as Langmuir isotherm relations.)",
  "8. Miscellaneous Multiple-Choice Questions (MCQs)* Each year's paper contains an MCQ section covering a wide range of",
  "(A) The nuclear charge is proportional to atomic number. (B) Electrons are small compared with the atom. (C) The nucleus is small compared with the atom. (D) None of these.\"",
  "\"In photoemission of an electron, the energy of the electron depends on: (A) Intensity (B) Wavelength",
  "(C) Velocity of light (D) None of these\" ...and many others concerning de Broglie's relation, quantization, semiconductor conductivity, and acid--base properties.",
  "2002, 2003, 2004, and 2005* each include similar long sets of MCQs covering topics such as: For brevity, the exact wording of every MCQ is not repeated here, but",
  "- Application of VSEPR theory to predict molecular geometries and bond angles 2016 -- Q. No. 5:* > \"What are solubility product and common ion effect? Discuss their",
  "> significance in chemical analysis\" (8 marks) > \"Valence shell electron pair repulsion theory can be used to predict",
  "> the shapes of molecules. Using this theory explain the shapes acquired > by BF₃ and IF₅.\" (7 marks)",
  "> \"Explain why HSH bond angle in H₂S is slightly less than the > tetrahedral angle 109.5.\" (5 marks)",
  "- Quantum Mechanics & Wave Functions: Questions on Schrödinger's equation, eigenfunctions/eigenvalues appear repeatedly (2016, 2017,",
  "- Thermodynamics & Kinetics: Gibbs free energy, heat capacities, and the Arrhenius equation are constant features (2016--2018).",
  "- Coordination Chemistry: Crystal field theory, electronic configurations, and Jahn--Teller (or John-Teller) effects are tested",
  "- Organic Synthesis & Stereochemistry: Multiple questions require synthesis design, mechanism elucidation, and stereochemical assignments",
  "- Analytical & Inorganic Concepts: MCQs and short notes on electrochemistry, periodic trends, and analytical methods occur in every",
  "Thermodynamics: Detailed, multi‐part questions in 2001, 2002, 2004, and 2005 ask for definitions, derivations (work done, efficiency), and applications",
  "Crystal Field Theory and Molecular Orbital Theory questions appear in 2001, 2003, 2004, and 2005---with questions on 10Dq, Jahn--Teller effect, bond order, and orbital orientations.",
  "Kinetics & Mechanisms: Both conceptual (molecularity, reaction order) and quantitative (half-life, rate law derivations) problems occur in 2001--2003; MCQs",
  "further test these ideas. Organic Synthesis: There is a strong emphasis on reaction mechanisms and synthesis",
  "Quantum Mechanics: Basic quantum mechanical models (particle in a box, eigenfunctions) and related MCQs appear in 2001 and 2005.",
  "(a) \"What is hydrogen spectrum? How does it help in understanding the structure of atom?\" (10 marks)",
  "(b) \"Write comprehensive notes on hydrogen and metallic bonding.\" (10 marks) 2010, Part II, Q.2:",
  "\"Derive the Principal Quantum number from schrodinger wave equation and justify that if the orbit of hydrogen atom is spherically",
  "(In the same question, later parts involve calculating energy levels in a one‐dimensional box.) 2011, Paper-I MCQs (selected examples):",
  "MCQs include items testing hybridization, orbital geometry, and quantum numbers (e.g., \"Which of the following represents the shape",
  "(a) \"Derive Schroedinger's wave equation for a particle of mass 'm' confined in a one‐dimensional box of length 'l'. Also give a",
  "(c) \"What are Bohr's postulates and how do they explain the hydrogen atom spectrum?\" Key Topics/Theme to Focus On:*",
  "- Differences between various bonding models (MO vs. VB) and quantum treatments (Schrödinger equation, zero‐point energy).",
  "\"Derive Schrodinger wave equation and calculate the energy of the particle in one dimensional box ...\" (related to spectral",
  "\"What do you mean by Chemiluminescence? ... Arrange the following functional groups in decreasing order of stability of carbocations?\"",
  "(and further parts about various concentration solutions and quantitative problems.) Key Topics/Theme to Focus On:*",
  "IV. Inorganic Reaction Mechanisms & Periodic Trends (MCQs and Short Answers) Across Years (2007, 2010, 2011, 2012, 2013):* - Numerous MCQs address:",
  "Oxidation numbers and reactivity trends (e.g., \"The atomic number of an element is equal to the number of: ...\" -- 2007, Q.8(15))",
  "Questions such as \"Which element has the highest ionization Energy?\" (2007, Q.8(1)) and \"What is the percent by mass of oxygen in",
  "- \"What was Rutherford's atomic model?\" (Part of a broader set on transition metals and coordination compounds.)",
  "A. Electrochemistry & Solution Equilibria (MCQs & Short Answers) Across many years (2007, 2010, 2011, 2012):",
  "Example from 2010, Q.7: \"How is standard electrode potential measured?\" and related MCQs. 2007, Paper II, Q.6(c):",
  "\"Write an essay on Vitamins. Why are the Vitamin-A and C important?\" (an example of linking organic synthesis to",
  "\"Write main steps in the formation of the following polymers: (i) Nylon 6,6 and Polyester via Condensation Polymerization; (ii)",
  "\"Differentiate between oil, fat & wax with examples. Draw structure of triglyceride ...\" (and further details)",
  "Many questions ask for concise definitions or short notes on topics such as \"Ionic Equilibria\" (2007, Q.2(a)), \"Fixation of",
  "- Be prepared to write concise definitions and notes on topics such as hyperconjugation, aromaticity, Grignard's reagent, SN1 reaction,",
  "2016 -- Q. No. 2 (Second part): \"Write briefly on the following terms: (2 each) (i) Hyper-conjugation",
  "(ii) Aromaticity (iii) Grignard's reagent (iv) SN1 reaction (v) Molecular chirality (vi) Monosaccharides (vii) Chemical shift (viii) Glycolysis (ix) Detergents (x) Friedal Craft alkylation\" (20 marks)",
  "- Memorize clear, concise definitions and be able to give examples where applicable. Key Topics/Theme to Focus On:*",
  "- Review fundamental definitions and be able to write concise notes on diverse topics from polymers and catalysts to unit operations."
]