[
  "1. Nature, Scope, and Theoretical Perspectives in Criminology 2016 -- Q. No. 2:* \"Explain the nature and importance of Criminology in detail.\"",
  "2017 -- Q. No. 2: \"Write a critical note on the increasing importance of Criminology in Pakistan. Also discuss the historical development of criminology as a",
  "scientific discipline.\" 2018 -- Q. No. 2: \"Define Criminology. Discuss the scope of criminology in Pakistan.\"",
  "(a) \"How would you classify criminal behavior?\" (b) \"What would be the focus of typology?\" 2022 -- Q. No. 2:",
  "\"What is the difference between crime, deviance, sin and vice? Do you believe that crime is one of the major social problems of Pakistani society? Discuss.\"",
  "2022 -- Q. No. 3: \"What is the meaning of Anomie? Discuss Robert Merton theory of Anomie in detail.\"",
  "2023 -- Q. No. 2: \"Discuss scope of Criminology as science dealing with study of criminal law, forensics and criminal investigation.\"",
  "2024 -- Q. No. 3: \"Explain Labelling theory. Critically elaborate its effects on youth and suggest remedies also.\"",
  "2. Theories and Perspectives on Crime and Criminal Behavior 2016 -- Q. No. 3:* \"Define the term Crime and Criminals. Explain the types of Criminals",
  "in detail.\" 2017 -- Q. No. 3: \"Enlist the criminological perspectives. Briefly describe the three",
  "criminological perspectives on the study of crime and criminal behaviour.\" 2019 -- Q. No. 2: \"Travis Hirschi argued that crime results when an individual's bond to",
  "society is weak or broken. Discuss in detail what this theory of social bonding explains about crime.\"",
  "2019 -- Q. No. 3: \"Discuss the fundamental postulates of Edwin Sutherland's 'Differential Association theory' with examples.\"",
  "2020 -- Q. No. 3: \"Define and explain the following concepts: (a) Left realism and right realism",
  "(b) Phrenology and Physiognomy (c) Corporal punishment and capital punishment (d) Sociology of Law, Criminal Etiology and Penology.\"",
  "2017 -- Q. No. 4: \"Write a comprehensive note on the Juvenile justice system of Pakistan. Suggest measures for the improvement of Juvenile justice",
  "system of Pakistan.\" 2018 -- Q. No. 4: \"What is juvenile delinquency? Explain the nature, extent and causes",
  "2019 -- Q. No. 4: \"Discuss some of the functions and responsibilities of Juvenile Justice System. Do you believe that Juvenile Justice has played its",
  "role in prevention of juvenile crimes in Pakistan?\" 2020 -- Q. No. 4: \"Write a comprehensive note on the risk and protective factors of",
  "juvenile delinquency in Pakistan.\" 2021 -- Q. No. 5: \"Define Juvenile probation. Explain the organization and",
  "administration of Juvenile probation services.\" 2022 -- Q. No. 4: \"Define the term juvenile delinquency. Write a note on the history of",
  "juvenile justice system and role of juvenile court in reducing juvenile delinquency.\" 2023 -- Q. No. 4:",
  "2024 -- Section-B, Q. No. 4: \"Explain juvenile delinquency. What are the socio-economic, demographic and environmental factors lead to juvenile delinquency?\"",
  "2024 -- Section-B, Q. No. 5: \"Discuss the role of rehabilitation centers in the reformative treatment of criminals. How do these centers contribute to the",
  "4. Criminal Investigation, Interviewing, and Interrogation Techniques 2016 -- Q. No. 6:* \"Enlist and discuss the principles of Criminal Investigation.\"",
  "2016 -- Q. No. 7: \"Discuss in detail the 'Interviewing and Interrogation Techniques' of investigation.\"",
  "2017 -- Q. No. 6: \"Write a comprehensive note on the principles of criminal investigation. Illustrate with examples from Pakistan.\"",
  "2019 -- Q. No. 6: \"Define and differentiate interviewing and interrogation techniques. How far human rights of criminals are being violated during the",
  "interrogation process?\" 2020 -- Q. No. 6: \"Define criminal investigation and its principles. Highlight with",
  "examples the importance of modern techniques used for crime detection in Pakistan.\"  2021 -- Q. No. 6: \"What are the principles and techniques of interrogation? How far these techniques have potential to clear an accused?\"",
  " 2022 -- Q. No. 7: \"What is meant by forensic criminal investigation? What are the hurdles in streamlining the forensic criminal investigation in Pakistan?\"",
  " 2023 -- Q. No. 6: \"Why crime scene is important for investigators? What are the crime scene search patterns?\"",
  " 2024 -- Q. No. 6 (Section-C): \"Enumerate and explain the key principles that guide effective criminal investigations. How do these principles contribute to the",
  "5. Crime Control Agencies, Law Enforcement, and Policing 2016 -- Q. No. 4:* \"Write a note on the role of Crime Control Agencies.\"",
  "2018 -- Q. No. 5: \"Trace back the history and development of police organization in Pakistan.\" 2018 -- Q. No. 8:",
  "\"Intelligence-led policing has become an effective model of policing in tackling organized crime. Discuss the background and key principles of intelligence-led policing.\"",
  "2019 -- Q. No. 9: \"How do violent crimes affect social fabric of Pakistani society? Discuss some of the modern policing strategies for prevention and",
  "control of the violent crimes in Pakistan.\" 2020 -- Q. No. 7: \"The International Criminal Police Organization -- ICPO, INTERPOL was",
  "founded in 1914 with the founding principle to coordinate efforts relating to international police cooperation. How do you see the role of INTERPOL for reducing money laundering with special reference to Pakistan?\"",
  "2021 -- Q. No. 7: \"What is the difference between EUROPOL and INTERPOL? How does EUROPOL assist Member states investigation to control terrorist networks in",
  "Europe?\" 2022 -- Q. No. 5: \"In Pakistan, the creation of police force is a colonial legacy. In which circumstances independent police force was established in the",
  "pre-independence era. What major changes have been occurred in the police department in Pakistan?\" 2023 -- Q. No. 5:",
  "\"What challenges are faced by police in controlling crime and maintaining law and order in the country?\"",
  "2024 -- Q. No. 7 (Section-C): \"Provide an overview of the International Police Association (IPA).",
  "What is its mission, and how does it contribute to international police relations?\" 2016 -- Q. No. 8:",
  "\"Write a detailed note on Cyber Crime.\" 2019 -- Q. No. 8: \"Cybercrime is increasing at national and international levels.",
  "Suggest some measures to control this kind of crime.\" 2020 -- Q. No. 9: \"Keeping in view the social learning perspective in criminology,",
  "discuss how terrorists use internet as a tool to reinforce their ideology among youth in Pakistan.\"  2021 -- Q. No. 9: (a) \"What is Trade-Based Money Laundering (TBML)? Discuss with examples.\" (b) \"Do Cryptocurrencies have a high money laundering risk? Discuss.\"",
  " 2021 -- Q. No. 8 (Section-IV): \"Several specific law enforcement strategies fall within the framework of intelligence-led policing. Discuss any four strategies.\"",
  " 2023 -- Q. No. 8: \"'Terrorism and radicalization continue to pose threat to global peace, economy and stability'. Discuss.\"",
  " 2023 -- Q. No. 9: \"What is the role of FIA in controlling organized criminality in Pakistan?\"",
  " 2024 -- Q. No. 8 (Section-D): \"Define radicalization. What factors contribute to individuals becoming radicalized, and how can societies address these influences?\"",
  " 2024 -- Q. No. 9 (Section-D): \"Discuss the concept of community policing and explain potential",
  "benefits and challenges associated with its implementation in Pakistan. How can these challenges be effectively addresse",
  "7. Probation, Recidivism, and Correctional Strategies 2016 -- Q. No. 5:* \"Define the term Probation and discuss the conditions of Probation.\"",
  "2019 -- Q. No. 5: \"How far recidivism has been limited by the institution of prison? Explain some of the modern strategies used in prison for the",
  "restoration and reintegration of criminals.\" 2020 -- Q. No. 5: \"What is recidivism? What kind of institutional modern strategies",
  "could be used for the reintegration of the criminals in Pakistan?\" 2020 -- Q. No. 8: \"Explain the institutional corrections and alternative community",
  "8. Forensic Science and Crime Detection Techniques 2019 -- Q. No. 7:* \"How the forensic science is a helpful tool in the modern day for",
  "9. Money Laundering, White-Collar, and Related Crimes 2016 -- Q. No. 9:* \"Write short notes on any TWO of the following:",
  "(a) Money laundering (b) White --collar crime (c) Criminal law.\" 2017 -- Q. No. 9: \"Write notes on:",
  "(a) Money-laundering in Pakistan (b) Gender and Crime.\" 2018 -- Q. No. 9: \"Discuss the laws and institutional arrangements for controlling money",
  "\"Describe various procedures and problems of Criminal Courts in Pakistan.\" 2022 -- Q. No. 5 (Section-II):",
  "\"In Pakistan, the creation of police force is a colonial legacy. In which circumstances independent police force was established in the pre-independence era. What major changes have been occurred in the police department in Pakistan?\"",
  "(This question overlaps with law enforcement but also highlights institutional challenges within the criminal justice system.)*",
  "2021 -- Q. No. 7 (Section-III) & 2022 -- Q. No. 6 (Section-III): While primarily focused on investigation, these questions also reflect",
  "on institutional procedures and ethical guidelines. Foundational and Evolving Perspectives: The papers begin with broad questions on the nature, scope, and",
  "theoretical underpinnings of criminology (2016--2018). Over time, more critical and context-specific perspectives emerge---such as the historical development of criminology in Pakistan and theoretical debates (social bonding, differential association, left/right realism).",
  "recurrent. They not only require understanding of causes and remedial measures (2018) but also a critical evaluation of the system's effectiveness (2017, 2019) and the risk/protective factors affecting youth (2020).",
  "Practical Aspects of Criminal Investigation: From basic principles in 2016 to modern techniques in 2020, the",
  "evolution of investigation methods is emphasized. The emphasis on human rights during interrogation (2019) and the use of forensic science (2019) reflects the integration of technological advances with legal safeguards.",
  "organizations (2018) to intelligence-led models (2018) and the role of international agencies like INTERPOL (2020)---shows the expanding scope of crime control strategies.",
  "Cyber Crime and Organized Crime Control: With cybercrime emerging as a significant concern (2016, 2019),",
  "students are required to discuss regulatory and preventive measures, including how terrorists exploit online platforms (2020).",
  "Money Laundering and White-Collar Crime: The recurring short notes on money laundering and related offenses",
  "(2016, 2017, 2018) highlight the need for awareness of financial crimes and the legal frameworks established to control them.",
  "classification of criminal behavior. By 2022 and 2024, broader sociological concepts emerge---such as anomie, labelling theory, and the differentiation between crime, deviance, sin, and vice. This evolution indicates an increasing expectation for critical analysis and integration of multiple criminological perspectives.",
  "of juvenile courts are a constant from 2021 through 2024. The papers progressively demand a more detailed analysis---from definitions and historical context (2022) to evaluation of remedial measures and the role of rehabilitation (2024). This reflects the importance of understanding both preventive and corrective strategies for youth crime.",
  " Advancements in Investigation Techniques: The shift from basic principles of interrogation (2021) to a detailed",
  "discussion on crime scene management (2023) and key investigation principles (2024) highlights the growing integration of modern technology and methodology in crime detection. Students are expected to blend traditional investigative methods with contemporary forensic practices.",
  "historical origins and current challenges (2022--2023) to the role of international bodies like INTERPOL and IPA (2021, 2024). This underscores the significance of global cooperation in addressing transnational crime and terrorism.",
  " Addressing Organized Crime and Radicalization: With repeated queries on money laundering (including trade-based and",
  "crypto-related risks) and terrorism, the papers emphasize the need for robust strategies to counter sophisticated financial crimes and radical ideologies. The inclusion of questions on community policing and FIA's role signals a multi-pronged approach to organized crime control.",
  "institutional hurdles (as seen in 2021 and 2022) reinforces the importance of a well-functioning criminal justice system. These questions require an understanding of both theoretical principles and their practical implementation."
]