[
  "2011 Paper II Q2: \"Why did the Versailles settlement prove to be 'a ceasefire for twenty years'? Analyze.\"",
  "2014 Q5: \"The Treaty of Berlin 1878 marked the end of one epoch and the beginning of a new one in the history of Europe. Discuss.\"",
  "2009 Q2: \"The French Revolution was precipitated by economic factors and the train which had been laid by finances. Comment.\"",
  "2009 Q3: \"'O Liberty! What crimes are committed in thy name.' Comment in light of the Reign of Terror.\"",
  "2014 Q2: \"Examine critically the social and political changes brought about by the French Revolution in France from 1789--1795.\"",
  "2009 MCQ: \"The Declaration of the Rights of Man was prefixed to the French constitution of _______.\"",
  "2012 Q3: \"'If the conquests of Napoleon were ephemeral, his civilian work in France was built upon granite.' Explain.\"",
  "2013 Q2: \"What was the Continental System and why did Napoleon enforce it after 1806? Why did he fail?\"",
  "2009 Q5: \"What part did Mazzini, Cavour, Garibaldi and Victor Emmanuel play in Italian unification?\"",
  "2012 Q6: \"Compare the ideals of Cavour and Bismarck in achieving the unification of their respective countries.\"",
  "2014 Q3: \"Estimate strengths and weaknesses of the Orléanist monarchy under Louis Philippe.\" *(linked to post-1848 France,",
  "2009 MCQ: \"Panslavist ambitions were checked by Congress of Berlin in _________.\" 2011 MCQ: \"Pan-Slavism is: ...\"",
  "2012 Q2: \"What were the similarities and differences in the views of Voltaire, Montesquieu and Rousseau?\"",
  "2011 MCQ: \"The categorization of Left, Center and Right emerged from which political change? (French Revolution 1789)\"",
  "2011 MCQ: \"The greatest milestone in the constitutional development of Britain was: ...\" 2011 MCQ: \"The Industrial Revolution was: ...\"",
  "2011 Q2 (Essay): \"Why did Britain experience an economic revolution without serious political upheaval in the 1800s?\"",
  "2009 Q7: \"Discuss the principles underlying the colonial expansion of European Powers in the later half of the 19th century.\"",
  "2011 Paper II Q2: \"Describe the part played by Italy, Turkey and the USA during the First World War. Why did each become involved?\"",
  "2013 Paper II Q3: \"How successful was the League of Nations as an instrument of collective security?\"",
  "2014 Q3: \"What factors were mainly responsible for the rise of Hitler? What mainly contributed to his downfall?\"",
  "2011 Paper II Q7: \"How did US and Soviet misperceptions lead to the Cold War?\" (reflects WWII alliances)",
  "2011 Paper II MCQ: \"George Kennan articulated the Containment policy in: (a) The X article and the Long Telegram.\"",
  "2020 Q6 (analogous theme): \"Did bipolar Cold War remain more peaceful than pre-WWI multipolar world?\" (context overlap)",
  "- Each year features a 20-question MCQ section (Part I) ensuring rigorous factual recall, followed by Part II with four long essays",
  "- Across all years, essay prompts revisit the French Revolution's causes, social impacts, Reign of Terror, and Napoleon's dual legacy",
  "- Italian and German unifications remain core topics: key figures (Mazzini, Cavour, Garibaldi, Bismarck), ideological comparisons, and",
  "- Enlightenment philosophers (Voltaire, Montesquieu, Rousseau), social contract theory, and the rise of nationalist ideologies",
  "- From Versailles critiques and League of Nations evaluations to fascism's rise and WWII strategy essays, the period 1914--1945 is",
  "- Starting in 2011, Cold War origins (Kennan, containment, bipolarity, NATO/Warsaw Pact) enter the syllabus, marking a shift",
  "- Questions on the European Common Market and UN collective security signal the board's interest in postwar reconstruction and",
  "2015 Q1: \"Explain how the conquest and policy of Napoleon-I influenced the course of European history during the nineteenth",
  "2015 Q2: \"'The Congress of Vienna was a congress of aristocrats... disposing of Europe as if it were their own property.' Critically",
  "2016 Q2: \"The connection between the ideas of French philosophers and the Revolution was indirect and remote...Discuss.\"",
  "2018 Q4: \"How would you argue that lessons cannot be drawn from the European Revolutions of the 1830s and '40s as historical",
  "2017 Q6: \"How did the First World War generate conditions conducive to radical left- and right-wing movements in Europe?\"",
  "2015 Q6: \"Give some account of the new political theories which became prominent in Europe during the later half of the nineteenth",
  "2018 Q7: \"Capitalistic trends promoted the ideologies of secularism and liberalism in twentieth-century Western Europe.",
  "2017 Q4: \"Between Mazzini, Cavour and Garibaldi, who made the most significant contribution to Italian unification?\"",
  "2019 Q4: \"What social movements led to the political consolidation of the Italian peninsula into a single nation?\"",
  "2015 Q3: \"'The Eastern Question entered upon a new and startling phase in 1908.' Discuss this phase from 1908 to 1914.\"",
  "2014 Q2: \"Social and political changes brought about by the French Revolution in France from 1789--1795.\"",
  "2016 Q6: \"Critically evaluate the causes of Allied victory in World War I.\" League of Nations: Organization & Failures",
  "2015 Q2 (Paper I): \"Describe the organization of the League of Nations. Why did it fail to maintain peace?\"",
  "2016 Q7: \"Discuss the general causes of the rise of dictatorship in Europe after the First World War.\"",
  "2015 Q4: \"Analyze the circumstances in which Mussolini came to power and what Italy achieved between 1922--1935.\"",
  "2015 Q5: \"Outline the life and career of Hitler. Why was he appointed German Chancellor in January 1933?\"",
  "2015 Q7 (Paper I): \"Account for the rapid spread of communism in Eastern Europe after WWII. What were its political and economic",
  "2019 Q8: \"Why did the concept of supranational European institutions emerge after WWII?\" 2020 Q8(b): \"Write notes on: (b) NATO.\"",
  "- Every cycle revisits Napoleon's reshaping of Europe and the conservative reaction at Vienna, underscoring their foundational",
  "- The French Revolution, its ideological drivers, and subsequent European revolutions remain central, but prompts shift from \"why",
  "- Italian and German nation-building are examined both through key personalities (Mazzini--Cavour--Garibaldi, Bismarck) and mass",
  "- League of Nations failures, the spread of fascism and Communism, and the rise of dictatorships after WWI receive systematic coverage,",
  "- From 2015 onward, post-1945 topics---communist consolidation in Eastern Europe, the genesis of NATO, and supranational cooperation",
  "- Consistent use of short-note options (Reign of Terror; Kossuth; Hetaireia Philike; Bolshevik Revolution; Cold War; EU; NATO;",
  "2021 Q2: \"Describe Concert of Europe foundational principles. Why did the Concert of Europe decline?\"",
  "2024 Q3: \"Discuss the significance and outcomes of the Congress of Vienna (1814--1815) in shaping the post-Napoleonic order in Europe.\"",
  "2025 Q2: \"Explain the role of the Congress of Vienna in shaping post-Napoleonic Europe and maintaining the balance of power.\"",
  "2021 Q3: \"Describe how Napoleon's military conquests changed both the map and political balance of power in Europe.\"",
  "2022 Q2: \"Critically evaluate the phenomenon of the Napoleonic Regime: 'military dictatorship' or 'victory of a state'?\"",
  "2024 Q2: \"Examine Napoleon's Continental System as a strategic and economic policy ... motivations and its impact.\"",
  "2021 Q5: \"Congress of Vienna inspired nationalist movements ... revolutions of 1830 and 1848. Analyze.\"",
  "2016 Q2: \"Connection between ideas of French philosophers and the Revolution...\" (precedent) 2021 Q5: (see above)",
  "2022 Q4: \"What is the credit side and debit side of the Eastern Question?\" (linked to 1848 Balkan and Ottoman shifts)",
  "2021 Q4: \"Evaluate how Prussia's strengths and Bismarck's skills achieved German unification.\" 2022 Q5: (as above)",
  "2023 Q5: \"'Italy was unified by improvisation rather than calculation.' Analyze.\" 2025 Q4: (as above)",
  "2022 Q7: \"Role of Europe in War on Terror... implications globally.\" (expands Cold War into post-2001 security)",
  "- Across 2021--2025, students repeatedly analyze both Napoleon's continental impact and the Vienna Congress's conservative reaction,",
  "- Section I maintains a 19th-century concentration (Napoleon, Vienna, unifications, revolutions), while Section II shifts to",
  "- German and Italian unifications appear annually, with evolving angles---from Bismarck's realpolitik to improvisational Italian",
  "- From 19th-century Ottoman decline to 1990s Balkan crises and 2022 Ukraine invasion, the \"Eastern Question\" morphs into modern security",
  "- Coverage progresses from Treaty-era transformations and League/EEC origins to EU's foreign service (EEAS) and NATO's Cold",
  "- Recent papers incorporate War on Terror (2022), EU security policy (2025), and Ukraine crisis (2023), indicating an expanding",
  "- Short-note prompts range from classical institutions (EEC, Concert of Europe) to modern questions (German Question, Balkan"
]