[
  "\"Define and discuss the discipline of gender studies and also differentiate between women studies and gender studies.\"* (20)",
  "\"What are the fundamental differences between Gender Studies and Women's Studies? Substantiate your argument(s) with examples.",
  "\"How do you differentiate the discipline of Gender Studies from that of Women Studies? Historically trace the need for the establishment of",
  "Gender Studies as a distinct discipline and its scope and significance with especial reference to Pakistan.\"* (20)",
  "Insight:* This topic appears in three consecutive years. A strong grasp of both conceptual differences and the historical evolution is essential. Be",
  "prepared to discuss definitions, examples, and the status of women studies in Pakistan. Repeated Questions:*",
  "\"What are the sites and forms of violence against women in Pakistan and how in your view this menace can be eliminated from our",
  "\"What are the different forms of gender based violence and, in your opinion, what could be the workable strategies to eliminate gender",
  "\"Explain the structural and direct forms of violence against women in the Pakistani society by highlighting the case study of Mukhtaran",
  "\"Comment on the power and control relationship in gender based violence.\" (20)  Definition and Strategies: 2023, Q8:",
  "\"Define gender based violence. Explain various forms of violence against women in Pakistan and devise some practical strategies which can",
  "be helpful in the eradication of gender based violence from our society.\" (20)  Legal Framework and Consequences: 2024, Q6:",
  "\"What is gender-based violence? What forms of gender-based violence are given in the 'Punjab protection of women against gender-based",
  "\"Powerful forces of globalization have highlighted various gender issues across cultures and throughout the globe. Discuss by quoting",
  "\"In the last two decades, globalization has had a huge impact on the lives of women in developing nations, including Pakistan. What are the",
  "\"Discuss the gendered inequalities created and promoted by the process of globalization in contemporary societies worldwide.\"* (20)",
  "Insight:* Understand both the positive and negative aspects of globalization on gender roles and inequalities. Use concrete examples from developing",
  "\"What are the pros and cons of gender quota in politics? Give your views on the impact of gender quota in politics in Pakistan.\"* (20)",
  "\"Women active political participation could stabilize democracy and boost economic development. Comment on this statement within context",
  "\"Believing in the statement that 'women cover half the sky', do you think we need equal number of women in all spheres of public",
  "\"Women need to be in leadership positions to pull more women into leadership roles. Is this suggestion that women need to 'pull each",
  "other up' a useful one, or is that inappropriate preferential treatment.\" (20)  Political Mainstreaming and Quotas: 2021, Q8:",
  "\"Despite the entry of women legislators into politics on a 17 percent quota in national and provincial assemblies, still there are voices that",
  "'is Pakistan's Gender Quota in parliament showing results?'. Rethink and discuss that how quotas can lead to political mainstreaming of women in Pakistan.\"* (20)",
  "\"According to your opinion, what are the main issues in women as representatives in Pakistan?\"* (20)",
  "\"Is political participation a human right? If so, what are the obstacles faced by women politicians of Pakistan to pursue a career in",
  "politics? What is the impact of political quota system on this?\" (20) Insight: These questions call for a balanced analysis of:",
  "\"Write a comprehensive essay on the 'sex versus gender debate' in feminist philosophy and social sciences, reflecting nature versus",
  "\"'Language is gendered', what does this imply? Explain with examples.\" (20) Insight: A deep understanding of theoretical frameworks is crucial. Focus on:",
  "\"What is feminism? In what way Radical feminism is different from Socialist Feminism?\"* (20) 2018, Q4:",
  "\"What type(s) of feminism can elevate the social-cultural, economic and political status of women in Pakistan?\"* (20)",
  "\"Outline and explain the three major waves of feminist movements in the West. Discuss the influence of these waves on feminist movements",
  "\"Marxist feminism is a philosophical variant of feminism that incorporates and extends Marxist theory... Discuss the development of",
  "Marxist/Socialist feminism and the philosophical stance they hold to discuss gender issues and exploitation.\"* (20)",
  "\"Psychoanalytic feminism is a theory of oppression, which asserts that men have an inherent psychological need to subjugate women. As",
  "elaborated, give a detailed analysis of the gender oppression and women's subordination promulgated by Psychoanalytic Feminism.\"* (20)",
  "\"Write a note on the status of women's studies in Pakistan and give your views on the autonomy/integration debate in Women's Studies.\"*",
  "\"Write a note on women's movement in Pakistan. What are its strength and weaknesses?\"* (20) 2017, Q5:",
  "\"What is the status of women's health in Pakistan? How it could be improved within the available economic resources?\"* (20)",
  "\"Critically analyze the various approaches to women's development focusing on Women in Development (WID), Women and Development (WAD)",
  "and Gender and Development (GAD).\" (20) Insight: Examine both the academic field (women's studies) and the practical",
  "aspects of women's movements and health. The autonomy versus integration debate also appears as an important conceptual discussion.",
  "\"Critically review the Gender and Development Approaches on the following: (i) Women in Development (WID), (ii) Women and Development",
  "\"Discuss in detail what the autonomy and integration debate in gender studies have important contribution for the development of the",
  "\"Write a note on status of gender studies in Pakistan. Give your views on the autonomy verses integration debate in gender studies.\"*",
  "(20) Insight:* Prepare to explain how the debate influences the evolution of the discipline, its methodological implications, and its impact on knowledge",
  "\"Masculinity and femininity are the deeply engraved realities since distant past in human history. Discuss various theoretical debates on",
  "the construction of masculinity and femininity to make it explicit that the formation of both is either natural or social reality. Support your arguments with real life examples.\"* (20)",
  "\"Define the terms masculinity and femininity. In your opinion where do traditional gender roles come from?\"* (20)",
  "Insight:* Focus on contrasting natural versus social construction arguments, and use real-life examples to illustrate how traditional gender roles have",
  "\"Modernization Theory blames internal cultural factors for women's subordination in the developing world. Discuss and elaborate the given",
  "\"Give a critical gender analysis of development theories.\" (20) Insight: Examine how modernization theory is critiqued for its cultural",
  "determinism. Develop a balanced view on how development policies impact gender relations, especially in Pakistan.",
  "\"Discuss in detail the multidisciplinary nature of gender studies.\" (20) Gender vs. Women's Studies: 2023, Q3:",
  "\"Differentiate between gender studies and women's studies. Discuss in detail the multidisciplinary nature of gender studies.\"* (20)",
  "Insight:* Be clear on how different disciplines (sociology, history, cultural studies, etc.) converge in gender studies and how gender studies differ",
  "\"Describe any two Western Schools of thought about Feminism in detail.\" (20) Feminist Waves: 2022, Q4:",
  "\"Outline and explain the three major waves of feminist movements in the West. Discuss the influence of these waves on feminist movements",
  "distinctions between the waves and how these global trends have influenced feminist activism in Pakistan.",
  "\"Write a detailed note on the colonial and capitalistic perspectives of gender.\" (20) 2024, Q3:",
  "\"Write a note on the colonial and capitalistic perspectives of gender. Throw light on the thesis that development is the new name of",
  "coloniality in context with the emerging perspectives of gender.\" (20) Insight: Examine how colonial legacies and capitalist structures shape gender",
  "\"Discuss in detail Gender Critiqued of Structural Adjustment Policies (SAPs).\" (20) Insight: Focus on the gendered impact of economic reforms and how SAPs affect",
  "social structures, particularly regarding women's economic empowerment. Women's Health in a Social Context: 2024, Q2:*",
  "\"An Egyptian doctor Mahmoud Fathalla uses the term 'maternity death road' while discussing issues of women's maternal health. Discuss",
  "\"Elucidate the current health status of women in Pakistan. What measures could be taken to improve the women's status as a whole?",
  "Support your arguments with suitable examples.\" (20) Insight: Discuss maternal health and broader women's health challenges in",
  "\"Write in detail the impact of Western Feminist Movements on the feminist movement in Pakistan. Compare the Pakistani feminist",
  "movements from past with the emerging trends of feminist activism and their effects.\" (20) Insight:",
  "Analyze how global feminist ideas have been adapted locally. Contrast historical Pakistani feminist movements with recent trends in feminist activism.",
  "\"Write short notes on the following: (a) Is 'Sex' also a social construct? (b) Radical Feminism\"* (10 each)",
  "Insight:* Prepare succinct definitions and analyses on core feminist concepts. Emphasize the debate around the social construction of sex and key",
  "Understand and be able to critically discuss the debates on autonomy vs. integration and the theoretical construction of",
  "Stay informed on contemporary issues in women's health and political participation, and review the evolution of feminist",
  "\"How the colonial era influenced the status of women in subcontinent?\"* (20) → Insight: Recognize the long-term impact of colonial legacies on",
  "\"Women's participation in labor force has increased recently yet women continue to perform their reproductive roles. Discuss the",
  "challenges encountered by women as a result of their paid employment worldwide with especial reference to Pakistan.\"* (20) → Insight: Analyze the dual burden and its socio-economic implications.",
  "\"For realizing, in letter and spirit, the ideals of a democratic welfare state... Critically evaluate the statement with special",
  "reference to Pakistan.\"* (20) → Insight: Link gender issues with broader human rights and governance frameworks.",
  "\"Discuss the background of the two Oscar winning documentaries by Sharmeen Obiod.\"* (20) → Insight: Understand how media contributes to the discourse on"
]