[
  "1. Bureaucracy, Accountability & Institutional Reform Focus: Questions under this theme examine the role of bureaucracy in",
  "governance, its colonial legacy, accountability mechanisms, and reforms. They often probe the interaction between the bureaucracy and other branches (legislative/judicial) and discuss the need for restructuring to improve public service delivery.",
  "2017, Q7: \"Our bureaucracy is perceived to be the extension of 'Royal Civil Services'. Do you agree? Give reasons. Also elaborate",
  "on: (1) Concept of bureaucracy (Max Weber's view). (2) Reforms in bureaucracy of Pakistan (brief highlights). (3) Major contributions of bureaucracy in providing good governance. (4) Shortfalls/areas of improvement. (B) Comment on the restructuring of civil bureaucracy under devolution during Musharraf's regime.\" (20 marks)",
  "2019, Q4 & Q5: Questions focus on the interaction between legislative/judicial branches and bureaucracy as well as methods to",
  "2020, Q4 (Part-II): \"What are the roles of bureaucracy in the various stages of the public policy process from problem",
  "identification/definition to policy change/termination?\" (20 marks) Insight:* This topic recurs across years (e.g., 2017, 2019, 2020, and implicitly",
  "in later papers) and accounts for a significant portion of the paper. Candidates should be ready to discuss both the historical development and the contemporary challenges of bureaucratic institutions.",
  "Focus:* These questions test the understanding of various theoretical frameworks---from classical public administration to modern theories",
  "like New Public Management, Rational Choice, New Institutionalism, and Public Choice. They also examine the applicability of these models to developing countries like Pakistan.",
  "2018, Q2 & Q3: Questions require definitions of governance, indicators of good governance, and an explanation of Rational Choice",
  "2020, Q5: \"Describe the evolution of the paradigm of governance from the Wilsonian concept of the dichotomy of politics and",
  "2023, Q2: \"Elaborate on: (a) Which governance theories are more applicable to developing countries like Pakistan and how they could be",
  "applied? (b) How would you differentiate between Classical and New Public Administration approach? Relate those with Postmodern Public Administration.\"",
  "2024, Part-II, Q2: \"Identify and explain three dominant governance paradigms (waves of reforms) in the study and practice of public",
  "administration and management.\" (20 marks) Insight:* A strong grasp of both theoretical constructs and their practical",
  "implications is essential. Students should link theory with Pakistan's context to answer these questions effectively.",
  "Focus:* These items explore the entire policy cycle---from agenda setting to formulation, implementation, evaluation, and even termination. They may",
  "require candidates to select a policy issue and analyze each stage of the policy process. Examples:*",
  "2016, Q4 & Q5: Questions include distinguishing between policy analysis and advocacy as well as discussing issues in policy formation",
  "2019, Q6: \"Choose a policy issue and examine it in the light of the policy cycle. Be sure to discuss the relevance of each step:",
  "2020, Q8: Focuses on components of policy analysis such as constructing policy alternatives, evaluative criteria, and drawing",
  "2021, Q7: \"How does an issue become part of the public policy agenda? ... Discuss using the Garbage Can Model...\" (20 marks)",
  "Insight:* This theme is tested regularly and is central to the subject. In-depth understanding of the stages of policy development and the factors",
  "4. Public-Private Partnerships, Local Government & Decentralization Focus: Questions in this category address the evolving role of non-state actors",
  "and the importance of decentralization. They examine both the benefits and challenges of partnerships, as well as the comparative analysis of reform models (e.g., Kerala's decentralization).",
  "2018, Q6: \"Local government reforms have been designed and implemented across Pakistan ... Present an overview of the causes of",
  "2022, Q2: \"In developing countries with weak governance and accountability mechanisms, there is no such thing as 'public-private'",
  "2024, Part-II, Q3: Evaluates the necessity, advantages, and hurdles of growing collaborations between the public and private",
  "sectors. Insight:* This area highlights the interplay between government initiatives and market forces. Students should be prepared to critically analyze both",
  "5. Constitutionalism, State Structure & Islamic Perspectives Focus: This theme revolves around the foundational aspects of the Pakistani",
  "state---its constitutional framework, the vision of founding leaders like Quaid-e-Azam, and the role of Islamic values in governance. It often involves discussing rights, obligations, and the balance between state and society.",
  "2017, Q2: \"Elaborate on Quaid-e-Azam Muhammad Ali Jinnah's ideas on: (1) His vision of an Islamic society, (2) the state's constitution",
  "and system of government in Pakistan, and (3) the protection of non-Muslims, their rights and obligations.\"",
  "2017, Q6: Focuses on the ethical and practical relationship between Islam and governance (e.g., the concept of 'Shura').",
  "Insight:* Given Pakistan's unique socio-political context, these questions recur and require candidates to blend historical perspectives with",
  "6. Corruption, Ethical Governance & Good Governance Indicators Focus: Questions under this theme deal with corruption---its impact on",
  "governance, accountability mechanisms, and ethical considerations in public service. They also examine the indicators of good governance and the measures needed to improve transparency and accountability.",
  "2016, Q8: Short notes on the \"stigma of corruption and the decline of good governance in Pakistan.\"",
  "2022, Q4 & Q5: Debate whether combating corruption is necessary if it doesn't hinder economic growth (beyond moral arguments) and discuss",
  "2023, Q7: \"What do you understand by Ethics in politics? How do public policies become instruments of political gains...\" (20 marks)",
  "2024, Part-II, Q6: \"Since corruption undermines good governance, discuss how advancing responsiveness, accountability, and transparency",
  "can serve as a frontal assault against corruption.\" (20 marks) Insight:* The persistent concern with corruption and ethical governance indicates",
  "that candidates are expected to critically assess both the theoretical and practical dimensions of transparency and accountability in Pakistan.",
  "7. Economic Development, Fiscal Discipline & Public Policy Impact Focus: This theme focuses on the intersection of economics and governance.",
  "Questions assess ideas such as economic democracy, pro-poor growth, and the impact of economic policies on different social segments. They also touch upon fiscal discipline and economic growth's role in shaping governance outcomes.",
  "2017, Q3: Discusses \"Economic Democracy through Pro-Poor Growth\" and the modalities for its implementation in Pakistan.",
  "2023, Q5: \"How has incompatible economic growth impacted the middle and poor segments of society? Relate it with governance issues.",
  "What kind of Financial Discipline do you suggest for Pakistan?\" (20 marks) Insight:* Candidates must not only understand the theoretical frameworks but also",
  "be able to critique real-world economic policies and propose strategies that ensure both growth and social equity.",
  "8. Modern Challenges: E-Governance and Outsourcing Focus: In the most recent papers, there is an emerging focus on the role of",
  "technology and outsourcing in public administration. These questions address the challenges and potential strategies for implementing e-governance, as well as the debate over outsourcing as either a necessity or a danger in weak administrative contexts.",
  "2022, Q7: \"Choose one of the following statements and support it with arguments: (a) 'Outsourcing is a necessity when the public",
  "administration is weak.' (b) 'Outsourcing is a danger when the public administration is weak.'\" (20 marks)",
  "2024, Part-II, Q8: \"Evaluate the challenges and obstacles hindering the widespread adoption of e-governance in Pakistan.",
  "As technology reshapes governance, students need to be conversant with both the opportunities and limitations that digital transformation and privatization bring to public administration.",
  "Recurring Themes: The analysis shows that topics related to bureaucratic accountability, governance theories, policy process, and corruption consistently",
  "appear. In many instances, these themes are interlinked with Pakistan's socio-political context, making it crucial for candidates to relate theoretical concepts to local realities.",
  "Integrated Approach: Many questions require a balanced discussion---linking classical theories with contemporary challenges (e.g., the evolution from the",
  "politics--administration dichotomy to current governance practices) and comparing international models (such as Kerala's decentralization) with Pakistan's experience.",
  "Preparation Strategy: Students should develop a deep understanding of both historical perspectives and modern challenges. Being able to critically analyze,",
  "- Questions on public policy definitions, the role of planning and policy process stages appear in every paper (2016, 2018, 2020",
  "Part-II) with 100% frequency in the qualitative part. This demonstrates that a foundational understanding of public policy and its processes remains non‐negotiable.",
  "- Debates on the state's nature, constitutional obligations, and differences between public and private management are examined in",
  "2017 and 2019. Approximately 50--60% of papers address these issues, highlighting ongoing debates about Pakistan's state character.",
  "- Topics such as economic democracy, pro--poor growth strategies, and the impact of economic growth on social groups are consistently",
  "featured (2017, 2019, 2020). This reflects an increasing integration of economic theory with governance challenges.",
  "- In recent years (2021--2023), there is greater emphasis on contrasting governance theories---classical, new, postmodern---and",
  "on analytical benchmarks (Pareto efficiency vs. Kaldor-Hicks). Nearly half the papers in Part-II (2021, 2023) are dedicated to theoretical frameworks, underscoring their importance in shaping policy analysis.",
  "- Questions on bureaucratic reform, accountability mechanisms, and the interaction among branches of government appear regularly (2017,",
  "2019, 2020). About 50--60% of papers include such issues, mirroring the real--world challenges faced by Pakistan.",
  "- The debate on local government reforms, decentralization (with the Kerala model as a benchmark), and the federal structure is",
  "- Questions examining the role of ethics, civil society, and public participation (especially from an Islamic perspective) are common in",
  "2017, 2021, and 2023. This indicates a growing recognition of the normative and ethical dimensions of governance.",
  "- The discussion of corruption, accountability measures, and the role of institutional reform is a recurring motif (2019 and 2022),",
  "emphasizing that while economic growth may sometimes mask corruption's costs, moral and institutional imperatives demand action.",
  "- Nearly 100% of the qualitative papers (2016--2023 Part-II) include topics on public policy definitions, governance theories,",
  "- The quantitative methods component is new and robust in 2024, indicating an emerging trend toward analytical rigor."
]