[
  "History of usa Founding Documents and Constitutional Principles The American Constitution & Checks and Balances",
  "2001: \"The American Constitution is a system of 'Checks and Balances.' Discuss.\" Bill of Rights & Amendments",
  "2001: \"The first Ten Amendments to the Constitution of the U.S., ratified in 1791, are known as: (A) Bill of Constitution (B) Bill of Rights ...\"",
  "2004: \"The Constitution of the United States provides that amendments may be proposed by: (A) Congress (B) The President...\"",
  "Origins of U.S. Government 2001: \"Which one of these enjoys the title of 'Father of the American Constitution'? (A) Jefferson (B) Washington (C) Madison...\"",
  "2005: \"What is the Monroe Doctrine? On what occasions has it been enforced and with what results?\" Presidency Evaluation and Leadership",
  "Abraham Lincoln 2001: \"Evaluate the Presidency of Abraham Lincoln.\" 2003: \"The American Civil War (1860--65) was a clash of economic interests as well as social ideals. Elaborate.\" (related to Lincoln-era tensions)",
  "Thomas Jefferson 2001: \"Thomas Jefferson described his election to the Presidency in 1800 as the 'Second American Revolution.' Was this claim justified? Support your answer with evidence.\"",
  "Andrew Jackson 2002: \"In what ways did the philosophy and purpose of Jacksonian democracy differ from those of the Jeffersonian democrats?\"",
  "2004: \"What are the salient features of Andrew Jackson's Presidency and Democracy?\" Franklin D. Roosevelt",
  "2002: \"Evaluate the Presidency of Franklin D. Roosevelt.\" 2003: \"The NEW DEAL was to save capitalism, but ironically, it was denounced by the Capitalist Class. Why?\"",
  "Woodrow Wilson 2002: \"Discuss 'War against Terror' as an instrument of U.S. foreign policy.\" (note: sometimes tied to Wilson's Fourteen Points)",
  "2004: \"Woodrow Wilson had said: '...We have lost [world leadership]...' Comment upon America's attitude towards the Treaty of Versailles.\"",
  "Other Leaders & Doctrines 2002: \"Write short notes on any TWO of the following: (c) Truman Doctrine...\"",
  "2005: \"Assess the contributions of President Woodrow Wilson to the problem of world peace and security.\"",
  "Slavery and Race Relations Significance of Slavery 2001: \"Critically examine the significance of the issue of Slavery in American history.\"",
  "2003: \"Compare and contrast the views of Charles Sumner, Stephen A. Douglas, Abraham Lincoln towards the institution of slavery.\"",
  "Abolitionism & Civil Rights 2003: \"'I have a dream.' Who delivered this oration?\" (MLK, tied to civil rights movement)",
  "2004: \"After World War II, the dominant focus of U.S. policy had been anti-Communism on a global scale. Discuss.\" (includes domestic civil liberties context)",
  "2005: \"What do you understand by 'Manifest Destiny'? What fruits did it bear in the shape of expansion...?\" (indirectly tied to displacement of indigenous peoples and slavery debates)",
  "Foreign Policy and Diplomacy Monroe Doctrine & Imperialism 2001: \"Monroe Doctrine.\" 2005: \"Account for America's emergence as an imperialist-colonialist power after 1898.\"",
  "Marshall Plan & Cold War 2002: \"Discuss this statement in the light of the Marshall Plan: 'The U.S. would do whatever it is able to do to assist in the return of normal economic health...'\"",
  "2005: \"Highlight the salient aspects of American foreign policy since World War II.\" War on Terror & Modern Policy",
  "2002: \"Discuss, 'War against Terror' as an instrument of U.S. foreign policy.\" Wars and Military Involvement",
  "War of Independence & Early Conflicts 2001: \"The Peace Treaty of American Independence in 1783 was signed in the city of: (A) Philadelphia (B) London (C) Paris...\"",
  "2003: \"The American Revolution was the child of Enlightenment. Comment.\" Civil War 2001: \"Write short notes on: (c) Woodrow Wilson (d) Monroe Doctrine.\" (Civil War context provided separately)",
  "2001: \"The Battle of Bull Run was fought in: (A) The American War of Independence (B) The American Civil War ...\"",
  "2003: \"The American Civil War (1860--65) was a clash of economic interests as well as social ideals. Elaborate.\"",
  "20th-Century Conflicts 2001: \"Evaluate briefly America's political and military involvement in Iraq since the Iran-Iraq War.\"",
  "2002: \"The attack on Pearl Harbor took place in: (A) 1918 (B) 1939 (C) 2005: \"Compare and contrast the views of Charles Sumner, Stephen A.",
  "Douglas, Abraham Lincoln...\" (includes War of 1812 indirect contexts) Social and Economic Movements Progressive Era",
  "2001: \"Discuss the progress of the Progressive Movement in the United States between 1900--1916.\" 2004: \"Write short analytical notes on any TWO: (a) Progressive Movement (b) Watergate Scandal...\"",
  "Populism & Reform 2003: \"Between 1877 and 1900, American society was transformed from agrarian and rural to industrial and urban. What factors...?\"",
  "2003: \"Americans are called 'A Nation of Nations.' Briefly describe the different waves of immigrants... Has America been a 'melting pot' or a 'mixing bowl'?\"",
  "Social Upheaval 2005: \"Some American historians insist that the American Revolution was a social upheaval as well as a political revolt. Discuss the social and economic results...\"",
  "Foundational Dates & Firsts 2001--2005: Questions on Jamestown (1607), Louisiana Purchase, Panama Canal opening, first Secretary of State, etc.",
  "Cultural Icons & Nicknames 2003: \"Louis Armstrong was a: (A) Pianist (B) Drummer (C) Trumpeter...\" 2005: \"Delaware state is nicknamed: (A) Donkey (B) Dog (C) Diamond...\"",
  "- Every session (2001--2005) features at least one major presidency for in-depth critique (Lincoln, Jefferson, Jackson, FDR, Wilson). This",
  "underlines the exam's priority on leadership analysis and policy impact. Foundational Principles vs. Modern Policy",
  "- Early years (2001--2002) focus on the Constitution, Bill of Rights, and 18th--19th-century doctrines (Monroe, Jeffersonian vs. Jacksonian",
  "democracy). By 2003--2005, questions increasingly address 20th-century foreign policy (Marshall Plan, Cold War, War on Terror), reflecting evolving geopolitical concerns.",
  "- 2001 asks for broad significance of slavery, while later papers (2003--2005) demand comparative analyses of key figures' stances and",
  "linkage to social movements, indicating a shift toward critical comparative historiography. Progressive and Reform Movements as a Constant Thread",
  "- The Progressive Movement appears in 2001 and again in 2004, showing sustained interest in early 20th-century reforms. Meanwhile, Populism",
  "and New Deal critiques pop up in 2003, suggesting a continued focus on economic reforms. Post-9/11 & War on Terror Inclusion",
  "- From 2002 onward, the \"War on Terror\" enters essay prompts, and 2001's question on 9/11 marks a clear pivot to contemporary issues. This",
  "trend illustrates the examination board's responsiveness to recent events. Balance of Essay vs. Objective Questions",
  "- Each year's paper combines long-form essays with a compulsory section of multiple-choice factual recall. This structure persists, balancing",
  "- Earlier questions center on colonial America and early Republic; later ones broaden to include immigration waves (\"Nation of Nations\"),",
  "- Over time, the \"short notes\" section evolves from simple definitions (e.g., Missouri Compromise) to more analytical prompts (e.g., Jazz Age,",
  "2009: \"During his first voyage, Columbus accidentally landed at the: (c) Watlings Island in the Bahamas.\"",
  "2009: \"The first permanent and successful English Colony in America, Jamestown Virginia, was founded in the year: (c) 1607.\"",
  "2009: \"Which leader of American Revolution was also a scientist, printer, satirist and political philosopher? (c) Benjamin Franklin.\"",
  "2009: \"How many political parties are mentioned by name in the U.S. Constitution? (e) None of these.\"",
  "2009: \"One of the first two political factions, the Democratic Republicans, was led by: (c) Thomas Jefferson.\"",
  "2009 (Essay): \"What were the major flaws in the Articles of Confederation...? Discuss the salient features of the present",
  "2011: \"Eighteenth Amendment pertained to: ( ) Right to keep and bear arms? Fourteenth Amendment pertained to: (a) Definition of",
  "2009: \"Which American President won four consecutive elections and remained president the longest? (c) Franklin Delano Roosevelt.\"",
  "2011 (Essay): \"Give an estimate of the tenure of Harry S. Truman with particular reference to the Cold War.\"",
  "2009: \"Under which treaty did the U.S. acquire Florida from Spain? (b) Adams-Onís Treaty.\" 2009: \"Alaska was acquired from: (d) Russia.\"",
  "2010: \"Write comprehensively on the American Foreign Policy towards Pakistan in light of 9/11 and War on Terror.\"",
  "2009 (Essay): \"Why England failed to take the initiative in colonization... factors for British interest in establishing",
  "2009 (Essay): \"Discuss factors responsible for the 'sectional divide'... that led to the Civil War.\"",
  "2010: \"What lesson had Americans learnt from the Watergate Scandal?\" *(related to distrust in governance, parallel to civil",
  "2012: \"Write a comprehensive note on the Civil Rights Movement with particular mention of American Women and the Blacks.\"",
  "2011: \"The Americas changed from continents inhabited by mongoloid stock to: (a) The most racially mixed region of the world.\"",
  "- Every paper (2009--2013) retains a compulsory 20-question MCQ section covering exploration, founding dates, key treaties, and",
  "- Part II consistently offers 8 questions: analytical essays on constitutional evolution, sectional conflicts, economic crises, and",
  "- Post-2001 topics like War on Terror, 9/11 policy, and U.S.--Pakistan relations enter the syllabus by 2009--2011,",
  "- From Jefferson and Jackson through Truman, Kennedy, Nixon, and onward, students are repeatedly asked to critique presidencies and",
  "- Questions on civil rights movements, demographic shifts, and social upheavals (e.g., Malcolm X, African slavery origins, women's",
  "- Prompts such as Jacksonian vs. Jeffersonian democracy, Federalist vs. anti-Federalist clash, and evaluation of New Deal or Marshall",
  "- While the overall paper structure remains unchanged---MCQs, four essays, two short notes---the specific themes rotate annually among",
  "exploration, revolution, constitutional law, presidencies, wars, social movements, and foreign policy, ensuring both continuity and variety in assessment.",
  "2014: \"Discuss the conditions that led Massachusetts Bay, Plymouth, Connecticut and New Haven Colonies to form the New England",
  "2014: \"Between the American Civil War and the First World War America transformed. Discuss how a rural republic became an urban",
  "2014: \"The Declaration of Independence 1776 actually shapes the way Americans live their lives. Discuss.\"",
  "2016: \"What economic problems were faced by Ronald Reagan and how his government dealt with economic crisis?\"",
  "2014: \"The U.S. President can quite literally be called the President of world. Examine this statement in the light of late-20th",
  "2014: \"Did the U.S. succeed in its attempt to create a New World Order at the end of the Cold War? Discuss.\"",
  "2015: \"Evaluate the U.S. invasion of Iraq in 2003. How far did American policymakers succeed in achieving their goals?\"",
  "2015: \"Since the Declaration of Independence, Westward expansion was a story of annexations, concessions and purchases. Discuss.\"",
  "2018: \"What is the variance between the Treaties of Paris in 1763 and 1783? Elaborate their significant effect on the US.\"",
  "2015: \"Discuss the trends and causes leading to the expansion of federal government's power in the U.S.\"",
  "2015: \"What are the sources of revenues and funds of government in the U.S.? Is it true to say that Americans pay taxes for civic",
  "2015: \"In what respect did the philosophy and rationale of Jacksonian democracy differ from those of Jeffersonian?\"",
  "2016: \"Discuss in detail the causes and effects of the Great Depression on the people and society of the United States.\"",
  "2012: \"Trace out the grounds of augmentation of the U.S. financial system in the post-WWII epoch.\" (related)",
  "2016: \"What factors led Blacks to start the Civil Rights Movements? Discuss the role of Courts and State in giving rights to",
  "2018: \"Critically trace the African American Struggle for Equality and how many of them rose to the highest office.\"",
  "2018: \"Discuss the factors that have contributed to the amended status of American women with a special allusion to Modern",
  "2014: \"Write concise notes on: Desert Storm, Tammany Hall.\" (City politics and Middle East campaign)",
  "2018: \"Why did American colonists criticize the Stamp Act of 1765? What was the Stamp Act Crisis and its repercussions on U.S.",
  "- From 2014 through 2018, questions on the New England Confederation, Stamp Act, and Treaties of Paris reinforce sustained",
  "- While earlier papers focused heavily on political and military history, 2015--2018 introduce broader governance issues (federal",
  "revenue, Lockean thought) and social questions (women's rights, Muslim perceptions), reflecting a more holistic historiography.",
  "- Nixon and Reagan remain prominent subjects for balanced evaluation, while the \"President of the world\" trope and New World",
  "Order debates highlight students' need to connect U.S. executive power with global events from Gulf War through post-9/11 interventions.",
  "- From civil rights of African Americans to modern feminism and Muslim-American relations, later papers progressively foreground",
  "- The Part II pattern---six essay questions plus two short-note prompts---remains unchanged. However, the substantive coverage",
  "broadens over time to include governance, philosophy, socio-economic, and global-policy topics, ensuring both continuity and curricular growth.",
  "2025 Q1: Comprehensive account of Spanish explorations of the American continent with special reference to the voyages of",
  "2020 Q2: Which branch---Congress, Judiciary, or Executive---is most powerful under U.S. separation of powers and checks and",
  "2022 Q3: Why the Philadelphia Convention, convened to amend the Articles of Confederation, produced a new Constitution.",
  "2022 Q7: Critically examine Harry S. Truman's domestic policy and its improvement (or not) over the New Deal.",
  "2016 Q3: Causes and effects of the Great Depression (cited as context---beyond focus). 2019 Q2: Clinton's economic policies.",
  "2020 Q5: Why Woodrow Wilson failed to secure Senate ratification of the League, despite his Fourteen Points.",
  "2024 Q5: Could the U.S. invasions of Iraq and Afghanistan have been avoided? Arguments and evidence.",
  "- Each year offers ~6--7 in-depth essays and 1--2 short-note prompts, maintaining the long-form plus concise-answer structure.",
  "- Beyond traditional political and military history, recent papers incorporate economic policy (Clinton, Kennan containment), global",
  "strategy (pivot to Asia, NATO expansion), and nuanced social issues (Hispanic Civil War roles, Iroquoian influences).",
  "- From Wilson's League to Cold War bipolarity, to 21st-century NATO and Asia-Pacific strategies, the examination consistently probes the",
  "- Questions in 2019, 2021, 2024, and 2025 revisit the Civil War's causes, social dimensions, and aftermath, underscoring its enduring",
  "- American Revolution psyche (2022), Philadelphia Convention (2022), Manifest Destiny (2025), and \"Go west\" rhetoric (2025)",
  "- Trump-era nationalism (2019), Bush neo-conservatism (2021), and U.S.--India strategic shifts (2021) signal an increasing blending of",
  "- Multiple prompts require students to compare and contrast (Federalists vs. Anti-Federalists, Jeffersonian vs. Jacksonian",
  "democracy), evaluate inevitability (Civil War, U.S. entry into WWII), and critically analyze \"what-ifs\" (avoiding Iraq/Afghanistan interventions).",
  "- Short-note topics have broadened from classic doctrines to include organizational roles (NATO, Korean War), financial",
  "institutions (J.P. Morgan, Truman Doctrine), and cultural-political phenomena (Missionary Diplomacy, Know-Nothing party), demanding both breadth and depth in concise responses."
]