[
  "- \"Define International Relations. Discuss its scope and importance of the study of International Relations.\"",
  "- \"Define Imperialism and discuss the Economic Theories of Imperialism.\" Focuses on both tangible and intangible aspects of national power",
  "- A question that asks: \"Discuss in detail the nature and attributes of national power...\" This reinforces the importance of understanding national power as a",
  "- \"Explain, with examples, the main principles of the NEO-REALIST SCHOOL OF THOUGHT in International Relations. How does Neo-Realism",
  "Establishes a theoretical framework by requiring definitions, key principles, and comparative discussion with Classical Realism.*",
  "- \"Explain, with examples, the main principles of the NEO-LIBERAL SCHOOL OF THOUGHT in International Relations. How does Neo-Liberalism",
  "- \"'Can you imagine a world without Inter‑State Relations'? Explain the importance of International Relations in the Nuclear Age.\"",
  "- \"Discuss the development of the study of 'International Relations' and define its core influential factors in the post‑Cold",
  "Expands on how IR has evolved, incorporating definitions and scope with historical context.* National Power:",
  "Focuses on understanding the tangible and intangible elements that constitute national power.* Comparative Theoretical Analysis:",
  "- \"What are the essential differences between the liberal internationalist and realist theories? In your opinion, why is",
  "Requires a deep understanding of core theoretical approaches.*  Evolution of the IR Discipline: 2018, Part‑II, Q.2:",
  "\"Describe the evolutionary process through which International Relations acquired the status of an academic discipline.\"",
  "Focus: How IR emerged as a distinct field of study.*  Comparative Theoretical Analysis: 2018, Part‑II, Q.3:",
  "\"What are the points of convergence and divergence in Neo‑Realist and Constructivist approaches to the study of state behaviour in contemporary international politics?\"",
  "Focus: Comparing key IR theories in the contemporary context.* 2023, Part‑II, Q.2: \"Discuss the main principles of Constructivism in International",
  "\"Comparatively discuss the modernist IR theories (Realism and Liberalism) with post‑modernist IR theories (Feminism and Constructivism).\"",
  "Focus: Broad comparison across traditional and post‑modern IR theories. <!-- --> Years Featured: 2010, 2012, 2016, 2017",
  "- \"Define Non-Aligned Movement? Make an appraisal of its role and discuss the future of NAM.\" This question is repeatedly used to assess students' understanding",
  "- *\"Define the Politics of Nuclear Proliferation. How far have the super powers been responsible for the proliferation of Nuclear",
  "weapons?\"* This topic reappears (or its themes are echoed) in later questions that discuss nuclear policy and deterrence.",
  "- \"Define the present 'Russian Doctrine' and discuss its impact on Pakistan and India.\" Such questions reflect ongoing attention to regional strategic",
  "- \"What are the main problems in defining 'terrorism'? Also narrate the implications of the 'War on Terrorism' for International Law.\"",
  "Focuses on the conceptual challenges and legal consequences related to terrorism.*  Impact of Nuclearisation:",
  "- \"How does domestic politics influence foreign policy decision making? Explain with reference to Pakistan's policy towards India.\"",
  "- \"Write a critical analysis of the theory of 'Clash of Civilizations'. What are the prospects of a dialogue among",
  "- \"What are the principal challenges and potential opportunities for economic liberalization and democratization in the Muslim world?\"",
  "Addresses regional economic and political transformations in predominantly Muslim countries.*  Terrorism and Legal Implications:",
  "- \"What are the main problems in defining 'terrorism'? Also narrate the implications of the 'War on Terrorism' for International Law.\"",
  "Focuses on the challenges in defining terrorism and its impact on international legal frameworks.*  Nuclearisation and Strategic Stability:",
  "- \"How does domestic politics influence foreign policy decision making? Explain with reference to Pakistan's policy towards India.\"",
  "- \"What are the principal challenges and potential opportunities for economic liberalization and democratization in the Muslim world?\"",
  "- \"Write a critical analysis of the theory of 'Clash of Civilizations'. What are the prospects of a dialogue among",
  "- \"Critically evaluate the strategically competitive dynamics of Pakistan‑India relations in the context of Pakistan's growing ties",
  "A contemporary evaluation of regional power dynamics. Security Concepts and Use of Force: 2018, Part‑II, Q.4:",
  "\"What are the changing dimensions of security and how they vary from the classical concept of international security?\"",
  "\"Describe the concept of Pre‑Emptive Self‑Defence in the context of International Law and critically evaluate the legitimacy of US use of force against Iraq.\"",
  "Focus: Analysis of legal and ethical aspects of pre‑emptive self‑defence.* 2020, Part‑II, Q.3: \"Describe the concept of Pre‑Emptive Self‑Defense in the context of",
  "Note: Similar to 2018 Q.8, reinforcing the importance of this security issue. Economic Liberalism and National Power:",
  "2018, Part‑II, Q.6: \"Explain the concept of Economics Liberalism and relate its core interests with the concept of Neo‑imperialism or creating Economic",
  "Focus: How economic policies can serve as instruments of power.* 2020, Part‑II, Q.5: \"Define the concept of Strategic Culture and highlight the major",
  "Focus: Elements that shape national power and strategic behavior.* 2020, Part‑II, Q.4: \"What do you understand by International Political Economy? How does",
  "- An essay question states: \"Critically evaluate American Foreign Policy towards Afghanistan.\" This question is used to probe students' ability to assess U.S.",
  "- A question asserts: *\"President Bush's invasion of Afghanistan and Iraq, without sound genuine reasons, has made the future of the",
  "Modern Nation-State doubtful. Do you agree? Give reasons for your answer.\"* This challenges students to critique U.S. policy, considering unilateralism and pre-emptive strikes.",
  "- Questions such as \"The author of the book 'The End of History and the Last Man' is: (a) Fukuyama...\" indicate an emphasis on key theoretical",
  "- \"Explain why, despite being a target of terrorism, Pakistan's international allies often publicly express dissatisfaction with",
  "Pakistan's counter terrorism policy and actions. Is this a failure of Pakistani diplomacy or weakness in its policy? Identify the fault and suggest corrective measures.\"",
  "Directly asks for a critical evaluation of U.S. and allied policies.* Economic and Trade Linkages:",
  "- *\"Do you agree that in contemporary International Relations, International Economic and Trade linkages are being used as pressure",
  "tactics in inter-State Relations?\"* This prompt appears again in discussions (2001, 2003) where students analyze the intersection of economic factors and foreign policy.",
  "- \"Explain the Socio‑Economic and Political Compulsions which led to the formation of Regional Blocs.\"",
  "- \"Critically define 'American interests in Afghanistan' and explain its political and strategic failure in the region and its unnecessary",
  "Foreign Policy Evaluation and Contemporary Issues: 2019, Part‑II, Q.5:* \"Discuss the concept of 'Hybrid and Social Media' as a means of modern",
  "\"Critically evaluate the US Indo‑Pacific policy. Do you believe the current US strategies are aimed at containing growing economic super power China?\"",
  "Focus: Contemporary strategic competition in the Asia‑Pacific region.* 2024, Part‑II, Q.2: \"With the evolving situation in Afghanistan, how does China engage",
  "with Pakistan to ensure stability in the region, and what are the shared strategic interests and potential divergences between the two countries in the context of postwithdrawal Afghanistan?\" Focus: Regional security and alliance dynamics.*",
  " Comparative Evaluations: 2018, Part‑II, Q.3: \"What are the points of convergence and divergence in Neo‑Realist and",
  "Constructivist approaches to the study of state behaviour in contemporary international politics?\" Focus: Comparing theoretical frameworks.*",
  "2021, Part‑II, Q.3: \"Comparatively discuss the modernist IR theories (Realism and Liberalism) with post‑modernist IR theories (Feminism and",
  "Focus: Broader comparative analysis including post‑modern perspectives.* 2024, Part‑II, Q.6: \"Compare and contrast Fukuyama's 'End of History' and Huntington's",
  "'Clash of Civilization' in the backdrop of the interpretation of the post‑Cold War era. Which interpretation seems more attractive in explaining international politics in the post‑Cold War era?\"",
  "2020, Part‑II, Q.4: \"What do you understand by International Political Economy? How does it promote economic dependency in the developing states?\"",
  "Focus: The economic dimension of international relations.* 2023, Part‑II, Q.4: \"Discuss the concept of Security in the post‑Cold War era. Explain its",
  "Focus: Integration of security and economic dimensions.* 2023, Part‑II, Q.6: \"Do you think global power structure is passing through transition?",
  "Focus: Contemporary shifts in global power and foreign policy strategy. <!-- --> Years Featured: 2001, 2003",
  "Key Topics: UN and International Law; NATO, SEATO, and Other Regional Groupings UN and International Law:*",
  "- Questions such as evaluating how effective international organizations (e.g., the UN) are in dealing with global issues.",
  "- Topics also include the \"Congress of Vienna\" and other historical treaties as part of the discussion on global governance.",
  "- \"'Development of International Law and Organization are the efforts of all states to make International System less anarchic'.",
  "- (Questions on NATO, SEATO, etc., appear in the MCQ section.)  Analytical Essays: 2014, Q.5:",
  "- \"Do you believe that Diplomacy is the ultimate way to resolve international disputes? What diplomatic means are significant to",
  "- \"Define globalization and its attendant manifestations in global politics. Do you agree with the view that economic globalisation is a",
  "Focus: Factual recall of key international institutions.* 2011, Part‑I, Q.1(xi): (MCQs on NATO, SEATO, and other organizations appear here, testing",
  "institutional knowledge.) 2014, Part‑II, Q.5: \"Do you believe that Diplomacy is the ultimate way to resolve",
  "international disputes? What diplomatic means are significant to realize that goal in general and Pakistan‑India in particular?\"",
  "- Additional questions address treaties such as the INF Treaty, the Congress of Vienna, and the Treaty of Versailles.",
  "- Questions about figures like U Thant, Fidel Castro, and major events such as the Partition. Throughout 2000--2004:",
  "- Multiple factual questions repeatedly test your knowledge on historical milestones (e.g., \"When did the USSR disintegrate?\") and",
  "- Questions on various historical events (e.g., agreements on buffer states, formation of alliances) and figures are prevalent.",
  "- Essays and MCQs continue to test knowledge of key events such as the disintegration of the USSR, the Bretton Woods Conference, and the",
  "- \"Natan yahu is: (a) President of Taiwan, (b) Defence Minister of China, (c) Prime Minister of Israil, (d) None of these.\"",
  "Factual recall of key historical figures and dates.*  Treaties and Conferences: 2011, MCQs, Q.1(xiv):",
  "- \"The Yalta Conference was held in the year: ...\" (implied through similar factual questions)  Essay Questions with Historical Context:",
  "- Essays discuss topics such as \"the Peace of Westphalia as the founding moment of the modern state system\" and \"the impact of World",
  "- Topics include evaluations of diplomatic history and global governance structures, which require familiarity with historical",
  "- \"The nation‑state system is in a flux with an independence referendum in Scotland and another projected for Catalonia in",
  "September 2017. Critically evaluate why the modern nation‑state in Europe faces internal challenges to its sovereignty and territorial integrity.\"",
  "2010, Part‑I, Q.1(iv): \"The cold war between USA and USSR started in: ...\" Focus: Key historical milestones through MCQs.*",
  "Several questions (e.g., on the Munich Agreement, Westphalia, the Concert of Europe) test historical and institutional facts.",
  "2018, Part‑II, Q.7: \"Globalisation is a buzz word of present day International Economic and Social Order; do you agree that it is transforming quickly the",
  "Focus: The impact of globalization on state politics and culture.* 2019, Part‑II, Q.8: \"Pakistan is going to International Monetary Fund (IMF) for its",
  "bailout package to resolve its financial problems... Discuss Pakistan's external debt problems and domestic liabilities to stabilize the country's economic uncertainty.\"",
  "\"Critically evaluate the US Indo‑Pacific policy. Do you believe the current US strategies are aimed at containing growing economic super power China?\"",
  "Focus: Analysis of contemporary strategic policies.* 2022, Part‑II, Q.7: \"Discuss in detail how globalization has affected the concept of",
  "Focus: Security implications of global economic integration.* 2022, Part‑II, Q.8: \"Discuss in detail the new maritime security challenges for the",
  "Focus: Regional security challenges in the maritime domain.* 2023, Part‑II, Q.7: \"Discuss the concept of state sovereignty. What are the major",
  "Focus: Sovereignty debates and non‑interference issues.* 2023, Part‑II, Q.8: \"Does China's rise challenge the global political system? What are",
  "the implications on Balance of Power Politics?\" Focus: Contemporary challenges to global order.* 2024, Part‑II, Q.4:",
  "\"Recent relationship between the US and China seems to be prey to Thucydides's trap. Can America and China escape it? Analyze it...\" Focus: Critical evaluation of US‑China relations.*",
  "2024, Part‑II, Q.8: \"Pakistan and India are nuclear‑armed neighbours. The normalization of the bilateral relationship ... Is sustained peace possible",
  "2001--2004: Increase in analytical and critical questions (e.g., American foreign policy in 2001; President Bush's actions in 2003).",
  " 2006: The focus is on explaining and contrasting major IR theories (Neo-Realism vs. Classical Realism; Neo-Liberalism vs. Classical",
  " 2007--2009: Papers increasingly demand critical evaluation of foreign policies (e.g., U.S. policy, nuclear proliferation) and the",
  "- Q.2: \"Can you imagine a world without Inter‑State Relations? Explain the importance of International Relations in the Nuclear",
  "- 2013, Q.8: \"Explain why, despite being a target of terrorism, Pakistan's international allies often express dissatisfaction with",
  "- Q.2: \"Discuss evolution and development of the discipline of International Relations; define the dominant factors responsible for",
  "- Q.2: \"What are the essential differences between the liberal internationalist and realist theories? ...\"",
  "Frequent comparative questions such as globalization vs. regionalism (2002) and economic versus political pressures (2000,",
  "- Q.6: \"Explain the Socio‑Economic and Political Compulsions which led to the formation of Regional Blocs.\"",
  "- Q.7: \"Critically evaluate the strategically competitive dynamics of Pakistan‑India relations in the context of Pakistan's",
  " Early in 2018, questions (Q.2, Q.3) focus on the evolution of IR as an academic discipline and on comparing foundational IR theories",
  "In 2021 and 2023, comparative questions expand to include broader theoretical debates (modernist vs. post‑modernist approaches,",
  "2020 and 2022 see repeated emphasis on economic liberalism, strategic culture, and international political economy as core",
  "2023 further stresses the impact of globalization and the changing global power structure (Q.4, Q.6, Q.8).",
  "A strong grasp of both security studies and economic theory as applied to foreign policy is essential. Students should be",
  "Factual recall via MCQs remains consistent (e.g., formation dates of UNO, NATO, etc. in 2010, 2011).",
  "2014 and 2020 include analytical essays discussing the role of international organizations and treaties, reflecting on",
  "Memorization of key institutional facts and historical events is critical. Students should also practice linking these facts to",
  "2022 and 2023 place increased emphasis on contemporary issues such as climate change, resource management, and the impact",
  "MCQs and short note questions repeatedly cover the formation and roles of NATO, SEATO, NAM, and the UN.",
  "- Q.5: \"Do you believe that Diplomacy is the ultimate way to resolve international disputes? What diplomatic means are",
  "Factual MCQs on events like the Yalta Conference, Cuban Missile Crisis, and key treaties appear in every paper from 2000--2004.",
  "Build a robust timeline of major historical events and understand their long-term impact on international relations.",
  "- Q.4: \"The nation‑state system is in a flux with an independence referendum in Scotland... Critically evaluate...\"",
  "Essays in 2007--2009 focus on evaluating specific policies, such as American foreign policy (2001, 2003) and the impact of nuclear",
  "Stay updated on current international affairs and be prepared to link historical theories with modern geopolitical events",
  "a. Foundational Concepts in International Relations Repeated Questions: 2000, Q.1:* Definition and scope of IR.",
  " 2017, Q.2: \"What are the essential differences between the liberal internationalist and realist theories?...\"",
  "2018, Q.6; 2020, Q.4 & Q.5; 2022, Q.5: Discussion on economic liberalism, strategic culture, and the role of economic dependency.",
  "b. Foreign Policy Doctrines and Regional Movements Repeated Questions: 2000, Q.4:* Definition and appraisal of NAM.",
  "2000, Q.7: Definition and impact of Russian doctrine.  2006, Q.3: Challenges in defining terrorism and the \"War on",
  "Terrorism.\"  2006, Q.4: Impact of India--Pakistan nuclearisation.  2006, Q.5: Influence of domestic politics on foreign policy.",
  " 2006, Q.7: Opportunities and challenges for economic liberalization in the Muslim  2017, Q.7: \"Critically evaluate the",
  " 2010, Q.6: \"Explain the Socio‑Economic and Political Compulsions which led to the formation of Regional Blocs.\"",
  "2003, Q (Essay): Analyze President Bush's invasion and its implications.  2001, Q. (Essay) and 2003, Q. (Essay): Critical evaluation of",
  " 2013, Q.8: \"Explain why, despite being a target of terrorism, Pakistan's international allies often express dissatisfaction...\"",
  "Formation and role of NATO, SEATO, and OIC as seen in MCQs (e.g., 2000 MCQs on NATO, SEATO, NAM) and essays on international law.",
  "- Question: \"NATO was formed in: (a) 1948, (b) 1949, (c) 1950, (d) None of these.\" This question is repeatedly used to test the candidate's knowledge of",
  "- In various short-note and essay questions (e.g., 2002, Short Notes: topics include \"International Law\" and its regulatory role)",
  "the effectiveness of the UN and its charter are examined.  Later Analytical Discussions (2007--2009):",
  "These years continue to integrate the factual recall of international organizations into broader analytical questions. For example: - 2007, Q.8 (Compulsory MCQ Section):",
  "Questions about the formation and functions of organizations like NATO, SEATO, and NAM reinforce the foundational knowledge required for more complex discussions. - 2008--2009 Essays:",
  "Questions such as \"Explain how effective international organizations (e.g., the UN) are in dealing with global issues\" require students to evaluate the role and impact of these organizations on global governance.",
  "- 2008, Q.1 (Items vii--x): Questions on UN Secretary General, etc. -- 2009, Q.1 (Item xiv): \"German reunification occurred in:",
  " 2014, Q.5: \"Do you believe that Diplomacy is the ultimate way to resolve international disputes?...\"",
  " 2007, Q.8 (Item 1): \"The Great Britain and Russia agreed to make Afghanistan a buffer state in: ...\"",
  " Essays (2007--2009): Often require discussion of historical treaties (e.g., INF Treaty) and events such as the disintegration of",
  "- 2010, Q.1 (i)--(xviii): Factual questions on UNO, Cold War, NPT, Cuban Missile Crisis, NATO, etc.",
  "Build a strong theoretical base on national power, imperialism, and foreign policy doctrines. Develop Critical Analysis Skills:",
  "Practice writing essays that critically evaluate foreign policies using historical examples (e.g., American policy toward",
  "Create timelines and flashcards for key events (Yalta, Cuban Missile Crisis, treaties) and figures (U Thant, Fidel Castro,"
]