[
  "Below are the recurring themes and questions across the years, along with their frequency and specific mentions:",
  "2001: \"Define Tawheed in a scholarly manner, describing its significance and effects on human life.\"",
  "2004: \"Explain the belief of Tawheed in a scholarly manner describing its effects on human life.\"",
  "2001: \"What is the concept of 'Khilafat' in Islam?\" Frequency: Repeated in 2000 and 2001.",
  "2004: \"Describe the four basic sources of Islamic Law. Explain Ijma and Ijtihad specifically.\" Frequency: Repeated in 2001 and 2004.",
  "2001: \"Explain the significance of Jihad in the light of Quran and Sunnah, its kinds, principles, and conditions.\"",
  "2004: \"Elaborate on women's rights in Islam, comparing with other religions.\" Frequency: Repeated in 2000 and 2004.",
  "2004: \"What is the role and objective of Muslim Ummah? How can it contribute to solving global problems?\"",
  "Below are the recurring themes and questions across the years, along with their frequency and specific mentions:",
  "2009: \"Islamic vs. Western civilization strategies.\" Frequency: Repeated in 2005--2009. 2005: \"Sharai position on suicide attacks.\"",
  "Prepare structured answers for recurring topics like Ijtihad, Muslim Ummah, and women's rights. Below are the recurring themes and questions across the years, along",
  "2013: \"Define Tawheed in a scholarly manner, describing its significance and effects on human life.\"",
  "Topics: Quranic facts (e.g., Surah names, Zakat rules), historical events (e.g., Hijra dates), key figures (e.g., Sahaba).",
  "2018: Zakat system and its spiritual, moral, and social impacts. Salah: 2016: Categories and impacts of prayer.",
  "Hajj: 2019: Hajj system and its impacts. Military Strategy: 2016: Military strategies in the Sirah.",
  "2018: Prophet as the \"prophet of peace and safety.\" Khilafat-i-Rashida: 2016: Governance under pious Caliphs.",
  "2017: Election of Rightly-guided Caliphs and democratic aspects. Civil Servants: 2016, 2018: Responsibilities of civil servants.",
  "2018: Motives of terrorism. 2019: Extremism as a challenge to Islam. Muslim Ummah: 2015: Revival of Muslim Ummah.",
  "2017, 2018: Concept and impacts. Moral Values: 2019: Islamic moral value system. Islamic vs Western Thought:",
  "2015: Individuality trends. 2019: Moral values vs Western ideology. Jihad vs Fasād: 2015: Practical application of Jihad today.",
  "Repeated focus on economic stability (2015, 2017, 2018). Family System: 2015: Role in societal stability.",
  "Focus on Application: Questions often link classical Islamic concepts (e.g., Zakat, Jihad) to modern societal issues (e.g.,",
  "Role of Quran and Sunnah: Solutions to problems must be rooted in Quranic teachings and Prophetic traditions.",
  "Repeat Topics: Zakat, governance, Prophet's leadership, extremism, and women's rights are tested almost every year.",
  "Candidates should prioritize these themes, using Quranic verses, Hadith, and historical examples (e.g., Khilafat-i-Rashida) to structure answers.",
  "2018, 2020 (Islamic financial system), 2022 (principles of Islamic economics). Civil Servants: Inheritance and Rights:",
  "Pillars of Islam (Zakat, Hajj), Prophet's leadership, governance under Caliphs, and women's rights appear almost annually.",
  "The Charter of Madina, Ghazwat (battles), and treaties (Hudaybiyya) are tested every 2--3 years. Candidates should prioritize:*"
]