[
  "2002 Q3: Rule of Res Sub Judice (pending adjudication). 2004 Q1: Universal application of Res Judicata.",
  "2005 Q3: Distinction between Res Judicata and Res Sub Judice. 2003 Q1: Doctrine of Restitution. 2005 Q1: Rules for pleadings.",
  "2001 Q3: Representative suits. 2004 Q2: Decree execution challenges. Key Patterns: 2001 Q4*: Define and distinguish.",
  "2001 Q5: Undue influence (e.g., parda-nashin ladies). Key Patterns: 2001 Q8*: Onus of proof in negligence.",
  "2004 Q7: Defenses in tort (e.g., statutory authority). 2001 Q9: Libel vs. Slander. 2005 Q19: Written vs. spoken defamation.",
  "2003 Q8: Vicarious liability. 2004 Q18: Employer liability for contractors. Key Patterns: 2001 Q3*: Mens Rea in criminal liability.",
  "2005 Q3: General exceptions (e.g., self-defense). 2001 Q2: Culpable homicide vs. murder. 2002 Q8: Qisas and Diyat.",
  "2005 Q2: Injury and robbery definitions. Key Patterns: 2002 Q4: Differences. 2005 Q5*: FIR and retracted confession.",
  "2002 Q6: Bail in bailable/non-bailable cases. 2005 Q4: Arrest without warrant. Key Patterns: 2001 Q7*: Oral vs. documentary evidence.",
  "2002 Q7: Hearsay and primary/secondary evidence. 2005 Q9: Competent witnesses and estoppel. 2004 Q3: Shahada ala al Shahada.",
  "Exam Strategy:Focus on distinctions (e.g., Res Judicata vs. Res Sub Judice) and procedural nuances (appeals, evidence).",
  "\"Explain the grounds for appeal to the High Court from a subordinate court's decree.\" (2009, 2010)",
  "2013: In-depth analysis of CPC inherent powers (Section 151) and Contract Act fraud. The exams consistently test core legal principles with a mix of MCQs",
  "and essay questions requiring case law references and distinctions between concepts. Key areas to prioritize:",
  "2015: \"Does a husband's suicide threat amount to coercion?\" Essentials of a Valid Contract (2015, 2016):",
  "2015: \"Essentials of a valid contract.\" Ratification and Novation (2015, 2017): 2015: \"Conditions necessary for ratification.\"",
  "2015: \"Essentials of negligence with case laws.\" Defenses in Tort (2014, 2015): 2014: \"Contributory negligence.\"",
  "2016: \"Legal status of an accomplice's evidence.\" Dying Declaration (2014, 2015): 2014: \"Write a note on dying declaration.\"",
  "2014: \"Distinguish between discharge and acquittal.\" Repeating Topics: Right of Private Defence* (2014, 2016, 2017):",
  "2018: \"Enforcement procedure of arbitral awards.\" Arbitrator's Powers (2016, 2018): 2016: \"Powers to remove an arbitrator.\"",
  "Candidates should prioritize procedural codes (CPC/CrPC), PPC's private defence, and evidence law (QSO) for guaranteed marks.",
  "Arbitration questions appear every 1--2 years, with a focus on practical applications (e.g., removal of arbitrators).",
  "Criminal Law frequently asks for differentiation between similar offences (e.g., theft vs. robbery, qatl types)."
]