[
  "Over the five years examined, the papers consistently cover core areas of mercantile law. Key topics include:",
  "Sale of Goods & Related Issues: Remedies for breach, delayed delivery, and acceptance/rejection of goods.",
  "The pattern suggests that while the foundational topics remain constant, the questions sometimes vary in scenario details or depth, evolving from",
  "straightforward definitions or discussions (as seen in 2001) to more complex fact patterns and application problems in later years.",
  "2001: \"Discuss the importance of free consent in contracts. When do you think consent is said to be 'not free,' and what effect will",
  "Trend: This fundamental topic appears at the beginning to test understanding of essential contract principles.",
  "2002 & 2005: Questions on delayed delivery, termination of contracts (e.g., computer sale and modem delivery cases), and",
  "Trend: Increasing complexity by introducing factual disputes that require the student to weigh practical remedies against",
  "Trend: Fact-based scenarios require students to analyze the impact of mistakes and misstatements on contract validity and",
  "2002: Disputes arising when a partner retires and subsequent transactions (e.g., a purchase order signed by a retiring partner).",
  "2005: Complex scenarios involving partnerships with joint liability, wrongful acts by partners/employees, and tort claims.",
  "Formation and Internal Relations: 2011, Q.7:* \"Write a comprehensive note on the relations of partners to one",
  "another.\" 2013, Q.5: \"Define partnership deed and describe its contents.\" 2015, Q.4: \"How a firm is registered? What is the effect of non-registration of a",
  "firm?\" 2013, Q.7 (a): \"Write comprehensive note on: Implied authority of partner as agent of the firm.\"",
  "016 -- Q. No.3: \"What do you understand by partnership? Elaborate the points of difference between partnership and company.\"",
  "2016 -- Q. No.5: \"What do you understand by implied authority of a partner as an agent of the firm? Are there any acts which he cannot do under his implied",
  "authority?\" 2017 -- Q. No.4: \"Describe the features of partnership and the legal status of a minor",
  "partner in a partnership?\" 2017 -- Q. No.5: \"Discuss the creation and legal effects of agency relationship in",
  "law?\" 2019 -- Q. No.4: \"What do you mean by implied authority of partner? What are the limitations on authority of partner?\"",
  "2020 -- Q. No.6: \"Partnership is a relation between the persons who have agreed to share the profits of a business carried on by all or someone acting on",
  "behalf of others. In view of this statement explain as to what are the ingredients of a partnership? What is the test required to determine the existence of a partnership?\"",
  " 2021 -- Q. No. 4: \"What are the mutual rights and liabilities of partners towards each other and the firm?\"",
  " 2022 -- Q. No. 4: \"Discuss different types of partnership? What are the different modes of determining the existence of a partnership?\"",
  " 2024 -- Q. No. 5: \"Discuss the basic legal features of partnership agreement and rights of partner by estoppel in the light of Partnership Act.\"",
  "- Trend: The focus shifts from definition to practical issues of liability, expulsion, and dissolution, reflecting the importance of",
  "understanding both the formation and the risks inherent in partnership business. Incorporation and Corporate Structure:",
  "2001: Multiple-choice questions on the Companies Ordinance, maximum members in a private company, and statutory meetings.",
  "2002: A question comparing a limited company with a partnership (advantages regarding finance and liability).",
  "Constitutional Documents & Corporate Governance: 2009, Q.6 (Part II):* \"What statutory restrictions are imposed on the alteration of articles",
  "of association of a company?\" 2010, Q.2: \"What is the difference between Memorandum and Articles of Association",
  "of a Company? Is it essential to register the Articles...? What is the alternative if these are not registered?\"",
  "2011, Part I MCQs (vi, vii, ix): Questions on the minimum number of members for private and public",
  "companies and eligibility criteria for directors. 2012, Q.7: \"Discuss the significance of 'Resolutions' in regulating the affairs",
  "of a company. Explain what is meant by the doctrine of ultra vires a company?\" 2013, Part I MCQs (1--4):",
  "Questions on jurisdiction in company matters, alteration in Articles of Association, and special audit thresholds.",
  "2014, Q.3: \"What are the qualifications, powers and liabilities of the director of a public limited company? In what circumstances does his office",
  "\"Describe the legal rules and limitations for altering the memorandum and articles of association of a company?\"",
  " 2018 -- Q. No.2: \"What do you know about the issuance of prospectus of a company? What matters are to be stated in it and what is the civil and criminal",
  "liability for mis-statement in prospectus?\"  2018 -- Q. No.3: \"Elaborate the conditions and procedures for the registration of",
  "mortgages and charges under company law.\"  2018 -- Q. No.4: \"What do you know about the meetings and proceedings of company?",
  "Explain in detail.\"  2019 -- Q. No.6: \"What do you understand by fixed and floating charges with reference",
  "to company law? Draw a distinction between the two types.\"  2019 -- Q. No.7: \"What changes have been brought about in the rules of the memorandum",
  "of association of a company by the new law of 2017?\"  2020 -- Q. No.5: \"Companies hold various kinds of meetings to regulate their business.",
  "liability, and the interpretation of constitutional documents (memorandum/articles).  2021 -- Q. No. 5: \"What process is to be adopted for transfer of shares and other securities? What remedy is available with the aggrieved in case of refusal by the board of directors for registration of transfer?\"",
  " 2022 -- Q. No. 8: \"Discuss different types of companies? How a company is wound-up?\"  2023 -- Q. No. 3: \"What ideology lays behind the registration of 'Memorandum of Association' and 'Articles of Association' as distinctive documents? How do they differ from each other?\"",
  " 2024 -- Q. No. 1: \"Describe the relationship if any, between Separate Legal Personality and Limited Liability of corporate form of business.\"",
  " 2024 -- Q. No. 2: \"What is meant by charge? Explain the legal nature and significance of floating charge in company law.\"",
  " 2024 -- Q. No. 3: \"In the presence of majority rule how well the minority shareholders are protected in the Companies Act 2017?\"",
  " 2024 -- Q. No. 7: \"Write notes on any two of the following: Basic Concepts & Negotiation:",
  "2001: \"What do you understand by the words, 'negotiation' and 'negotiable'? There are special rules of evidence relating to",
  "negotiable instruments. What are they?\" 2009, Part I MCQs (xi--xviii): Questions on grace periods for promissory notes, cheque maturity",
  "adjustments, and roles of parties. 2010, Part I MCQs (i--xviii): Questions comparing promissory notes, bills of exchange, and details",
  "of acceptance and discrepancy between figures and words. 2011, Q.3: \"What are the modes in which maker, acceptor or endorser of a",
  "negotiable instrument is discharged?\" 2014, Q.4: \"What are the rules of evidence relating to a negotiable instrument?\"",
  "2015, Q.3: \"Explain the provisions pertaining to the notice of dishonour of a negotiable instrument.\"",
  " 2017 -- Q. No.6: \"Distinguish negotiable instruments by statute and explain the liability of parties to these instruments?\"",
  " 2018 -- Q. No.7: \"Define negotiable instrument and also explain the special rules of evidence under the Negotiable Instrument Act, 1881.\"",
  " 2019 -- Q. No.5: \"Why does the State Bank of Pakistan Act, 1956 maintain that only State Bank can lawfully issue bearer notes and bills of exchange payable on",
  "demand? What does this tell you about the nature of the paper currency that we use?\"  2021 -- Q. No. 7: \"What presumptions of law, as a special rule of evidence, are attached with respect to negotiable instruments of consideration?\"",
  " 2024 -- Q. No. 6: \"Explain the meaning and legal function of negotiable instruments in the light of the Negotiable Instruments Act, 1881.\"",
  "Trend:* This topic recurs in the multiple-choice sections throughout the years, with repeated testing of the principles governing bills of",
  "2001: Introduction with a question on the nature of arbitration, the appointment of arbitrators, and their powers.",
  "2005: A dispute scenario where one partner seeks to remove an arbitrator based on bribery allegations.",
  "Appointment, Powers, and Misconduct: 2009, Q.8 (Part II):* \"(a) In what cases may a party to the arbitration agreement appoint",
  "his own arbitrator to act as sole arbitrator? (b) Define terms such as drawee, payee, accommodation bills...\"",
  "2010, Q.8 (MCQs, part of Part I): Various questions on arbitration including the timing of awards.",
  "2014, Q.2: \"What is misconduct? What remedy is open to the litigating party against whom an appointed arbitrator or umpire commits misconduct?",
  "Discuss.\" 2015, Q.6: \"What are the different powers of an arbitrator under the Arbitration Act, 1940? What are the circumstances under which a court can remove",
  "an arbitrator?\"  2017 -- Q. No.8: \"In presence of an arbitration agreement discuss the legal aspects of",
  "the power of the judicial authority to stay legal proceedings under the Arbitration Act 1940?\"  2018 -- Q. No.6: \"Define arbitration agreement and elaborate what are the powers of court in appointing and removing arbitrator(s) as well as to modify and remit the award?\"",
  " 2020 -- Q. No.7: \"What is an 'Award'? Describe fully the grounds for setting aside an award. Does a court have the power to set aside an award suo motu?\"",
  "Trend: Questions evolve from basic definitions and procedures to addressing practical enforcement issues and challenges in",
  "arbitration.  2021 -- Q. No. 6: \"Who is an arbitrator? Write down in detail the comparison between section 8 and 9 of the Arbitration Act, 1940?\"",
  " 2023 -- Q. No. 4: \"Discuss the powers of Court, as far as they are related to the modification and rescission of award granted by the arbitrator, under The Arbitration Act, 1940.\"",
  "(Also listed under Company Law)* -- Focus on the process for transfer of shares and remedies for refusal of transfer by the board.",
  " (This theme overlaps with corporate governance; refer to Theme 3 above.) Authority and Validity of Agent Actions:",
  "2005: Scenarios involving agents acting on behalf of publishers or in commercial transactions where the agent's authority (or lack",
  "2001: A question on explaining the nature of a contract of insurance, particularly distinguishing life insurance from other",
  "2004: A scenario asking whether an insurer is liable when a policyholder commits suicide or when a divorce occurs before a",
  "Trend: Although fewer in number, insurance-related questions test both doctrinal understanding and the application of nuanced",
  "2002 & 2005: Questions on delayed deliveries and whether a buyer is justified in rejecting goods (e.g., computers and modems).",
  "2019 -- Q. No.3: \"What do you understand by the rule 'caveat emptor'? Are there any exceptions to this rule? Does this rule apply in Pakistan today?\"",
  "realistic scenarios. 2022 -- Q. No. 3: \"Who is an unpaid seller? What are the rights of an unpaid seller",
  "against the goods?\" 2023 -- Q. No. 2: \"Who is an Unpaid Seller? What are his rights against the Goods, as",
  "provided by the Sale of Goods Act 1930?\" Title, Conditions, and Remedies: 2009, Q.7 (Part II):*",
  "\"What remedies are available to a buyer when the seller delivers him goods less and/or more than the quantity contracted? A purchased a pole... while driving it broke causing injury. Is any remedy available?\"",
  "2012, Q.5: \"Explain 'Sale by Auction'. When does title of goods pass from the seller to a buyer in an auction sale?\"",
  "2013, Q.4: \"Distinguish between condition and warranty. Suppose Mr. Imran... his bottle explodes; can he claim damages?\"",
  "2015, Q.5: \"When does the property in the goods stand transferred from the seller to the buyer?\"",
  " Free Consent & Coercion: 2009, Q.3 (a & b): \"When will consent of a party to a contract be deemed to have been",
  "caused by coercion? Whether threat to commit suicide by husband will amount to coercion against wife?\"",
  "2011, Q.4: \"How will you distinguish a mistake of fact from a mistake of law? Discuss their legal effect on contract.\"",
  "2015, Q.7: \"When consent is said to be free?\" <!-- --> 2013, Q.2: \"Discuss the methods for discharge of contract and clarify discharge",
  "by operation of law and discharge by agreement with examples.\" 2012, Q.3: \"Discuss the circumstances under which a contract is discharged.\"",
  "2016 -- Q. No.4: \"Define Contract. Explain the contracts which need not to be performed.\" 2018 -- Q. No.5:",
  "\"What is the difference between contract and agreement? Explain in detail the performance of reciprocal promises.\"",
  "2019 -- Q. No.2: \"Explain the term consideration and state the exceptions to the rule: 'No consideration, no contract'?\"",
  "2020 -- Q. No.3: \"How will one differentiate between a void agreement and an unlawful agreement? Explain the agreements which have been expressly declared",
  "as void.\" 2020 -- Q. No.4: \"What are 'Conditions and Warranties'? Differentiate between the two",
  "and explain the 'Implied Conditions' in a Contract of Sale.\"  2021 -- Q. No. 2: \"All contracts are agreements but all agreements are not contracts. Discuss with reference to the essentials of a valid contract.\"",
  " 2022 -- Q. No. 2: \"Classify and discuss contracts into the following four categories: According to Enforceability, According to Formation, According to Performance, According to Parties. Explain with examples.\"",
  " 2023 -- Q. No. 8: a) Contract of Indemnity b) Contract of Guarantee c) Contract of Bailment",
  "d) Contract of Agency 2016 -- Q. No.6: \"Discuss the composition and functions of Competition Commission of",
  "Pakistan under the Competition Commission Act, 2010.\" 2017 -- Q. No.7: \"Discuss the nature and scope of section 4 of the Competition Act 2010",
  "regarding prohibited agreements?\" 2018 -- Q. No.8: \"What do you know about the composition and functions of Competition",
  "Commission of Pakistan under the Competition Commission Act, 2010?\" 2019 -- Q. No.8: \"What is the meaning of 'services for consideration' in the consumer",
  "law and does it include the services of a doctor or a lawyer?\" 2020 -- Q. No.8: \"What is meant by 'Merger' under the law relating to competition in",
  "Pakistan? What is the procedure for the approval of merger? Discuss the powers of the Competition Commission for second phase review.\"",
  " 2021 -- Q. No. 8: \"Write a comprehensive note on the establishment, functions and powers of the Competition Commission of Pakistan.\"",
  " 2022 -- Q. No. 5: \"Critically analyze the Competition Commission of Pakistan as an institution. Discuss in detail the establishment, functions, and powers of the Competition Commission of Pakistan.\"",
  " 2022 -- Q. No. 7: \"Discuss unfair practices according to the Consumer Protection Act, 2006, and the role of the Consumer Protection Council.\"",
  " 2023 -- Q. No. 6: \"What is Competition Law? Why is it needed? Describe the composition, powers and functions of the Competition Commission of Pakistan.\"",
  " 2024 -- Q. No. 4: \"In the light of Competition Act 2010 discuss six most common practices in Pakistani markets that prevent, restrict, reduce and distort competition through abuse of dominant position.\"",
  "2016 -- Q. No.2: \"Define Endorsement. Explain its kinds.\" 2016 -- Q. No.8: \"Explain the terms and conditions of Transfers under the Electronic",
  "Fund Transfer Act 2007. What disclosures are required under such transfer?\"  2022 -- Q. No. 6: \"What are the functions of the Certification Council under the Electronic Transaction Ordinance, 2002?\"",
  " 2023 -- Q. No. 5: \"What considerations have been provided by the Electronic Transactions Ordinance, for the purpose of recognition and appraisal of electronic document?\"",
  " 2023 -- Q. No. 7: \"In case of unauthorized electronic fund transfer by the consumer, how would his liability be determined?\"",
  "2017 -- Q. No.2: \"Discuss the circumstances in which the veil of incorporation may be pierced in Pakistan referring to the relevant case law and statutory",
  "provisions?\" 2019 -- Q. No.5: (Also covered under Negotiable Instruments) \"Why does the State Bank of Pakistan Act, 1956 maintain that only",
  "State Bank can lawfully issue bearer notes and bills of exchange payable on demand? What does this tell you about the nature of the paper currency that we use?\"",
  "Insurance & Statutory Penalties: 2009, MCQ (xiv--xv): Questions on life insurance policies, false statements, and",
  "\"Caveat emptor: is the buyer who is supposed to be aware of the suitability of the goods.\" Short Notes & Essays:",
  "2011, Q.8: Short notes on topics including the Insurance Appellate Tribunal, fiduciary relationship, and goodwill.",
  "2014, Q.8: \"A seller cannot convey a better title than he himself has\" -- discuss exceptions to this rule.",
  "2015, Q.8: Short notes on: (a) Consequences of a breach of contract, (b) Indemnity and guarantee, (c) Condition and warranty.",
  "Free Consent in \"Discuss the importance of free consent in 2001 Contracts* contracts. When do you think consent is",
  "Remedies under Sale \"Discuss in detail remedies for breach of 2001 of Goods Act* a contract given to a seller against the",
  "Partnership -- \"Define partnership, and discuss the 2001 Formation & Elements* essential elements of partnership in",
  "Negotiable \"What do you understand by the words, 2001 Instruments* 'negotiation' and 'negotiable'? There are",
  "Arbitration* \"What is arbitration? How an arbitrator is 2001 appointed, and what are his powers under",
  "*Partnership Dispute Jamal Khan and Kamal Khan plan a 2002 (Alternative Dispute partnership and agree to settle disputes",
  "*Partnership & Scenario involving Gama, Maja, and Billoo 2002 Liability after where a retiring partner's actions affect",
  "Forged Bill of Jamal steals a bill of exchange, forges 2002 Exchange* the signature, and the legal entitlement",
  "Contract Award Error NAPE mistakenly notifies the wrong 2002 (Tender Mistake)* tenderer due to a typing error -- is there",
  "Delayed Delivery & Baber's contract for 50 computers: Was he 2002 Termination* justified in refusing delivery after",
  "Breach and Mr. Brown sells his computer to Mr. Green, 2002 Subsequent Loss* who later buys a similar computer for a",
  "*Post-Dissolution The Asif & Babar's scenario involving 2003 Partnership liability after dissolution and use of old",
  "*Corporate Veil & \"The Law treats a registered company as a 2003 Separate Legal separate legal person from its",
  "Unilateral Mistake \"How is a contract affected by a 2003 in Contract* unilateral mistake of fact? Discuss in",
  "*Fraud & Arif's purchase of a used car based on a 2003 Misrepresentation salesperson's incorrect statement and the",
  "Finder of Lost Compare the status of the finder of a lost 2003 Instruments* cheque with that of a lost watch.",
  "Enforcement of Dispute between Ali and Bashir -- can a 2003 Arbitrator's Award* court enforce an arbitrator's award, and",
  "Building Contract & Contractors plead for a higher sum based 2004 Quantum Meruit* on extra labor costs and claim the",
  "*Employment & Mr. Zulfiqar is offered a professorship on 2004 Conditions in Legal condition that he cancels his practicing",
  "Corporate Object A company uses a clause in its memorandum 2004 Clause* to justify activities outside its objects",
  "*Negotiable A chain of transfers in a bill of 2004 Instruments -- exchange: What are the rights of the final",
  "Modes of \"Write a detailed note on the different 2004 Dissolution* modes of dissolution of a firm.\"",
  "Umpire in Discuss the appointment of an umpire and 2004 Arbitration* whether a court can remove the umpire.",
  "Insurance Liability Is the insurer liable when (a) a 2004 Scenarios* policyholder commits suicide, or (b) a",
  "Agency & Tariq's acceptance of payments on behalf 2005 Misappropriation* of a publisher and the resulting liability",
  "*Partnership In a painters' partnership, liability 2005 Liability & Employee issues arising from accidental injuries",
  "Defective Goods & Sardar's case: Defective computers 2005 Agent's Authority* purchased from an agent, and the liability",
  "*Arbitration Removal In a tuition centre partnership, one 2005 Due to Bribery partner seeks removal of an arbitrator on",
  "Delayed Delivery and Goonline (Private) Limited's modem 2005 Consequential Loss* contract with Hightech (Private) Limited:",
  "*Rejection of Hasan Seeds (Private) Limited's dispute 2005 Defective Goods (Seeds with Fahd over defects discovered after an",
  "Conflicting Offers & Tanweer receives conflicting offers on 2005 Acceptance* washing machines -- one acceptance by post",
  "Note: In addition to these descriptive questions, each year contains a \"compulsory\" section with multiple-choice questions that often test",
  "similar legal principles (e.g., offer and acceptance, agency validity, negotiable instruments, and the liability of partners or company members).*",
  "and the separate legal personality of companies---is essential because these areas are repeatedly tested across the years.",
  "factual patterns. Developing the ability to apply principles to nuanced fact scenarios (e.g., misrepresentation in a used car sale, the liability in partnership after dissolution) is key.",
  "Evolution of Complexity: While early questions often request definitions or broad discussions, later questions demand detailed advice on multi-faceted problems",
  "(e.g., consequences of delayed delivery in commercial contracts or the interplay between agency and corporate liability).",
  "Multiple-Choice Sections: Consistent inclusion of multiple-choice questions requires a solid grasp of doctrinal nuances---from knowing when an acceptance is",
  "complete to understanding the precise nature of negotiable instruments. Reviewing these options can help reinforce factual details."
]