[
  "Use in deriving Laplacian, setting up Maxwell's equations, and evaluating work in fields MCQ Q.1 (i): Topic:* Vector directions in dynamics",
  "Description: \"A body is moving northward and a force is applied eastward. What is the acceleration produced?\" Focus: Understanding vector decomposition.",
  "Description: \"The work done by a force (with components) on a charged particle undergoing a given displacement.\" Focus: Applying dot products to compute work.",
  "Focus: Using weighted averages and vector positions. MCQ Set 1 Q.1 (i): Topic: Scalar multiplication and magnitude",
  "Focus: Multiplying vectors by scalars and recalculating magnitude. MCQ Set 1 Q.1 (ii): Topic: Dot product computation",
  "Description: \"Given two vectors A and B, calculate A·B.\" Focus: Practice with inner products. MCQ Set 1 Q.1 (iii): Topic:* Interpretation of vector operators",
  "Discussion on the hybrid nature of the vector differential operator (e.g., expanding expressions like ∇·(∇V)).",
  "Description:* \"For R = 2i + j + 3k, find the magnitudes of its x, y, and z components, the overall magnitude, and the angles it makes with",
  "Focus:* Solidifying the basics of vector algebra and geometric interpretation. Descriptive Q.2 (parts b & c):",
  "Focus:* Application of the dot and cross products in geometric contexts. <!-- --> MCQ Q.1.8 & Descriptive Q.2:",
  "(a) Given two vectors A and B, find their magnitudes, dot product, and projection of B on A.",
  "(b) Prove the vector identity: A×(B×C)=B(A⋅C)−C(A⋅B)mathbf{A} times (mathbf{B} times mathbf{C}) = mathbf{B}(mathbf{A} cdot mathbf{C}) -",
  "(c) Discuss whether unit vectors in cylindrical and spherical coordinate systems are constant. Descriptive Q.2:",
  "(a) Define a scalar field and derive the expression for its gradient; explain why the gradient is a vector.",
  "(b) Solve a displacement problem by decomposing a vector into east and north components. Descriptive Q.2:",
  "One option for short notes is on the Scalar Triple Product, reinforcing its geometric and algebraic significance.",
  "Insight: Reinforces both the computational and physical meaning of differential operators. 2024 (Part II MCQs):",
  "Several MCQs test concepts like the evaluation of electric flux (using Gauss's law) and group velocity (which is derived via",
  "Trend:* The later years show increased emphasis on precise calculation using these operators in both electromagnetism and quantum",
  "Integration of relativity concepts: Lorentz transformations, time dilation, mass--energy equivalence MCQ Q.1 (i): Topic:* Dynamics via vector decomposition",
  "Description: (See Vector Analysis above -- also connects to dynamics.) MCQ Q.1 (vii): Topic: Circular motion and friction",
  "Description:* \"Find the maximum speed of a car rounding a curve given a radius and static friction coefficient.\"",
  "Focus: Applying centripetal force concepts and friction limits. MCQ Q.1 (viii) & (x): Topic: Simple harmonic motion (SHM) Description:*",
  "(x): \"Calculate the time period of a mass-spring system.\" Focus:* Recognizing and applying SHM formulas.",
  "Focus: Using I=∑miri2I = sum m_i r_i^2I=∑mi​ri2​. Descriptive Q.3 (a) & (b): Topic: Angular momentum and conservation Description:*",
  "Differentiate between linear and angular momentum and prove conservation in the absence of external torque.",
  "Focus: Deep conceptual understanding of momentum in rotational systems. Descriptive Q.5 (a) & (b): Topic: Oscillations and SHM derivation Description:*",
  "Work with a transverse wave equation to find speed and linear density. Focus:* Bridging mechanics and wave motion.",
  "Focus:* Testing the constancy of angular momentum and the invariance of kinetic energy despite changing velocity direction.",
  "Focus: Applying dynamics to realistic motion scenarios. Descriptive Q.3: Topic: Simple harmonic motion and oscillations Description:*",
  "Derive SHM from Hooke's law; obtain the differential equation, relate displacement, velocity, and acceleration, and sketch their",
  "Apply the SHM formula to determine mass, time period, and maximum acceleration given specific conditions.",
  "Q.1.2--Q.1.5 include questions on kinetic energy change, potential energy of a simple harmonic oscillator, relative motion (cars",
  "(a) Contrast linear and angular momentum; prove conservation of angular momentum in the absence of external torque.",
  "Several problems on work--energy (e.g., proving work done by a constant force equals the change in kinetic energy).",
  "(b) Compute the rotational inertia of a hollow cylinder about its cylindrical axis. Descriptive Q.4:",
  "(c) Find the altitude where the gravitational acceleration is ¾ of that at Earth's surface. Descriptive Q.3:",
  "(b) Discuss projectile motion with an example (cricket ball problem) and explain why a fielder adjusts his hand.",
  "(d) Solve a projectile motion problem to find the angle and speed of projection. Part-I Q.2 (Multiple Subparts):",
  "Comparative projectile motion where one object is a free projectile and another slides on an incline.",
  "A mass--spring system where kinetic and potential energies are equal at a specific displacement. Part-I Q.4 & Q.5:",
  "Topics also include angular momentum (merry-go-round with a rock) and orbital mechanics (work done on a planet in circular vs.",
  "(a) \"What was Physics like before relativity? Explain mathematically how mass and energy are interchangeable.\"",
  "Insight:* The modern papers integrate classical mechanics with special relativity, emphasizing both conceptual shifts (pre-- vs.",
  "(a) \"Define a conservative field; prove gravitational force is the negative derivative of potential energy.\"",
  "Emphasis on both the mathematical treatment (using complex impedance) and practical device operation Q.1 (i): Topic: Energy units Description: \"A Watt--sec is a unit of...\" Focus:* Differentiating energy from power.",
  "Focus: Fundamental concepts in electromagnetism and circuit analysis. Q.1 (x)--(xi): Topics: Focus:* Oscillatory behavior in AC circuits.",
  "Amplitude modulation, photoelectric effect details, and quantum aspects like Planck's law and the Zeeman effect.",
  "In a uniform field, compute field strength from the force on a charged particle and compare electric with gravitational forces.",
  "Derive Faraday's law and apply it to compute the inductance of a solenoid given its geometry and current.",
  "Focus:* Bridging theory with practical circuit and device analysis. MCQ (Second Set Q.1, 2, etc.):",
  "State and explain Gauss's law and apply it to find the electric field outside a charged volume. Part-II Q.2 & Q.3:",
  "(No major new electromagnetism topic beyond those already present in circuit and vector sections.) Part-II Q.2:",
  "(a) State and explain the Biot--Savart law; (b) prove Ampere's law; (c) solve a problem on magnetic force acting on an electron",
  "Define Gauss' law; deduce Coulomb's law; find the electric field from an infinite sheet and compute surface charge density.",
  "Derive capacitance expressions for cylindrical and spherical capacitors and show the relation of stored energy to the electric",
  "Quantum mechanics aspects (Schrödinger equation and de Broglie hypothesis) further link electromagnetic theory with modern physics.",
  "(b) \"Show that the energy density of a parallel plate capacitor (with dielectric) is proportional to E2E^2E2.\"",
  "Insight: Understanding energy storage in capacitors and the practical basis for microwave heating. 2021 (Part II):",
  "Numerous questions test Gauss's law (flux through Gaussian surfaces), the differential form of Gauss's law in magnetostatics,",
  "Trend:* The later papers emphasize the interrelation between energy flow (via the Poynting vector) and field potentials.",
  "Questions on transistor circuits (PN junction, NPN/PNP characteristics) and their applications. 2024 (Part II MCQs):*",
  "Transformer operation, impedance of RLC circuits, rectification, and the behavior of capacitors under mechanical change.",
  "Trend:* A consistent focus on linking electromagnetic theory with circuit analysis and semiconductor device physics.",
  "Description: \"The intensity of a wave is proportional to the square of its amplitude.\" Focus: Connecting amplitude with energy.",
  "Description: \"Colours in soap bubbles, oil slicks, etc., are due to...\" Focus: Optical interference in thin films.",
  "Focus: Relationship between the number of rulings and resolving power. Q.1 (xiv) & (xv): Topic: Coherence and fringe characteristics Description:*",
  "Description: \"On reflection from a fixed end, a transverse wave undergoes a phase change of...\" Focus: Phase inversion upon reflection.",
  "(b) Solve a numerical problem on the Doppler effect (determining the velocity of sound). Descriptive Q.5:",
  "(b) Solve a problem to find the angular position of maxima and the linear separation between fringes.",
  "(a) Explain the formation of Newton's rings; derive a relation showing that the radius of the mthm^{th}mth dark ring is",
  "(b) Define diffraction grating and explain how it is used to determine the wavelength of light. Part-II Q.7:",
  "Short notes on topics such as standing waves, Doppler's effect, electromagnetic waves, and surface tension.",
  "(b) Explain polarization of light and how a polarizing sheet produces plane-polarized light. Descriptive Q.4:",
  "(b) Demonstrate that standing waves are produced by the superposition of two oppositely traveling waves.",
  "(c) For a given oscillatory disturbance, determine the component waves' amplitude, frequency, wavelength, speed, and direction.",
  "(d) Calculate the coherence length and coherence time given the wavelength and bandwidth. Descriptive Q.5:",
  "Topics on capacitance and energy stored in electric fields sometimes tie into optical energy concepts (when discussing electromagnetic",
  "(a) \"What is an oscillator? How does an LC oscillator work? Discuss Barkhausen criteria for oscillations.\"",
  "Questions on energy transport by a travelling wave along a string and problems involving interference (two waves traveling in opposite",
  "(a) \"If two waves with the same amplitude propagate in opposite directions through a string, will they produce standing waves? Is",
  "Trend:* A steady focus on both the theoretical derivation of wave properties and their practical measurement.",
  "Introduction to quantum statistics (Fermi--Dirac, Bose--Einstein) Q.7 (a) & (b): Topic: Second Law and Carnot Engine Description:",
  "Description: \"A Carnot cycle is...\" with a diagram depiction on a P--V graph. Focus: Recognizing the ideal thermodynamic cycle.",
  "Description: \"What is the likely value for the molar heat capacity at constant temperature (CTC_TCT​)?\" Focus: Comparing CVC_VCV​ and CPC_PCP​ in gases.",
  "Questions on the adiabatic equation and melting point changes under pressure. Descriptive Q.8 (Option in short notes):",
  "(b) Show that entropy remains constant in a reversible process but increases in an irreversible process.",
  "(a) Derive expressions for half-life and mean-life; (b) solve a radioactivity problem; (c) discuss industrial/medical uses of",
  "(a) Discuss nuclear fission and fusion (overlap with nuclear physics, but also ties to energy production and thermodynamics).",
  "(c) Briefly discuss Lissajous patterns (an interlude linking energy and periodic motion in oscillatory systems).",
  "(d) Solve a problem calculating the pressure change in a vessel from mechanical work. Descriptive Q.4 (later parts in Part-I):",
  "(k) Show that entropy remains constant in a reversible process but increases in an irreversible one.",
  "Short notes include topics like gravitational potential energy, which often tie into thermodynamic considerations in energy",
  "Topics on capacitors and energy stored in fields also relate to energy considerations in thermodynamics.",
  "(b) \"For oxygen, given van der Waals coefficients, calculate pressure using both the ideal gas law and van der Waals equation.\"",
  "(b) \"What is a heat engine? Determine its efficiency given heat input and work output.\" Q3 (Part I):",
  "(a) \"Differentiate between real and ideal gas; describe the work done on an ideal gas in thermal isolation.\"",
  "(b) \"A heat pump problem: given outside and inside temperatures, find the maximum coefficient of performance.\"",
  "Application of operator formalism and energy quantization in simple systems MCQ Q.1 (xviii): Topic:* Relativistic Effects",
  "Explain the failure of classical physics in explaining the photoelectric effect, derive Einstein's photoelectric equation, and",
  "Calculate the de Broglie wavelength for electrons accelerated through a given potential (with discussion on when relativistic",
  "(b) Calculate the total energy of a 2.53 MeV electron. Descriptive Q.7 (Part of Second Set): Descriptive Q.5:",
  "(b) Discuss time dilation in special relativity; derive an expression for time dilation. Part-II Q.3:",
  "(b) Solve a Doppler effect problem for sound under various relative motions. Descriptive Q.5 (later parts in Part-I):",
  "Questions on quantum numbers, the Stern--Gerlach experiment, and nuclear models tie into the quantum revolution.",
  "(c) Calculate the de Broglie wavelength of an electron accelerated through a potential difference. Part-II Q.8:",
  "Short notes on topics such as Heisenberg's Uncertainty Principle and mass defect---cornerstones of quantum theory.",
  "(a) \"Derive an expression for the time-independent Schrödinger wave equation in one dimension for a single particle. Define the",
  "(a) \"Discuss the behavior of a particle in an infinitely deep well and show that its energy is quantized.\"",
  "Insight: Early emphasis on the fundamentals of quantum mechanics and energy quantization. 2021: Q5 (Part II):",
  "(a) \"Determine the transmission coefficient for a particle incident on a rectangular barrier (with E<V0E < V_0E<V0​).\"",
  "(b) \"Discuss commutation relations: if [H^,A^]=0[ hat{H}, hat{A} ] = 0[H^,A^]=0, what does this imply about eigenstates",
  "\"Discuss electrical conduction in solids in terms of band theory, explain crystal structure (e.g., diamond), and compute carrier",
  "Trend: A gradual shift toward operator formalism and applications in solid state physics. 2022: Q5 & Q6:",
  "Questions set up the Schrödinger equation for a particle in a box and compare finite versus infinite potential wells.",
  "Derivations include solving for eigenfunctions and energy levels, with sketches of wave functions and probability densities.",
  "A multi--part question on a particle in a quantum state: (a) normalization, (b) determining the potential V(x)V(x)V(x) for which",
  "the given wave function is a solution, (c) calculating expectation values for xxx, x2x^2x2, ppp, and p2p^2p2, and (d) finding uncertainties and checking the uncertainty principle.",
  "Explain the theory of relativity; derive the inverse Lorentz transformation from the given transformation (using the equivalence",
  "Focus: Derivations based on Einstein's postulates. Descriptive Q.4 (a): Topic: Relativity of Mass, Time, and Length",
  "Describe Einstein's postulates, discuss the relativistic effects on mass, length, and time, and solve related numerical problems (e.g.,",
  "total energy of an electron). Focus: Merging theory with numerical application. Descriptive Q.7: Topic: Lorentz Transformations in Depth Description:*",
  "Derive the coordinate transformations (x′, y′, z′, t′) for an event in a frame moving at a constant speed relative to another.",
  "(b) Calculate the total energy of a 2.53 MeV electron. Descriptive Q.7 (Part of Second Set): Descriptive Q.5:",
  "(b) Discuss time dilation in special relativity; derive an expression for time dilation. Part-II Q.3:",
  "(b) Solve a Doppler effect problem for sound under various relative motions. Descriptive Q.5 (later parts in Part-I):",
  "Questions on quantum numbers, the Stern--Gerlach experiment, and nuclear models tie into the quantum revolution.",
  "(c) Calculate the de Broglie wavelength of an electron accelerated through a potential difference. Part-II Q.8:",
  "Short notes on topics such as Heisenberg's Uncertainty Principle and mass defect---cornerstones of quantum theory.",
  "Description:* \"Using Bernoulli's theorem, determine the flow speeds over an airplane wing given a pressure difference.\"",
  "Focus: Detailed application of energy conservation in fluids. MCQ Q.1 (ix): Topic: Moment of Inertia",
  "Description:* \"Calculate the moment of inertia of two particles on a mass-less rod rotating about its center.\"",
  "Prove that the moment of inertia of a uniform rod about its center is I=ML212I = frac{ML^2}{12}I=12ML2​.",
  "Discussion of Q--value, chain reactions, and stability of nuclei Q.1 (xvii): Topic:* Components in Nuclear Reactors",
  "Description: \"Identify which item is NOT needed in a nuclear fission reactor (accelerator).\" Focus: Basic nuclear reactor design.",
  "Description:* \"Determine the time required to lose ¾ of the initial activity of a radioactive isotope.\"",
  "Conditions for fission in U‑235 (capture of a neutron). Focus: Nuclear reaction mechanisms. Q.1 (xvi): Topic: Radioactive Decay Units",
  "Topics include the reasons fission fragments are usually radioactive and the challenges in harnessing fusion energy.*",
  "Define radioactivity, describe the changes during α, β, and γ decay, and plot the decay law graphically.",
  "Define fission and fusion reactions, explain the source of energy, and calculate reaction energy for a specific nuclear reaction.",
  "Questions on semiconductor properties (number of valence electrons, minority carriers), nuclear properties (alpha particle charge, ideal",
  "projectiles for induced reactions, function of a moderator, energy production in the Sun, half-life interpretations).",
  "(Q.7) Compare nuclear fission and fusion; diagram and explain nuclear reactors; calculate energy released in a fission reaction.",
  "(a) Explain the liquid drop model and its features; (b) discuss magic numbers from the shell model; (c) describe nuclear fusion.",
  "(a) Differentiate metals, semiconductors, and insulators using energy band theory; (b) explain rectifier operation and half-wave",
  "(a) Describe nuclear fission using the liquid drop model; (b) discuss uses of radioisotopes; (c) solve a nuclear reaction energy",
  "Explain the construction and working of a Geiger--Müller counter and discuss gamma-ray properties. Part-II Q.8 (short notes):",
  "(a) \"Discuss the principle, construction, and working of a nuclear reactor. Define a breeder reactor.\"",
  "(b) \"What is nuclear fusion? Describe the proton--proton cycle for energy release in the Sun and stars.\"",
  "(a) \"Discuss factors contributing to the stability of a nucleus; sketch and explain the plot of neutron number vs. atomic number for",
  "(c) \"Discuss the expected radioactivity of an isotope (e.g., 18K) given that 19K is stable.\" Q8:",
  "(a) \"When a gas expands adiabatically ..., compute the degrees of freedom of a gas molecule.\" (Although part of a thermodynamics",
  "Topics include derivations related to free energy for spin--1/2 particles in a magnetic field and adiabatic demagnetization.",
  "(b) \"Explain the working principles of cyclotrons and synchrotrons; calculate required magnetic fields and kinetic",
  "Trend:* There is a continuous emphasis on both conceptual understanding and quantitative problem--solving in nuclear processes and radiation",
  "Focus: Understanding the operational principles of semiconductor devices. Q.5: Topic: Energy Band Theory and PN Junctions Description:*",
  "Explain the formation of a PN junction and its use as a diode, including a discussion on full-wave and half-wave rectification.",
  "\"Explain electrical conduction in solids in terms of band theory; describe the crystal structure of diamond; and calculate carrier",
  "Questions on the number of conduction electrons in a given volume and discussion of Bravais lattices.",
  "In later papers, advanced topics such as energy band formation and density of states appear alongside solid--state device questions in",
  "Trend:* Over time, there is a gradual shift from basic semiconductor concepts toward quantitative aspects of band theory and carrier",
  "Topics include the Michelson--Morley experiment, Poynting vector, cyclotrons, electromagnetic waves, and various aspects of quantum",
  "2023 Q8: Options include: (a) Kepler's Law of Periods, (b) Michelson interferometer, (c) Young's double slit experiment.",
  "2024 Q8 (Part I): Options include short notes on damped harmonic motion, Young double--slit experiment, or coherence.",
  "Trend:* Short-note questions allow candidates to demonstrate broad conceptual knowledge and succinctly summarize complex ideas.",
  "mechanics and electromagnetism to advanced quantum theory, solid state physics, and nuclear phenomena. There is a clear trend toward integrating concepts from different branches (e.g., linking vector calculus with electromagnetism, or using quantum mechanics in solid state problems).",
  "Emphasis on Derivations: Many descriptive questions require detailed derivations (e.g., Schrödinger equation, Poynting theorem, work--energy in rotational",
  "Application of Theory: Numerous numerical problems are presented that require the application of theoretical concepts to realistic scenarios---such as calculating",
  "induced emfs, solving orbital mechanics problems, analyzing circuit behavior, or evaluating device parameters (e.g., cyclotron operation and semiconductor carrier concentrations).",
  "Advancement to Modern Topics: As years progress, there is a noticeable shift toward advanced topics",
  "such as quantum statistics, density of states, operator formalism in quantum mechanics, and the electronic properties of solids. Questions on nuclear reactors, radiation detectors, and modern accelerators (e.g., cyclotrons) also become more detailed.",
  "Real--World Relevance: Many problems emphasize practical applications: from the design and functioning of microwave ovens and heat pumps to the operation of",
  "nuclear reactors and semiconductor devices. This demonstrates the ongoing commitment to showing how fundamental physics underpins modern technology.",
  "deeper analytical abilities (via long--answer derivations and multi--step numerical problems), ensuring that candidates not only understand the theory but also can apply it quantitatively.",
  "Integrates advanced and modern topics (quantum mechanics, statistical mechanics, solid state physics, nuclear physics) into a",
  "Demands a balance between conceptual clarity and computational skill, with an increasing emphasis on applying theoretical models to"
]