[
  "Political science These questions require detailed explanations, critical evaluations, and comparative analyses. They frequently focus on classical political",
  "Theme: Analysis of ideas by major political thinkers (Plato, Aristotle, Hobbes, Locke, Rousseau, Montesquieu, Marx, Al-Farabi, Ibn",
  "\"Farabi was much inspired by Plato in his setting up of the Ideal City, or the Model State. Discuss.\"",
  "\"Explain Allama Iqbal's Concept of Nationalism. Do you agree that it developed through a lengthy process of evolution?\"",
  "(Essay questions in PART-I include topics such as \"Power corrupts, and absolute power corrupts absolutely. Through what mechanism has",
  "this been prevented in the American Constitution?\" and \"Ministerial Responsibility is the cardinal principle of British democracy. Elaborate.\")",
  "\"Machiavelli enunciated the philosophy of the art of government for effective discipline and stability in the state. Analyze and",
  "\"Montesquieu expounded his theory of the separation of powers to set forth the different organs of governance in order to safeguard",
  "\"Enlist the qualities of Al-Ghazali's Amir and detail an account of his daily routine.\" \"Write short notes on:",
  "(a) Beccaria's theory of Punishment. (b) Ibn-Khaldun's stages in the development of the state.\" 2003:",
  "\"Hobbes and Bodin are said to be the proponents of the theory of Absolutism. Do you agree? Give reasons.\"",
  "\"Al-Farabi must be placed among the proponents of the Theory of Social Contract. In the light of this statement, discuss",
  "\"As far as Philosophers, they make imaginary laws for imaginary Commonwealths. Elucidate this statement with reference to Plato.\"",
  "\"Ibn Khaldun is aptly called the father of political economy. Discuss his views on political economy.\"",
  "\"Write short notes on the following: (a) Iqbal's concept of Ego (Khudi) (b) Differences between Fascism vs. Platonism\"",
  " 2009: ▪ \"Discuss Plato's contribution to the History of Political Thought.\" ▪ \"Discuss the Theory of Kingship as propounded by Nizamul-Mulk",
  "Tusi.\" ▪ (Note: Although not all classical questions appear in the MCQ section of 2009, Part-II of 2009 includes essays on Montesquieu and on Rousseau's theory and on kingship.)",
  " 2010: ▪ \"Is it correct to call Machiavelli citizen of all states and contemporary of all ages. Argue.\"",
  "▪ \"Al-Mawardi brought constitutional theory of Islam in line with political reality of his time. Discuss this with reference to his views on 'Khilafat' and 'Wizarate'.\"",
  " 2011: ▪ \"Discuss Locke and Hobbes' perspectives on the 'State of Nature'.\" ▪ \"Marx's historical materialism is the application of dialectical",
  "materialism to explain historical events, processes and developments in society. Elaborate.\" ▪ \"Critically appreciate Al-Ghazali's theory of Khalafat.\" ▪ \"Write short notes on: (i) Platonic and Aristotelian paradigms; (ii) Iqbal's concept of Millet.\"",
  " 2012 (Set I): ▪ \"Plato intended to build an institution for scientific study of politics and training of statesman. Elaborate.\"",
  "▪ \"Montesquie with all his faults and irregularities is the father of modern historical research. Explain and discuss.\" ▪ \"Ibn-Khaldun perhaps was the first philosopher to realize the relevant importance of economics to politics. Discuss.\" ▪ \"Write short notes on: (i) Rousseau's theory of General will; (ii) Al-Farabi's theory of state.\"",
  " 2012 (Set II): ▪ \"Discuss in detail the Legislative Powers of the President of USA.\" ▪ \"What is 'Judicial Review'? Discuss its impact on USA decision",
  "making process.\" ▪ \"Discuss the Executive Powers of the French President in detail.\" ▪ \"Discuss the powers of Senate of USA. Also analyse.\"",
  " 2013: ▪ \"Examine Montesquieu's theory of separation of powers. Why has he been called 'Aristotle' of eighteenth century? Discuss.\"",
  "▪ \"Critically analyse the Social Contract theory of Hobbes, Locke and Rousseau.\" ▪ \"Discuss the Allama Iqbal's concept of 'Khudi'.\" ▪ \"Write short notes on: (i) Ibne Khaldun's concept of Asbiyah (ii) Marx's theory of Class Struggle\"",
  " 2014: ▪ \"Critically examine the concept of 'Justice' by Plato.\" ▪ \"Discuss in detail the concept of 'Raisul Awwal' by Al‑Farabi.\"",
  "▪ \"Compare the concepts of Millat & Territorial Nationalism by Iqbal.\" ▪ \"Write short notes on any TWO of the following: (a) Asabiya (b) Social Justice (c) Oligarchy\"",
  " 2015: ▪ \"Critically examine the concepts of Hobbes and Locke about 'Social Contract.'\" ▪ \"Discuss in detail Ibne Khaldun's concept of 'Asbiyah'.\"",
  "▪ \"'Equal distribution of wealth' -- explain this statement in the light of Marx's philosophy.\" ▪ \"Write short notes on any TWO of the following: (a) Bentham's 'Utility' (b) Philosopher King (c) Pressure group\"",
  " 2016: ▪ \"Give a critical analysis of Aristotle's classification of Governments.\" ▪ \"Is it correct to say that Machiavelli was an apostle of Power",
  "Politics?\" ▪ \"Describe Al‑Mawardi's theory of Imamate.\" ▪ \"Write short notes on any TWO of the following: (a) End of History (b) Totalitarianism (c) Women Empowerment\"",
  " 2017: ▪ Q.2: \"Compare and contrast the different political philosophies of Hobbes and Locke. How are these philosophies implemented in present day political systems and policy making?\" ▪ Q.3: \"According to Marx 'the mode of production in material life determines the general character of social, political and spiritual process in life'. Elucidate.\" ▪ Q.4: \"Discuss the upward and downward development of state, rulers and ruled in the socio‑political thought of Ibn Khaldun.\"",
  " 2018: ▪ Q.2: \"Critically analyze the salient features of Plato's Republic. Do you think that some of its features are valid, even today?\" ▪ Q.3: \"What is the concept of State of Nature as given by Thomas Hobbes? Make its comparison with the Social Contract as presented by John Locke and Rousseau.\" ▪ Q.4: \"Write a detailed note on the concept of asbiah as given by Ibn‑e‑Khaldun. What is its significance in the progress and decline of nations?\" ▪ Q.5: \"Write a detailed essay on the principle of Ijtihad in Islam as given by Allama Iqbal. How it can be made possible in the modern age?\"",
  " 2019: ▪ (Section‑A) Although fewer direct classical questions appear, theoretical issues persist in questions like: \"Explain the concept of Nationality and distinguish between Nationality and Citizenship.\"",
  " 2020: ▪ Q.3: \"Examine Montesquieu's theory of separation of powers. Why has he been called 'Aristotle' of eighteenth century? Discuss.\"",
  "▪ Q.4: \"Critically analyze the Social Contract Theory of Hobbes, Locke and Rousseau.\" ▪ Q.5: \"Examine the view that the Hegelian spirit is nothing but evolution of human consciousness to the realization of political maturity for global human co‑existence.\"",
  " 2021: ▪ Q. No. 2: \"What is the Aristotelian classification of state?\" ▪ Q. No. 3: \"What is the difference between Rousseau's notion of",
  "'the state of nature' and that of Hobbes and Locke?\" ▪ Q. No. 4: \"Ibn I Khaldun, while acknowledging the external factors, emphasizes more on the internal systemic factors as decisive for the decline of states. Elaborate.\" ▪ Q. No. 5: \"Explain the socio‑political thought of Shah Waliullah which is greatly ingrained in his religio‑philosophical thought.\"",
  " 2022: ▪ Q. No. 2: \"Discuss in detail the Plato's concept of 'justice.'\" ▪ Q. No. 3: \"Compare and contrast the concepts of the 'executive'",
  "presented by the Muslim thinkers Al‑Farabi, Al‑Mawardi, and Shah Waliullah.\" ▪ Q. No. 4: \"Illustrate Hobbesian concept of limited 'right to revolution.'\" ▪ Q. No. 5: \"Describe in detail Karl Marx views on class, state and religion.\"",
  " 2023: ▪ Q. No. 2: \"Explain Bentham's greatest happiness of the greatest number.\" ▪ Q. No. 3: \"What are Al‑Ghazali's pre‑requisites for becoming a",
  "Khalifa?\" ▪ Q. No. 4: \"Expound Iqbal's vision for rise of Muslims in South Asia in the era of colonialism.\" ▪ Q. No. 5: \"Write short notes on the following: (a) Existentialism is humanism (b) Cogito, ergo sum (I think, therefore I am)\"",
  " 2024: (MCQ section is provided in Part‑I; descriptive Part‑II items include:) ▪ Q. No. 1 (Descriptive): \"Aristotle was a realist and not an",
  "idealist. Elaborate with reference to his theory of the ends and functions of the state.\" ▪ Q. No. 2 (Descriptive): \"Is it correct to call Machiavelli a citizen of all states and contemporary of all ages? Substantiate your answer with valid arguments.\" ▪ Q. No. 3 (Descriptive): \"Discuss Montesquieu's theory of Separation of Powers. Why is he considered Aristotle of the 18th century?\" ▪ Q. No. 4 (Descriptive): \"Elaborate the Theory of Kingship as propounded by Nizamul‑Mulk Tusi.\"",
  "Theme: Comparing different governmental systems (American, British, French, etc.) and discussing the mechanisms of power, checks",
  "\"Power corrupts, and absolute power corrupts absolutely. Through what mechanism has this been prevented in the American",
  "\"Comparatively discuss the law-making process in the Parliament of Britain and Congress of the United States.\"",
  "\"The French political system is not as liberal as the Frenchmen claim. Discuss it in the light of the working of the French",
  "\"Examine the fundamental principles of the British Constitution. Also, discuss the nature, powers, and functions of the British",
  "\"'The President of India is merely a figurehead.' How far do you agree?\"  2009: ▪ \"Examine Montesquieu's Theory of Separation of Powers. Why has he",
  "been called the Aristotle of eighteenth century? Discuss.\" ▪ \"Write note on the following: (i) Appreciation and criticism of Rousseau's theory of General Will; (ii) Mao's views on Individualism.\"",
  " 2010: ▪ \"How is the French President elected? Give an objective analysis of the powers enjoyed by the President.\"",
  "▪ \"The Senate of USA is the most powerful upper house in the world. Do you agree with the statement? Explain your answer with reference to the upper houses of India and Pakistan.\"",
  " 2011 (Part-II, Section II -- BS-17 Paper): ▪ \"Discuss the scope and significance of Judicial Review. Offer your",
  "criticism also.\" ▪ \"What are the principles on which British Cabinet is organized and functions? Also mention four occasions of Cabinet change.\" ▪ \"Enumerate the reasons for downfall of Fourth French Republic and discuss salient features of 1958 Constitution.\"",
  " 2012 (Set II -- Section II): ▪ \"What is 'Provincial Autonomy'? Discuss its importance in True",
  "Federation.\" ▪ \"Discuss 18th Amendment of Pakistan. Do you find the principle of Social Justice in this Amendment?\" ▪ \"Write notes on any TWO of the following: (i) Fundamental Rights; (ii) Social Justice; (iii) Lok Sabha; (iv) Supreme Court of Pakistan.\"",
  " 2013: ▪ (Paper II) \"American Senate is 'the saucer in which the boiling tea of the House is cooled'. Elucidate.\" ▪ \"Explain why kingship is not abolished in England?\" ▪ \"Examine the Powers of the Presidium of the Supreme Soviet of USSR.\"",
  " 2014: ▪ \"Discuss the powers and functions of the US Senate. Also explain the concept of Senatorial Courtesy.\" ▪ \"Explain the evolution of British Monarchy with focus on the gradual transfer of powers from the Monarch to the Prime Minister.\" ▪ \"Analyse the role of political parties in the post‑1958 political system of France.\" ▪ \"Critically analyse the nature of federation in former USSR.\" ▪ \"Elaborate the secular aspect of Turkish Constitution and objectively analyse its impact on Turkish society.\" ▪ \"How Iqbal's wisdom helped in shaping the intellectual foundations of Pakistan?\" ▪ \"Write short notes on any TWO of the following: (a) Gerrymandering (b) Rahbar in Iran's Constitution (c) Impact of Deng Xiaoping's reforms on China\"",
  " 2015: ▪ \"Discuss in detail the concept of sovereignty and explain its attributes.\" ▪ \"How is public opinion made and how can it be measured?\" ▪ \"How does local self government strengthen democracy? Why is this system unable to work consistently in Pakistan?\" ▪ (Alternate Section) \"The American Senate today is the most powerful legislative body in the world. Explain.\" ▪ \"'The British PM is a shining moon among stars' -- discuss the position and powers of the English Prime Minister.\" ▪ \"What is Supreme Soviet? Discuss its powers and functions.\"",
  "▪ \"Explain 'Confederation' and how it differs from Federation.\" ▪ (Alternate Paper II) \"Discuss the salient features of the judicial system in France. How does it differ from that of Britain and Pakistan?\" ▪ \"The Senate of the USA is the most powerful Upper House in the world. Can you justify this statement? Explain with reference to the Upper Houses of India and Pakistan.\" ▪ \"Discuss the features of the Turkish model of democracy with reference to the distinguished role of the armed forces.\" ▪ \"Explain the rise of Muslim nationalism in South Asia. What were its implications for the nationalist politics of the Indian National Congress?\" ▪ \"What are the political and administrative implications of the Eighteenth Amendment to the 1973 Constitution of Pakistan?\" ▪ \"Write detailed notes on any TWO of the following: (a) European Union (b) South Asian Association for Regional Cooperation\"",
  " 2017: ▪ (Section‑II, Q.2): \"To what extent is it true that the President of the United States is more powerful than the Prime Minister of the",
  "United Kingdom (UK)? Justify your answer with comparative analysis.\" ▪ (Section‑II, Q.3): \"Discuss the basic norms of regional politico‑economic integration and organizational structure of the European Union.\"",
  " 2018: ▪ (Section‑II, Q.6): \"What is the significance of Local Government System in a country? Discuss the reasons of repeated failures of the",
  "efforts in Pakistan to establish a stable local government.\" ▪ (Section‑II, Q.7): \"What is the significance of independent judiciary in a democratic republic? Do you think that without an independent judiciary a system of checks and balances can be established in the government? Explain with appropriate examples.\"",
  " 2019: ▪ (Section‑II, Q.2): \"How the system of Checks and Balances works in the US political system? Explain with examples.\"",
  "▪ (Section‑II, Q.3): \"How the party system in France is different to that in Germany? Discuss in detail.\"",
  " 2020: ▪ (Section‑B, Q.6): \"Critically examine the basic principles of Fascism.\" ▪ (Section‑B, Q.7): \"Bring out clearly the difference between",
  "unitary and federal forms of government.\" ▪ In another paper set (Section‑B), questions address global and comparative issues such as: \"Critically evaluate the role of Post‑World War‑II International Financial Regimes in the economic development of the less developed countries.\" and \"Discuss the powers and functions of China's National People's Congress.\"",
  " 2021: ▪ (Section‑B, Q. No. 6): \"What are the political and legal constraints over the sovereignty of parliament in Pakistan?\"",
  "▪ (Section‑B, Q. No. 7): \"The adoption of parliamentary system in Pakistan is the result of political experiences of Pakistanis in the past. Elaborate.\" ▪ (Section‑B, Q. No. 8): \"What is capitalism and what is its relation with democracy?\"",
  " 2022: ▪ (Section‑A, Q. No. 2): \"Define democratic peace. Highlight its basic norms and discuss how it played a vital role in the",
  "political‑economic integration of European Union (EU).\" ▪ (Section‑A, Q. No. 3): \"Russian‑Ukraine war has threatened regional political‑economic global integration. What policy options are available for IMF and WTO to address the new regional and global challenges in the current scenario?\"",
  " 2023: ▪ (Section‑A, Q. No. 3): \"Compare and Contest the powers of the Indian President with the American president.\"",
  " 2024: (Part‑II Section‑B descriptive items include:) ▪ Q. No. 5: \"Discuss the features of Turkish model of democracy",
  "keeping the distinguished position of the armed forces in Turkish politics.\" ▪ Q. No. 6: \"Explain the rise of Muslim nationalism in South Asia. What were its implications for the nationalist politics of Indian National Congress?\" ▪ Q. No. 7: \"What are the political and administrative implications of the Eighteenth Amendment to the 1973 Constitution of Pakistan?\" ▪ Q. No. 8: \"Write detailed notes on any TWO of the following: (a) European Union (b) South Asian Association for Regional Cooperation\"",
  "Theme: Focus on the evolution of federalism, local government, constitutional amendments, and political developments specific to",
  "\"Write a critical note on the 'Devolution of Power Plan 2000'. Explain its positive as well as negative points compared to the",
  "\"Discuss the evolution of Federalism in Pakistan with reference to its constitutional and political development from 1956 to date.\"",
  "\"Give a brief account of the historical evolution of Political Parties with reference to theories of origin of Parties. Also,",
  "\"Discuss the three principles for constituting the second chambers in a bicameral legislature.\"  2009:",
  "▪ (In Part-II, Section II, some questions address federal issues through constitutional history:) ▪ \"Discuss organization & functions of pressure groups. Point out indicators of its effectiveness also.\" ▪ \"Define and discuss Liberty and its Safeguards. Enlist the causes of its decline in Modern times also.\"",
  " 2010: ▪ \"Discuss Committee System in American Congress and point out its demerits. Also compare it with British Committee System.\"",
  "▪ \"How Local Government function in France? Discuss.\" ▪ \"What is Supreme Soviet? Discuss its powers and functions.\"",
  " 2011 (Part-II, Section II -- BS-17 Paper): ▪ \"How Grand National Assembly in Turkey is elected? Discuss its",
  "Powers and functions.\" ▪ \"Compare and analyse the role played by Judiciary in Pakistan and discuss future expectations and availability of options in the best interest of the state.\"",
  " 2012 (Set II -- Section II): ▪ *(Federal/constitutional developments are less emphasized in Set II;",
  " 2013: ▪ (Paper II) \"Write short notes on: (i) Examine the role of Quaid-i-Azam in the creation of Pakistan.\" ▪ \"Give a comparative analysis of the Islamic provisions of the 1956, 1962 and 1973 Constitutions of Pakistan.\"",
  " 2014: ▪ \"Discuss the role of Quaid-i-Azam in the creation of Pakistan.\" ▪ \"Write a comparative analysis of the Islamic provisions of the 1956, 1962 and 1973 Constitutions of Pakistan.\"",
  " 2015: ▪ \"How do local self governments strengthen democracy? Discuss why this system has not worked consistently in Pakistan.\"",
  " 2016: ▪ \"Discuss the issues and problems of federation in Pakistan. Compare with the US federation.\"",
  "▪ \"What are the political and administrative implications of the Eighteenth Amendment to the 1973 Constitution of Pakistan?\"",
  " 2017: ▪ (Section‑II, Q.6): \"What characteristic of society leads to adoption of federal form of government? How it can function",
  "successfully?\" ▪ (Section‑II, Q.7): \"Compare and contrast the differing roles played by political parties and interest groups in making public policy?\" ▪ (Section‑II, Q.8): \"What is Fascism and why is it considered to be the child of first half of 20th century events in Europe?\"",
  " 2018: ▪ (Section‑II, Q.4): \"Do you agree that Pakistan was achieved by 'Jinnah' through the 'constitutional democratic process for the sake",
  "of constitutional democracy'?\" ▪ (Section‑II, Q.5): \"Logically prove that 18th amendment of 1973 Constitution is considered to be the new social contract for provincial autonomy among the Pakistani political parties.\"",
  " 2019: ▪ (Section‑A, Q.4): \"Explain the concept of Nationality and distinguish between Nationality and Citizenship.\" *(While theoretical,",
  "this question touches upon the constitutional debates regarding state identity.)* ▪ (Section‑B, Q.6): \"How far 18th amendments will transform the existing federal system in Pakistan?\"",
  " 2020: ▪ (Section‑B, Q.7): \"Discuss the powers and functions of China's National People's Congress?\" and",
  "▪ \"Make a comparative analysis of the Constitution of 1956 and amended Constitution of Pakistan 1973?\"",
  " 2021: ▪ (Section‑B, Q. No. 6): \"What are the political and legal constraints over the sovereignty of parliament in Pakistan?\" *(also",
  "appears in Comparative section)* ▪ (Section‑B, Q. No. 7): \"The adoption of parliamentary system in Pakistan is the result of political experiences of Pakistanis in the past. Elaborate.\"",
  " 2022: ▪ (Section‑B, Q. No. 7): \"Discuss in detail the development of local‑self governments in Pakistan.\"",
  " 2023: ▪ (Section‑B, Q. No. 4): \"Do you agree that Pakistan was achieved by 'Jinnah' through the 'constitutional democratic process for the",
  "sake of constitutional democracy'?\" ▪ (Section‑B, Q. No. 6): \"How far 18th amendments will transform the existing federal system in Pakistan?\"",
  " 2024: ▪ (Section‑B, Q. No. 4): \"What are the main determinants of Pakistan's foreign policy? How current National Capacity has become a",
  "major challenge before an independent foreign policy of Pakistan?\" ▪ (Section‑B, Q. No. 5): \"In what circumstances might a democratic country turn to military dictatorship or totalitarian rule? Narrate it with case study.\"",
  "Theme: Questions that compare and contrast different international systems, discuss revolutionary movements, or evaluate the impact of",
  "\"Examine the role of the Communist Party in Chinese politics.\" \"Write notes on: (a) Islamic Revolution in Iran",
  "\"Write an essay on the structure and powers of the present local Government in Pakistan. Point out its merits and demerits.\"",
  "\"Examine the role of the Supreme Court in the evolution of the American Constitution.\" (Also part of comparative institutional",
  "\"Discuss the main characteristics of the Chinese Political System.\" \"Write notes on: (a) Fourteen Points of Quaid-e-Azam Muhammad Ali Jinnah",
  "(b) Role of Atatürk in building up modern Turkey\"  2009: ▪ \"Write notes on: (i) Islamic Revolution in Iran;",
  "(ii) Secularism in India.\"  2010: ▪ \"Discuss the factors that transformed Jinnah, the ambassador of",
  "Hindu Muslim Unity, into the Quaid-e-Azam Muhammad Ali Jinnah of the Muslims.\" ▪ \"In spite of the provisions of provincial autonomy in the 1973 constitution there are Anti-Centre feelings in the federating units. Discuss this statement with special reference to Baluchistan and Sindh.\"",
  " 2011 (Part-II, Section II -- BS-17 Paper): ▪ \"Discuss the salient features of the constitution of the Peoples",
  "Republic of China in comparison with the constitution of former Soviet Union.\" ▪ \"Write notes on ANY TWO of the following: (i) Factors responsible for evolution of Two Nation Theory; (ii) Basic principles of Iranian foreign policy; (iii) Impact on the region of Latest US President's visit to India.\"",
  " 2013: ▪ \"Discuss the concept of 'liberty' and its safeguards in modern society.\" ▪ \"Define political parties and their functions. In your view, which",
  "party system is most suitable for Pakistan?\"  2014: ▪ \"Critically examine the concept of justice by Plato.\"",
  "▪ \"Discuss in detail the powers and functions of the US Senate.\"  2015: ▪ \"The American Senate is the most powerful legislative body in the",
  "world. Explain.\" ▪ \"'The British PM is a shining moon among stars' -- discuss the position and powers of the English Prime Minister.\"",
  " 2016: ▪ \"Discuss the salient features of the judicial system in France and compare it with Britain and Pakistan.\"",
  "▪ \"The Senate of the USA is the most powerful Upper House in the world. Can you justify this statement?\" ▪ \"Discuss the political and administrative implications of the Eighteenth Amendment in Pakistan, and write detailed notes on European Union and SAARC.\"",
  " 2017: ▪ (Section‑II, Q.8): \"What is Fascism and why is it considered to be the child of first half of 20th century events in Europe?\"",
  " 2018: ▪ (Section‑II, Q.8): \"Write short notes on any TWO of the following: (a) Role of middle class in strengthening the democracy;",
  "(b) Violation of parliamentary values and traditions in Pakistan; (c) Significance of religious harmony in a state.\"",
  " 2019: ▪ (Section‑B, Q.8): \"Write down the major determinants of the foreign policy of Pakistan.\"",
  " 2020: ▪ (Section‑B, Q.4): \"Critically evaluate the role of Post‑World War‑II International Financial Regimes in the economic development of",
  "the less developed countries.\" ▪ (Section‑B, Q.8): \"In the Post‑World War‑II period, what were the important patterns of the Balance of Power?\"",
  "(Section‑A descriptive items are less explicitly international in 2021; however, the comparative essays in Section‑B address national",
  "integration and constitutional constraints with global perspectives.)*  2022: ▪ (Section‑B, Q. No. 8): \"Write short notes on any TWO of the",
  "following: (a) Islamic political ideology; (b) Forms of political culture.\"  2023: ▪ (Section‑B, Q. No. 8): \"Write down the major determinants of the",
  "foreign policy of Pakistan.\"  2024: ▪ (Section‑B, Q. No. 1 of the second Part‑II block): \"Which of the",
  "following is NOT a description of the American system of government?\" ▪ (Additional global/international MCQs appear in the 2024 Part‑I MCQ block covering Germany, France, the IMF, WTO, EU, etc.)",
  "2. Factual/Statement--Type (MCQ--Style) Questions Presented as Statements* These factual items test precise knowledge (names, dates, compositions,",
  "historical facts, and basic definitions). Although originally MCQs with answer options, here we list only the statement prompt (the \"stem\") along with the years in which they appeared.",
  "\"Identify the composition of the Supreme Court of Pakistan.\" 2001: Appears in the MCQ section.",
  "\"Identify the composition of the American Senate.\" 2001: Appears in the MCQ section. 2005: Appears in the MCQ section.",
  "\"Identify the original total number of States in the USA.\" 2001: Appears in the MCQ section. 2005: Appears in the MCQ section.",
  "\"Identify the nature of the Turkish Government.\" 2001: Appears in the MCQ section. 2005: Appears in the MCQ section.",
  "\"Identify the year in which the Eighth Amendment was adopted in the Constitution of Pakistan.\" 2001: Appears in the MCQ section.",
  "\"Identify the statement 'Political Science begins and ends with the state' as stated by the appropriate scholar.\"",
  "\"Identify which work is 'A Discourse on the Origin of Inequality and the Social Contract' and who presented it.\"",
  "2002: Appears twice within the paper. 2004: A very similar version appears as well. 2002: Appears twice within the paper.",
  "\"Identify the century in which the 19th-century Austrian theory of Sovereignty was refuted by pluralists.\"",
  "\"Identify the author of 'Political Science begins and ends with the state'\" 2002 & 2003: Variations appear in these years.",
  "(a) 9 judges (b) 11 judges (c) 13 judges (d) None of these\" 2005: \"The Supreme Court of Pakistan comprises:",
  "2. \"The Eighth Amendment was adopted in the Constitution of Pakistan in:\" 2001:* \"The Eighth Amendment was adopted in the Constitution of Pakistan in:",
  "3. \"Originally, the total number of States of the USA was:\" 2001:* \"Originally, the total number of States of the USA was:",
  "(a) Democratic (b) Dictatorial (c) Monarchical (d) None of these\" 2005: \"The Turkish government is:",
  "(a) Democratic (b) Dictatorial (c) Monarchical (d) None of these\" 5. \"The American Senate comprises:\"*",
  "2001: \"The American Senate comprises: (a) 99 Senators (b) 100 Senators (c) 101 Senators (d) None of these\"",
  "2005: \"The American Senate comprises: (a) 99 Senators (b) 100 Senators (c) 101 Senators (d) None of these\"",
  "6. \"Political Science begins and ends with the state\" is said by: 2002:* \"Political Science begins and ends with the state\" is said by:",
  "(a) Paul Janet (b) Stephen Leacock (c) Professor Garner (d) None of these 2003: \"Political Science begins and ends with the state\" is said by:",
  "(a) Aristotle (b) Professor Garner (c) Paul Janet (d) None of these 7. \"To rule is to educate\" is said by:*",
  "2002 (first instance): \"To rule is to educate\" is said by: (a) Muhammad (SAW) (b) Al-Ghazali",
  "2002 (second instance -- repeated verbatim within the same paper): \"To rule is to educate\" is said by:",
  "8. \"A Discourse on the Origin of Inequality and the Social Contract\" was presented by: 2002 (first instance):*",
  "\"A Discourse on the Origin of Inequality and the Social Contract\" was presented by: (a) J. J. Rousseau (b) Hobbes (c) John Locke (d) None of these",
  "2002 (second instance -- repeated verbatim): \"A Discourse on the Origin of Inequality and the Social Contract\" was",
  "presented by: (a) J. J. Rousseau (b) Hobbes (c) John Locke (d) None of these 9. \"Who said 'Polis' means:\"*",
  "2002 (first instance): \"Who said 'Polis' means: (a) Civilized people (b) A form of government",
  "(c) A city-state (d) None of these\" 2002 (second instance -- repeated): \"Who said 'Polis' means:",
  "\"19th-century Austrian theory of Sovereignty was refuted by Pluralists: (a) 5th century (b) 18th century (c) 20th century (d) None of these\"",
  "(This question appears twice in 2004 exactly as follows in both instances:)* \"According to Aristotle, the end of the State is:",
  "(a) Logical (b) Legal (c) Ethical (d) None of these\" \"Al-Farabi by birth was:\" (Appears twice in 2004 exactly as follows:)*",
  "\"Al-Mawardi was a jurist who followed the fiqah of:\" (Appears twice in 2004 exactly as follows:)*",
  "\"Al-Mawardi was a jurist who followed the fiqah of: (a) Imam Malik (b) Imam Shafi (c) Imam Abu Hanifa (d) None of these\"",
  "\"Jean Rousseau was born at:\" (Appears twice in 2004 exactly as follows:)* \"Jean Rousseau was born at:",
  "\"According to John Locke, the best form of Government is:\" (Appears twice in 2004 exactly as follows:)*",
  "\"According to John Locke, the best form of Government is: (a) Monarchy (b) Aristocracy (c) Democracy (d) None of these\"",
  "\"The term 'anarchism' has been derived from the word 'anarchia,' which is basically a:\" (Appears twice in 2004 exactly as follows:)*",
  "\"The term 'anarchism' has been derived from the word 'anarchia,' which is basically a: (a) Greek word (b) Latin word (c) French word (d) None of these\"",
  "\"Anarchism is the extreme left-wing of Socialism. It was first expounded as a political doctrine by:\" (Appears twice in 2004 exactly as follows:)*",
  "\"Anarchism is the extreme left-wing of Socialism. It was first expounded as a political doctrine by: (a) William Godwin (b) Prince Kropotkin (c) Proudhon (d) None of these\"",
  "\"Introduction to the Principles of Morals and Legislation (1789)\" was written by: (Appears twice in 2004 exactly as follows:)*",
  "\"Introduction to the Principles of Morals and Legislation (1789)\" was written by: (a) Jeremy Bentham (b) J. S. Mill (c) John Locke (d) None of these\"",
  "\"Iqtisad-fil-Itiqad was written by:\" (Appears twice in 2004 exactly as follows:)* \"Iqtisad-fil-Itiqad was written by:",
  "(a) Al-Mawardi (b) Al-Farabi (c) Al-Ghazali (d) None of these\" \"Siyasat Nama was written by:\" (Appears twice in 2004 exactly as follows:)*",
  "\"Siyasat Nama was written by: (a) Nizam-ul-Mulk (b) Al-Ghazali (c) Ibn Khaldun (d) None of these\"",
  "\"Ilmul-Iqtisad was written by:\" (Appears twice in 2004 exactly as follows:)* \"Ilmul-Iqtisad was written by:",
  "\"Reconstruction of Religious Thought in Islam was written by:\" (Appears twice in 2004 exactly as follows:)*",
  "\"Reconstruction of Religious Thought in Islam was written by: (a) Rosenthal (b) Mawardi (c) Ibn Khaldun (d) None of these\"",
  "\"A Discourse on the Origin of Inequality and Social Contract was presented by:\" (Appears twice in 2004 exactly as follows:)*",
  "\"A Discourse on the Origin of Inequality and Social Contract was presented by: (a) Hobbes (b) Locke (c) Rousseau (d) None of these\"",
  "\"According to Allama Iqbal, in which form of Government are heads counted?\" (Appears twice in 2004 exactly as follows:)*",
  "\"According to Allama Iqbal, in which form of Government are heads counted? (a) Oligarchy (b) Democracy (c) Polity (d) None of these\"",
  "\"The turning point in the life of Plato came in the year 399 BC when he was of:\" (Appears twice in 2004 exactly as follows:)*",
  "\"The turning point in the life of Plato came in the year 399 BC when he was of: (a) 28 years (b) 20 years (c) 24 years (d) None of these\"",
  "\"The great political scientist/philosopher Aristotle died in the year:\" (Appears twice in 2004 exactly as follows:)*",
  "\"The great political scientist/philosopher Aristotle died in the year: (a) 347 BC (b) 322 BC (c) None of these\"",
  "\"Plato went to Syracuse to teach philosophy to the tyrant King Dionysus but returned disappointed and opened his Academy. He wrote",
  "treatises in the form of dialogue up to the number of:\" (Appears twice in 2004 exactly as follows:)*",
  "\"Plato went to Syracuse to teach philosophy to the tyrant King Dionysus but returned disappointed and opened his Academy. He wrote treatises in the form of dialogue up to the number of: (a) 20 (b) 36 (c) 38 (d) None of these\"",
  "\"The great but ungrateful pupil of his master, who was born in 384 BC, was:\" (Appears twice in 2004 exactly as follows:)*",
  "\"The great but ungrateful pupil of his master, who was born in 384 BC, was: (a) Socrates (b) Aristocles (c) Aristotle (d) None of these\"",
  "\"The fascism of Plato got birth in the 4th Century BC, whereas modern fascism is the product of early:\" (Appears twice in 2004 exactly as follows:)*",
  "\"The fascism of Plato got birth in the 4th Century BC, whereas modern fascism is the product of early: (a) 18th Century (b) 19th Century (c) 20th Century (d) None of these\"",
  "\"An Essay Concerning Human Understanding was published in 1690. It is the most important work of:\" (Appears twice in 2004 exactly as follows:)*",
  "\"An Essay Concerning Human Understanding was published in 1690. It is the most important work of: (a) J. S. Mill (b) Bentham (c) Thomas Hobbes (d) None of these\"",
  "- \"An Essay concerning Human Understanding was published in 1690, is the most important work of: ...\"",
  "(In the 2010 Paper I, the following block is repeated identically; similar repetition occurs in Paper II.)*",
  "- \"The sovereignty in Islamic Political System belongs to: ...\" Item on the Founder of Communism: - \"The founder of communism is: ...\"",
  "- \"According to Plato the population of an ideal state should be: ...\" Item on the Death Year of Abu Nasar Farabi: - \"Abu Nasar Farabi died in the year: ...\"",
  "Item on the Identity of Waliud Din Abdur Rehman: - \"Waliud Din Abdur Rehman famously known as: ...\"",
  "Item on the Original Application of the Term 'Polity': - \"The term POLITY is originally applied to: ...\"",
  "- \"The famous book 'The Spirit of Laws' written by Montesquieu was published in: ...\" Item on Aristotle's Death: - \"The Greek philosopher Aristotle died in: ...\"",
  "Item on the Authorship of 'Sairul Malook': - \"The book 'Sairul Malook' was written by: ...\" Item on the Originator of Fascism: - \"Benito Mussolini was the originator of: ...\"",
  "Because the entire block appears twice in each 2010 paper, these items clearly signal high--yield topics.*",
  "(While 2011's MCQ section does not show the same internal duplication as 2010, several items focus on similar themes as in previous years.)*",
  "- \"Tahafut al-falasifa (Incoherence of Philosophers) was written by: ...\" Item on Ibn Khaldun's 'Muqaddimah':",
  "- \"A legal proceeding during which an individual's right to hold an office or governmental privilege is challenged, is called: ...\"",
  "- (2013) \"The spirit of Law\" appears as the correct stem in the options. • \"Leviathan is a book written by:\"",
  "- (2013) Stem appears with options; the answer is \"Aristotle.\" • \"Al-Farabi made everlasting contribution to:\"",
  "- (2013) Stem appears (answer: \"Political thought\"). • \"Al-Ghazali was appointed in Nizamia College as a professor of:\" - (2013) Stem appears (answer: \"Theology\").",
  "• \"Asbiyah was the term used by:\" - (2013) Stem appears (answer: \"Arabs\"). • \"'The economics is the factor causing revolutions, movements or",
  "wars' is the claim of:\" - (2013) Stem appears (answer: \"Karl Marx\"). • \"Dr. Iqbal graduated in the year of:\"",
  "- (2013) Stem appears (answer based on options, e.g., \"1887\" etc.). • \"Jean Bodin presented the concept of sovereignty in the book of:\"",
  "- (2013) Stem appears (answer: \"Individualism\" is likely correct). • \"The term 'elite' was first began to use in:\"",
  "- (2013) Stem appears (options include \"France and Germany\"). • \"The constitution is not written and rigid in:\" - (2013) Stem appears (answer: \"Confedration\").",
  "\"Identify the author of 'Political Science begins and ends with the state'\" appears in slightly different forms in 2002 and 2003.",
  "\"Identify the statement 'To rule is to educate' as attributed to the appropriate historical figure\" appears multiple times (notably twice",
  "\"Identify which work is 'A Discourse on the Origin of Inequality and the Social Contract' along with its presenter\" appears in 2002 (twice)",
  "\"Identify the meaning of 'Polis'\" and \"Identify the refutation of the 19th-century Austrian theory of Sovereignty by pluralists, noting the",
  "3. Miscellaneous Themes and Additional Repeated Essay Topics* Beyond the primary clusters above, several other themes recur in various",
  "2005: \"Discuss the powers of the President of France under the Fifth Republic.\" On Parliamentary and Legislative Processes:",
  "2004: \"Comparatively discuss the law-making process in the Parliament of Britain and Congress of the United States.\"",
  "2002: \"The dissolution of the Khilafat and the establishment of the 'Grand National Assembly' in Turkey was highly appreciated",
  "2005: \"Who was the author of the famous book 'The Spirit of Islam'?\" (repeated factual item in context)",
  "2002: Multiple factual questions on leadership (e.g., \"Who was the first American President?\", \"Who was the President of the US",
  "2005: Questions such as \"Write notes on: (a) Fourteen Points of Quaid-e-Azam Muhammad Ali Jinnah; (b) Role of Atatürk in building up"
]