[
  "Q3). b. Frederick Taylor's Scientific Management (2006 Q2, 2008 Part I Q2). c. Human Relations Movement (Hawthorne Studies) (2008 Q3, 2007 MCQ on Elton Mayo).",
  "d. Henri Fayol's Principles (2008 Part I Q6). Bureaucracy in Pakistan: a. Critiques of bureaucracy's role in development (2007 Q2).",
  "b. Bureaucratic power vs. effectiveness (2008 Q4). c. Colonial legacy of CSP officers (2008 Q5). Governance Mechanisms:",
  "Q7). c. National Accountability Strategy (2006 Q6). Local Governance and Devolution: a. Devolution Programme strengths/weaknesses (2006 Q7).",
  "b. Local Government Ordinance 2001's impact (2008 Q7). c. Project planning across government tiers (2009 Q8).",
  "b. Organizational behavior (MCQs across all years). Merit System vs. Scientific Management: a. Tension between merit systems and scientific management (2007",
  "Application to Pakistan: Most essays require linking theories to Pakistan's context (e.g., PPP examples, CSP officers' legacy).",
  "E-Government (2011 Q8a), Judicial Activism (2011 Q8b), Theory X/Y (2011 Q8d), Zero-Based Budgeting (2014 Q8c), Planning Machinery",
  "2019 Q2: Define public administration and discuss its relationship with politics. Prismatic-Sala Model (Fred Riggs): 2017 Q4.",
  "2015 Q7: Administrative accountability as a \"pipe dream\" in Pakistan. 2018 Q6: Corruption types, causes, and control.",
  "2016 Q8(a)/(b)/(c): Incremental, PPBS, Dissensus Budgeting. 2017 Q8(a): Zero-based budgeting. 2019 Q7: Budgeting process in Pakistan.",
  "2018 Q5: Factors fatal to policy implementation in Pakistan. 2019 Q3: John Rawls' theory of public interest.",
  "Budgeting Systems (Zero-based vs. Incremental). Below are recurring themes, topics, and questions across the past",
  "Pattern*: Frequent comparisons of bureaucratic theories (Weberian, NPM) and their compatibility with democratic governance, especially in",
  "Pattern*: Corruption is a recurring issue, often linked to Pakistan's governance challenges and democratic deficits.",
  "2020 (Q4): Role of government in HRM; challenges in public enterprises. 2021 (Q3): Civil Service neutrality.",
  "Pattern*: Focus on inefficiencies in HRM processes (recruitment, accountability) and politicization of civil services in Pakistan.",
  "Pattern*: Theoretical frameworks (classical and modern) are tested for their application in Pakistan's administrative context.",
  "Pakistan-Centric Analysis: Most questions demand application of theories to Pakistan's administrative system (e.g., HRM challenges,"
]