[
  "b. Conjugation in Paramecium (2002, 2003) c. Pathogenic Protozoa (2004) d. Contractile Vacuole Function (2001 MCQ, 2003 MCQ)",
  "b. Nephridia Types (2001) a. Respiratory Systems (Tracheal Apparatus) (2003, 2004) b. Adaptive Modifications of Insect Legs (2003, 2004)",
  "Compulsory Questions: Focus on taxonomy (e.g., coelom types, insect legs), basic physiology (urea formation), and iconic examples",
  "Paper II: Genetics (meiosis, linkage) and evolutionary theories dominate. Environmental issues like pollution and the nitrogen cycle",
  "Study Priority*: Master Section A (invertebrates) and Section B (vertebrate systems, evolution). Practice MCQs on taxonomy and",
  "ii. \"Protozoa and diseases\" (2009). iii. \"Reproduction in Paramecium\" (2011). b. MCQs: Contractile vacuole (osmoregulation), disease-causing",
  "a. Repeated Questions: i. \"Birds as glorified reptiles\" (2010). b. MCQs: Carapace in turtles (2007).",
  "(ATP production). a. Repeated Questions: i. Semi-conservative DNA replication (2006, 2011). ii. Transcription/translation (2009, 2011).",
  "Anatomy & Physiology★ Vertebrate heart types (fish, amphibians, reptiles, birds, mammals) (2012, 2013, 2014, 2015).",
  "Advice for Preparation*: Focus on diagrammatic explanations for anatomy/physiology, memorize evolutionary theories, and practice writing",
  "Gas Exchange: 2018 Q8a: Reptiles. 2020 Q2/Q8f: Reptiles and mammals. Digestive Systems: 2017 Q5: Carbohydrate/fat digestion.",
  "2020 Q6: Flatworm digestion. Glands and Hormones: 2018 Q3: Endocrine vs. exocrine glands. 2017 Q6: Hypothalamus hormones.",
  "2020 Q3: Adrenal gland hormones. 2017 Q7: Thyroid hormone regulation. Core Concepts: 2018 Q8c: Mendel's laws.",
  "2019 Q5: Gene mutation vs. chromosomal aberration. 2020 Q5: X-linked recessive inheritance. 2017 Q8b: Neo-Darwinian theory.",
  "2020 Q8a: Hardy-Weinberg theorem. Arthropods: 2018 Q4: Exoskeleton (Crustaceans vs. insects). 2017 Q3: Arthropod vector ecology.",
  "2017 Q4 & 2019 Q3: Comparative phylogeny and hallmarks of chordates. Climate Change: 2017 Q2: Forests' role in mitigation.",
  "Exam Strategy*: Focus on comparative physiology, endocrine mechanisms, invertebrate biology, and genetics. Review short-note topics",
  "Always cross-reference past papers for overlapping topics (e.g., chordates in 2021 and 2024). Emerging Trends:"
]